-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2026-05-03 03:50:47
-- 服务器版本： 8.0.35
-- PHP 版本： 8.1.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `pet_home`
--

-- --------------------------------------------------------

--
-- 表的结构 `addresses`
--

CREATE TABLE `addresses` (
  `id` bigint NOT NULL COMMENT '地址ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `contact_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '收货人姓名',
  `contact_phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '收货人电话',
  `province` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '省份',
  `city` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '城市',
  `district` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '区/县',
  `street` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '街道',
  `detail` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '详细地址',
  `is_default` tinyint(1) DEFAULT '0' COMMENT '是否默认地址：0-否，1-是',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='收货地址表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `addresses`
--

INSERT INTO `addresses` (`id`, `user_id`, `contact_name`, `contact_phone`, `province`, `city`, `district`, `street`, `detail`, `is_default`, `create_time`, `update_time`) VALUES
(4, 76, 'q', '15278562763', '广东省', '广州市', '花都区', NULL, '123', 1, '2026-03-24 08:32:28', '2026-03-24 08:32:28'),
(6, 75, '测试一', '15278562769', '广东省', '广州市', '越秀区', NULL, '123', 0, '2026-04-20 02:47:33', '2026-04-24 03:13:11'),
(7, 75, '测试2', '15278562763', '广东省', '中山市', '民众街道', NULL, '123', 1, '2026-04-24 02:18:15', '2026-04-26 02:49:01');

-- --------------------------------------------------------

--
-- 表的结构 `admin`
--

CREATE TABLE `admin` (
  `id` bigint NOT NULL COMMENT '管理员ID',
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '登录账号',
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '登录密码（加密存储）',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '员工姓名',
  `role` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色：super_admin（超级管理员）/ staff（普通员工）',
  `store_id` bigint DEFAULT NULL COMMENT '所属店铺ID（关联stores表，null表示平台管理员）',
  `service_store_id` bigint DEFAULT NULL COMMENT '所属服务门店ID(service_stores)，用于排班与预约分配；NULL表示平台级',
  `doctor_id` bigint DEFAULT NULL COMMENT '关联的医师ID（关联doctors表）',
  `department` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '所属部门/服务类型（上门铲屎、宠物寄养等）',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '联系电话',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '邮箱',
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '头像URL',
  `status` tinyint DEFAULT '1' COMMENT '状态：1启用，0禁用',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='管理员表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `admin`
--

INSERT INTO `admin` (`id`, `username`, `password`, `name`, `role`, `store_id`, `service_store_id`, `doctor_id`, `department`, `phone`, `email`, `avatar`, `status`, `create_time`, `update_time`) VALUES
(1, 'admin', '$2a$10$DI8/uLGJvRCz61.IuQqd1e/CFrciy8t3qtp4WyPcI4uvM2c9HclgW', '系统管理员', 'super_admin', NULL, NULL, NULL, NULL, NULL, NULL, '/upload/files/files-20260401215955-33bbfebd.jpg', 1, '2025-11-04 13:16:30', '2025-11-04 13:16:30'),
(47, 'thfw1', '$2a$10$HAm.fkWf7GTB.zmlwNpMReD08hSmViNZDmcefm28jLZKoHZ49/lWO', '天河服务人员1', 'staff', NULL, 1, NULL, '上门铲屎', '15278562762', NULL, 'https://situationship.icu/upload/files/files-20260324010902-81992898.jpg', 1, '2026-03-24 00:51:24', '2026-03-24 01:09:07'),
(48, 'thfw2', '$2a$10$EHfYC8Uoe9PtFTL/D7QKA.Pdeu1RSF/dyXgihOgXzIvAL1R4CUe2.', '天河服务人员2', 'staff', NULL, 1, NULL, '宠物医院部门', '15278562768', NULL, 'https://situationship.icu/upload/files/files-20260324010832-2cce4680.jpg', 1, '2026-03-24 00:52:45', '2026-03-24 01:08:47'),
(51, 'zjfw1', '$2a$10$3SCRi0MfN5ESp6xURkGCv.mQ1GYW6/14RgwX58rTg2ioLyNvVfTmW', '珠江服务人员1', 'staff', NULL, 2, NULL, '上门铲屎', '15278562765', NULL, 'https://situationship.icu/upload/files/files-20260324010631-0ab330db.jpg', 1, '2026-03-24 00:55:57', '2026-04-16 00:54:55'),
(52, 'zjfw2', '$2a$10$ieJArTuO8Svw5SZgkj2Ns.OhBZOnLTl81lTl82eF89zRqGiiCdESq', '珠江服务人员2', 'staff', NULL, 2, NULL, '宠物医院部门', '15278562765', NULL, 'https://situationship.icu/upload/files/files-20260324010612-e050c539.jpg', 1, '2026-03-24 00:56:21', '2026-04-16 00:31:56'),
(56, 'thfw3', '$2a$10$JEBDnPPdzCa2.ihFpLWVIOwusDbFjU7WuXIOhQvZGxmbG87bf.VzK', '天河服务人员3', 'staff', NULL, 1, NULL, '宠物洗护', '15278562739', NULL, 'https://situationship.icu/upload/files/files-20260325123940-1f4e959f.jpg', 1, '2026-03-25 12:38:54', '2026-03-25 12:39:55'),
(57, 'zjfw3', '$2a$10$8dPmsoQvmR6Bl7IpibP47O.HBE0ap3Uxjh1EMleyFpRlROCzz3ioq', '珠江服务人员3', 'staff', NULL, 2, NULL, '宠物洗护', '15278562719', NULL, 'https://situationship.icu/upload/files/files-20260325124004-cf194702.jpg', 1, '2026-03-25 12:39:17', '2026-03-25 12:40:13'),
(58, 'zjgl', '$2a$10$gsbYGh6FhhmcGGci086anOjBLosXWx2ShFn1c.3crOkEEUdGO87.G', '张三', 'store_admin', NULL, 2, NULL, NULL, '15278562763', NULL, 'https://situationship.icu/upload/files/files-20260422230600-b8e0b301.png', 1, '2026-04-22 03:39:56', '2026-04-23 00:07:00'),
(59, 'thgl', '$2a$10$amUnKbqhDb6H61OYWbx0se2AyYZEdzFd6bv8WJSOTaT4rFkFlOsLS', '李四', 'store_admin', NULL, 1, NULL, NULL, '15278562769', NULL, 'https://situationship.icu/upload/files/files-20260422230545-5369e9eb.png', 1, '2026-04-22 03:40:59', '2026-04-23 00:06:53');

-- --------------------------------------------------------

--
-- 表的结构 `admin_permissions`
--

CREATE TABLE `admin_permissions` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `admin_id` bigint NOT NULL COMMENT '管理员账号ID（关联admin表）',
  `permission_code` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限代码（对应路由路径或功能代码）',
  `permission_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限名称（用于显示）',
  `status` tinyint DEFAULT '1' COMMENT '状态：1启用，0禁用',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='管理员权限表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `admin_permissions`
--

INSERT INTO `admin_permissions` (`id`, `admin_id`, `permission_code`, `permission_name`, `status`, `create_time`, `update_time`) VALUES
(2, 20, '/content/customer-service', '客服管理', 1, '2026-01-23 01:55:34', '2026-01-23 01:55:34'),
(3, 20, '/services/consultations', '在线咨询', 1, '2026-01-23 01:55:34', '2026-01-23 01:55:34'),
(32, 23, '/mall/orders', '订单管理', 1, '2026-01-23 22:42:41', '2026-01-23 22:42:41'),
(33, 23, '/mall/products', '商品管理', 1, '2026-01-23 22:42:41', '2026-01-23 22:42:41'),
(34, 23, '/mall/refunds', '退款售后', 1, '2026-01-23 22:42:41', '2026-01-23 22:42:41'),
(35, 23, '/mall/stores', '商家管理', 1, '2026-01-23 22:42:41', '2026-01-23 22:42:41'),
(36, 23, '/content/customer-service', '客服管理', 1, '2026-01-23 22:42:41', '2026-01-23 22:42:41'),
(37, 23, '/content/store-customer-chat', '店铺客服聊天', 1, '2026-01-23 22:42:41', '2026-01-23 22:42:41'),
(38, 22, '/mall/orders', '订单管理', 1, '2026-01-23 23:50:31', '2026-01-23 23:50:31'),
(39, 22, '/mall/products', '商品管理', 1, '2026-01-23 23:50:31', '2026-01-23 23:50:31'),
(40, 22, '/mall/refunds', '退款售后', 1, '2026-01-23 23:50:31', '2026-01-23 23:50:31'),
(41, 22, '/mall/stores', '商家管理', 1, '2026-01-23 23:50:31', '2026-01-23 23:50:31'),
(42, 22, '/content/customer-service', '客服管理', 1, '2026-01-23 23:50:31', '2026-01-23 23:50:31'),
(43, 22, '/content/store-customer-chat', '店铺客服聊天', 1, '2026-01-23 23:50:31', '2026-01-23 23:50:31'),
(45, 24, '/services/consultations', '在线咨询管理', 1, '2026-01-24 03:24:08', '2026-01-24 03:24:08'),
(46, 26, '/services/consultations', '在线咨询管理', 1, '2026-01-25 01:09:38', '2026-01-25 01:09:38'),
(47, 26, '/services/doctors', '专业医师管理', 1, '2026-01-25 01:09:38', '2026-01-25 01:09:38'),
(48, 28, '/services/litter-service', '上门铲屎服务管理', 1, '2026-01-31 19:45:56', '2026-01-31 19:45:56'),
(49, 28, '/services/hospital-service', '宠物医院服务管理', 1, '2026-01-31 19:45:56', '2026-01-31 19:45:56'),
(50, 28, '/content/team', '团队管理', 1, '2026-01-31 19:45:56', '2026-01-31 19:45:56'),
(51, 28, '/services/grooming-services', '洗护服务管理', 1, '2026-01-31 19:45:56', '2026-01-31 19:45:56'),
(52, 28, '/services/verify', '订单核销', 1, '2026-01-31 19:45:56', '2026-01-31 19:45:56'),
(53, 42, '/services/litter-service', '上门铲屎服务管理', 1, '2026-02-01 21:21:54', '2026-02-01 21:21:54'),
(54, 42, '/services/grooming-services', '洗护服务管理', 1, '2026-02-01 21:21:54', '2026-02-01 21:21:54'),
(55, 42, '/services/hospital-service', '宠物医院服务管理', 1, '2026-02-01 21:21:54', '2026-02-01 21:21:54'),
(56, 42, '/services/verify', '订单核销', 1, '2026-02-01 21:21:54', '2026-02-01 21:21:54'),
(57, 43, '/services/hospital-service', '宠物医院服务管理', 1, '2026-02-01 21:24:31', '2026-02-01 21:24:31'),
(58, 43, '/services/grooming-services', '洗护服务管理', 1, '2026-02-01 21:24:31', '2026-02-01 21:24:31'),
(59, 43, '/services/litter-service', '上门铲屎服务管理', 1, '2026-02-01 21:24:31', '2026-02-01 21:24:31'),
(60, 43, '/services/verify', '订单核销', 1, '2026-02-01 21:24:31', '2026-02-01 21:24:31'),
(61, 43, '/content/team', '团队管理', 1, '2026-02-01 21:24:31', '2026-02-01 21:24:31'),
(62, 44, '/services/litter-service', '上门铲屎服务管理', 1, '2026-02-01 22:00:21', '2026-02-01 22:00:21'),
(63, 44, '/services/grooming-services', '洗护服务管理', 1, '2026-02-01 22:00:21', '2026-02-01 22:00:21'),
(64, 44, '/services/hospital-service', '宠物医院服务管理', 1, '2026-02-01 22:00:21', '2026-02-01 22:00:21'),
(65, 44, '/services/verify', '订单核销', 1, '2026-02-01 22:00:21', '2026-02-01 22:00:21'),
(66, 45, '/services/hospital-service', '宠物医院服务管理', 1, '2026-02-01 22:02:49', '2026-02-01 22:02:49'),
(67, 45, '/services/consultations', '在线咨询管理', 1, '2026-02-01 22:02:49', '2026-02-01 22:02:49'),
(68, 45, '/services/litter-service', '上门铲屎服务管理', 1, '2026-02-01 22:02:49', '2026-02-01 22:02:49'),
(69, 45, '/services/grooming-services', '洗护服务管理', 1, '2026-02-01 22:02:49', '2026-02-01 22:02:49'),
(70, 45, '/services/verify', '订单核销', 1, '2026-02-01 22:02:49', '2026-02-01 22:02:49'),
(71, 41, '/services/consultations', '在线咨询管理', 1, '2026-02-01 22:45:05', '2026-02-01 22:45:05'),
(95, 56, '/content/banner', '轮播图管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(96, 56, '/content/community', '社区管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(97, 56, '/content/team', '团队管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(98, 56, '/content/notice', '公告管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(99, 56, '/content/hot-products', '热门推荐管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(100, 56, '/mall/store-customer-chat', '店铺客服', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(101, 56, '/mall/orders', '订单管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(102, 56, '/mall/stores', '商家管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(103, 56, '/mall/products', '商品管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(104, 56, '/mall/refunds', '退款售后', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(105, 56, '/services/doctors', '专业医师管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(106, 56, '/services/time-slots', '预约时间段管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(107, 56, '/services/hospital-service', '宠物医院服务管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(108, 56, '/services/grooming-services', '洗护服务管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(109, 56, '/services/outlet-customer-chat', '门店客服', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(110, 56, '/services/consultations', '在线咨询管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(111, 56, '/users/list', '用户列表', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(112, 56, '/users/statistics', '用户统计', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(113, 56, '/users/platform-customer-chat', '平台客服', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(114, 56, '/users/permissions', '权限管理', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(115, 56, '/reports/dashboard', '数据大屏', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(116, 56, '/reports/users', '用户报表', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(117, 56, '/reports/sales', '销售报表', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(118, 56, '/reports/products', '商品报表', 1, '2026-04-19 19:41:36', '2026-04-19 19:41:36'),
(119, 55, '/services/doctors', '专业医师管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(120, 55, '/users/statistics', '用户统计', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(121, 55, '/users/platform-customer-chat', '平台客服', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(122, 55, '/users/permissions', '权限管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(123, 55, '/users/list', '用户列表', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(124, 55, '/services/verify', '订单核销', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(125, 55, '/services/time-slots', '预约时间段管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(126, 55, '/services/outlet-customer-chat', '门店客服', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(127, 55, '/services/litter-service', '上门铲屎服务管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(128, 55, '/services/hospital-service', '宠物医院服务管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(129, 55, '/services/grooming-services', '洗护服务管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(130, 55, '/content/banner', '轮播图管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(131, 55, '/services/consultations', '在线咨询管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(132, 55, '/reports/users', '用户报表', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(133, 55, '/reports/sales', '销售报表', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(134, 55, '/reports/products', '商品报表', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(135, 55, '/reports/dashboard', '数据大屏', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(136, 55, '/content/team', '团队管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(137, 55, '/content/notice', '公告管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(138, 55, '/content/hot-products', '热门推荐管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(139, 55, '/content/community', '社区管理', 1, '2026-04-19 19:43:09', '2026-04-19 19:43:09'),
(141, 54, '/services/consultations', '在线咨询管理', 1, '2026-04-20 21:51:37', '2026-04-20 21:51:37'),
(172, 57, '/service-orders/appointment-orders', '预约订单管理', 1, '2026-04-23 13:34:09', '2026-04-23 13:34:09'),
(173, 57, '/my-schedule', '我的排班', 1, '2026-04-23 13:34:09', '2026-04-23 13:34:09'),
(174, 57, '/verify', '订单核销', 1, '2026-04-23 13:34:09', '2026-04-23 13:34:09'),
(175, 48, '/service-orders/appointment-orders', '预约订单管理', 1, '2026-04-23 13:34:17', '2026-04-23 13:34:17'),
(176, 48, '/my-schedule', '我的排班', 1, '2026-04-23 13:34:17', '2026-04-23 13:34:17'),
(177, 48, '/verify', '订单核销', 1, '2026-04-23 13:34:17', '2026-04-23 13:34:17'),
(178, 59, '/service-staff', '服务人员管理', 1, '2026-04-24 03:38:50', '2026-04-24 03:38:50'),
(179, 59, '/service-orders/appointment-orders', '预约订单管理', 1, '2026-04-24 03:38:50', '2026-04-24 03:38:50'),
(180, 59, '/my-schedule', '我的排班', 1, '2026-04-24 03:38:50', '2026-04-24 03:38:50'),
(181, 59, '/verify', '订单核销', 1, '2026-04-24 03:38:50', '2026-04-24 03:38:50'),
(182, 59, '/outlet-customer-chat', '门店客服', 1, '2026-04-24 03:38:50', '2026-04-24 03:38:50'),
(183, 58, '/service-staff', '服务人员管理', 1, '2026-04-24 03:38:54', '2026-04-24 03:38:54'),
(184, 58, '/service-orders/appointment-orders', '预约订单管理', 1, '2026-04-24 03:38:54', '2026-04-24 03:38:54'),
(185, 58, '/my-schedule', '我的排班', 1, '2026-04-24 03:38:54', '2026-04-24 03:38:54'),
(186, 58, '/verify', '订单核销', 1, '2026-04-24 03:38:54', '2026-04-24 03:38:54'),
(187, 58, '/outlet-customer-chat', '门店客服', 1, '2026-04-24 03:38:54', '2026-04-24 03:38:54');

-- --------------------------------------------------------

--
-- 表的结构 `appointment_cancellation_request`
--

CREATE TABLE `appointment_cancellation_request` (
  `id` bigint NOT NULL,
  `appointment_type` varchar(32) COLLATE utf8mb4_general_ci NOT NULL COMMENT '预约类型: grooming, hospital, door_cleaning',
  `appointment_id` bigint NOT NULL COMMENT '预约ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `reason` varchar(1024) COLLATE utf8mb4_general_ci NOT NULL COMMENT '取消原因',
  `status` varchar(24) COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'pending' COMMENT 'pending-待确认, approved-已同意, rejected-已拒绝',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='取消预约申请';

--
-- 转存表中的数据 `appointment_cancellation_request`
--

INSERT INTO `appointment_cancellation_request` (`id`, `appointment_type`, `appointment_id`, `user_id`, `reason`, `status`, `create_time`, `update_time`) VALUES
(2, 'hospital', 27, 75, '测试', 'pending', '2026-05-03 00:18:18', '2026-05-03 00:18:18');

-- --------------------------------------------------------

--
-- 表的结构 `appointment_change_request`
--

CREATE TABLE `appointment_change_request` (
  `id` bigint NOT NULL,
  `appointment_type` varchar(32) COLLATE utf8mb4_general_ci NOT NULL COMMENT '预约类型: unified, grooming, hospital, door_cleaning',
  `appointment_id` bigint NOT NULL COMMENT '预约ID',
  `requested_date` date DEFAULT NULL COMMENT '申请变更的日期',
  `requested_time_slot` varchar(32) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '申请变更的时间段',
  `requested_location` varchar(512) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '申请变更的地址/地点',
  `requested_remark` varchar(1024) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '申请变更的备注',
  `requested_contact_phone` varchar(32) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '申请变更的联系电话',
  `status` varchar(24) COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'pending' COMMENT 'pending-待确认, approved-已同意, rejected-已拒绝',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `requested_key_handover_method` varchar(64) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '上门铲屎：申请变更的钥匙给予方式',
  `requested_key_return_method` varchar(64) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '上门铲屎：申请变更的钥匙归还方式',
  `requested_pet_id` bigint DEFAULT NULL COMMENT '申请变更的宠物ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='预约变更申请';

--
-- 转存表中的数据 `appointment_change_request`
--

INSERT INTO `appointment_change_request` (`id`, `appointment_type`, `appointment_id`, `requested_date`, `requested_time_slot`, `requested_location`, `requested_remark`, `requested_contact_phone`, `status`, `create_time`, `update_time`, `requested_key_handover_method`, `requested_key_return_method`, `requested_pet_id`) VALUES
(6, 'hospital', 14, '2026-03-27', '09:00-10:00', '广州市天河区天河路567号宠物之家', NULL, '15278562769', 'approved', '2026-03-26 02:45:31', '2026-03-26 02:45:51', NULL, NULL, 13),
(7, 'hospital', 15, '2026-04-03', '15:00-16:00', '广州市天河区天河路567号宠物之家', NULL, '15278562768', 'approved', '2026-04-01 22:21:56', '2026-04-01 22:43:51', NULL, NULL, 14),
(8, 'hospital', 17, '2026-04-04', '15:00-16:00', '广州市天河区天河路567号宠物之家', NULL, '15278562765', 'rejected', '2026-04-03 01:03:58', '2026-04-23 14:10:54', NULL, NULL, 13),
(9, 'hospital', 19, '2026-04-14', '10:00-11:00', '广州市天河区天河路567号宠物之家', NULL, '15278562769', 'cancelled', '2026-04-13 19:04:59', '2026-04-13 19:05:09', NULL, NULL, 13),
(10, 'hospital', 26, '2026-05-03', '09:00-10:00', '广州市天河区天河路567号宠物之家', NULL, '15278562765', 'pending', '2026-05-03 00:16:44', '2026-05-03 00:16:44', NULL, NULL, 17);

-- --------------------------------------------------------

--
-- 表的结构 `appointment_reminder_sent`
--

CREATE TABLE `appointment_reminder_sent` (
  `id` bigint NOT NULL,
  `appointment_type` varchar(50) COLLATE utf8mb4_general_ci NOT NULL COMMENT '预约类型: grooming/hospital/door_cleaning',
  `appointment_id` bigint NOT NULL COMMENT '预约ID',
  `remind_type` varchar(10) COLLATE utf8mb4_general_ci NOT NULL COMMENT '提醒类型: 24h/2h',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='预约提醒发送记录（防重复发送）';

-- --------------------------------------------------------

--
-- 表的结构 `banner`
--

CREATE TABLE `banner` (
  `id` bigint NOT NULL,
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `description` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `filename` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `original_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `file_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `file_size` bigint DEFAULT NULL,
  `file_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'active',
  `sort_order` int DEFAULT '0',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `link_url` varchar(500) DEFAULT NULL COMMENT '轮播图跳转链接'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `banner`
--

INSERT INTO `banner` (`id`, `title`, `description`, `filename`, `original_name`, `file_url`, `file_size`, `file_type`, `status`, `sort_order`, `create_time`, `update_time`, `link_url`) VALUES
(10, '', '', '生成宠物商城轮播图.png', '生成宠物商城轮播图.png', 'https://situationship.icu/upload/files/files-20260324002252-c0fd857c.jpg', 128353, 'image/png', 'active', 0, '2026-03-23 16:22:53', '2026-03-23 16:22:53', NULL),
(14, '微信图片_20260428164206_47_6.jpg', '', '微信图片_20260428164206_47_6.jpg', '微信图片_20260428164206_47_6.jpg', 'https://situationship.icu/upload/files/files-20260428174448-f130140f.jpg', 180524, 'image/jpeg', 'active', 0, '2026-04-28 09:44:49', '2026-04-28 10:53:42', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `categories`
--

CREATE TABLE `categories` (
  `id` bigint NOT NULL,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `parent_id` bigint DEFAULT '0',
  `level` int DEFAULT '1',
  `sort_order` int DEFAULT '0',
  `icon` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `status` int DEFAULT '1',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `categories`
--

INSERT INTO `categories` (`id`, `name`, `parent_id`, `level`, `sort_order`, `icon`, `status`, `create_time`, `update_time`) VALUES
(2, '猫粮', 0, 1, 0, NULL, 1, '2026-03-23 15:31:27', '2026-03-23 15:31:27'),
(3, '狗粮', 0, 1, 0, NULL, 1, '2026-03-23 15:31:35', '2026-03-23 15:31:35'),
(4, '零食', 0, 1, 0, NULL, 1, '2026-03-23 16:17:02', '2026-03-23 16:17:02');

-- --------------------------------------------------------

--
-- 表的结构 `china_region`
--

CREATE TABLE `china_region` (
  `id` int NOT NULL,
  `code` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '行政区划代码',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '地区名称',
  `level` int NOT NULL COMMENT '行政级别：1-省级，2-地级，3-县级',
  `parent_code` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '父级行政区划代码',
  `sort_order` int DEFAULT '0' COMMENT '排序顺序',
  `status` int DEFAULT '1' COMMENT '状态：1-启用，0-禁用',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='中国行政区划表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `china_region`
--

INSERT INTO `china_region` (`id`, `code`, `name`, `level`, `parent_code`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(1, '11', '北京市', 1, NULL, 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(2, '1101', '市辖区', 2, '11', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(3, '110101', '东城区', 3, '1101', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(4, '110102', '西城区', 3, '1101', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(5, '110105', '朝阳区', 3, '1101', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(6, '110106', '丰台区', 3, '1101', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(7, '110107', '石景山区', 3, '1101', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(8, '110108', '海淀区', 3, '1101', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(9, '110109', '门头沟区', 3, '1101', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(10, '110111', '房山区', 3, '1101', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(11, '110112', '通州区', 3, '1101', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(12, '110113', '顺义区', 3, '1101', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(13, '110114', '昌平区', 3, '1101', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(14, '110115', '大兴区', 3, '1101', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(15, '110116', '怀柔区', 3, '1101', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(16, '110117', '平谷区', 3, '1101', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(17, '110118', '密云区', 3, '1101', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(18, '110119', '延庆区', 3, '1101', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(19, '12', '天津市', 1, NULL, 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(20, '1201', '市辖区', 2, '12', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(21, '120101', '和平区', 3, '1201', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(22, '120102', '河东区', 3, '1201', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(23, '120103', '河西区', 3, '1201', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(24, '120104', '南开区', 3, '1201', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(25, '120105', '河北区', 3, '1201', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(26, '120106', '红桥区', 3, '1201', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(27, '120110', '东丽区', 3, '1201', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(28, '120111', '西青区', 3, '1201', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(29, '120112', '津南区', 3, '1201', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(30, '120113', '北辰区', 3, '1201', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(31, '120114', '武清区', 3, '1201', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(32, '120115', '宝坻区', 3, '1201', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(33, '120116', '滨海新区', 3, '1201', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(34, '120117', '宁河区', 3, '1201', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(35, '120118', '静海区', 3, '1201', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(36, '120119', '蓟州区', 3, '1201', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(37, '13', '河北省', 1, NULL, 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(38, '1301', '石家庄市', 2, '13', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(39, '130102', '长安区', 3, '1301', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(40, '130104', '桥西区', 3, '1301', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(41, '130105', '新华区', 3, '1301', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(42, '130107', '井陉矿区', 3, '1301', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(43, '130108', '裕华区', 3, '1301', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(44, '130109', '藁城区', 3, '1301', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(45, '130110', '鹿泉区', 3, '1301', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(46, '130111', '栾城区', 3, '1301', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(47, '130121', '井陉县', 3, '1301', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(48, '130123', '正定县', 3, '1301', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(49, '130125', '行唐县', 3, '1301', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(50, '130126', '灵寿县', 3, '1301', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(51, '130127', '高邑县', 3, '1301', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(52, '130128', '深泽县', 3, '1301', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(53, '130129', '赞皇县', 3, '1301', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(54, '130130', '无极县', 3, '1301', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(55, '130131', '平山县', 3, '1301', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(56, '130132', '元氏县', 3, '1301', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(57, '130133', '赵县', 3, '1301', 19, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(58, '130171', '石家庄高新技术产业开发区', 3, '1301', 20, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(59, '130172', '石家庄循环化工园区', 3, '1301', 21, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(60, '130181', '辛集市', 3, '1301', 22, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(61, '130183', '晋州市', 3, '1301', 23, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(62, '130184', '新乐市', 3, '1301', 24, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(63, '1302', '唐山市', 2, '13', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(64, '130202', '路南区', 3, '1302', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(65, '130203', '路北区', 3, '1302', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(66, '130204', '古冶区', 3, '1302', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(67, '130205', '开平区', 3, '1302', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(68, '130207', '丰南区', 3, '1302', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(69, '130208', '丰润区', 3, '1302', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(70, '130209', '曹妃甸区', 3, '1302', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(71, '130224', '滦南县', 3, '1302', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(72, '130225', '乐亭县', 3, '1302', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(73, '130227', '迁西县', 3, '1302', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(74, '130229', '玉田县', 3, '1302', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(75, '130271', '河北唐山芦台经济开发区', 3, '1302', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(76, '130272', '唐山市汉沽管理区', 3, '1302', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(77, '130273', '唐山高新技术产业开发区', 3, '1302', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(78, '130274', '河北唐山海港经济开发区', 3, '1302', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(79, '130281', '遵化市', 3, '1302', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(80, '130283', '迁安市', 3, '1302', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(81, '130284', '滦州市', 3, '1302', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(82, '1303', '秦皇岛市', 2, '13', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(83, '130302', '海港区', 3, '1303', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(84, '130303', '山海关区', 3, '1303', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(85, '130304', '北戴河区', 3, '1303', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(86, '130306', '抚宁区', 3, '1303', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(87, '130321', '青龙满族自治县', 3, '1303', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(88, '130322', '昌黎县', 3, '1303', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(89, '130324', '卢龙县', 3, '1303', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(90, '130371', '秦皇岛市经济技术开发区', 3, '1303', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(91, '130372', '北戴河新区', 3, '1303', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(92, '1304', '邯郸市', 2, '13', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(93, '130402', '邯山区', 3, '1304', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(94, '130403', '丛台区', 3, '1304', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(95, '130404', '复兴区', 3, '1304', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(96, '130406', '峰峰矿区', 3, '1304', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(97, '130407', '肥乡区', 3, '1304', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(98, '130408', '永年区', 3, '1304', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(99, '130423', '临漳县', 3, '1304', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(100, '130424', '成安县', 3, '1304', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(101, '130425', '大名县', 3, '1304', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(102, '130426', '涉县', 3, '1304', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(103, '130427', '磁县', 3, '1304', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(104, '130430', '邱县', 3, '1304', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(105, '130431', '鸡泽县', 3, '1304', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(106, '130432', '广平县', 3, '1304', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(107, '130433', '馆陶县', 3, '1304', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(108, '130434', '魏县', 3, '1304', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(109, '130435', '曲周县', 3, '1304', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(110, '130471', '邯郸经济技术开发区', 3, '1304', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(111, '130473', '邯郸冀南新区', 3, '1304', 19, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(112, '130481', '武安市', 3, '1304', 20, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(113, '1305', '邢台市', 2, '13', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(114, '130502', '襄都区', 3, '1305', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(115, '130503', '信都区', 3, '1305', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(116, '130505', '任泽区', 3, '1305', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(117, '130506', '南和区', 3, '1305', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(118, '130522', '临城县', 3, '1305', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(119, '130523', '内丘县', 3, '1305', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(120, '130524', '柏乡县', 3, '1305', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(121, '130525', '隆尧县', 3, '1305', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(122, '130528', '宁晋县', 3, '1305', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(123, '130529', '巨鹿县', 3, '1305', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(124, '130530', '新河县', 3, '1305', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(125, '130531', '广宗县', 3, '1305', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(126, '130532', '平乡县', 3, '1305', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(127, '130533', '威县', 3, '1305', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(128, '130534', '清河县', 3, '1305', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(129, '130535', '临西县', 3, '1305', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(130, '130571', '河北邢台经济开发区', 3, '1305', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(131, '130581', '南宫市', 3, '1305', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(132, '130582', '沙河市', 3, '1305', 19, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(133, '1306', '保定市', 2, '13', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(134, '130602', '竞秀区', 3, '1306', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(135, '130606', '莲池区', 3, '1306', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(136, '130607', '满城区', 3, '1306', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(137, '130608', '清苑区', 3, '1306', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(138, '130609', '徐水区', 3, '1306', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(139, '130623', '涞水县', 3, '1306', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(140, '130624', '阜平县', 3, '1306', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(141, '130626', '定兴县', 3, '1306', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(142, '130627', '唐县', 3, '1306', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(143, '130628', '高阳县', 3, '1306', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(144, '130629', '容城县', 3, '1306', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(145, '130630', '涞源县', 3, '1306', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(146, '130631', '望都县', 3, '1306', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(147, '130632', '安新县', 3, '1306', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(148, '130633', '易县', 3, '1306', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(149, '130634', '曲阳县', 3, '1306', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(150, '130635', '蠡县', 3, '1306', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(151, '130636', '顺平县', 3, '1306', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(152, '130637', '博野县', 3, '1306', 19, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(153, '130638', '雄县', 3, '1306', 20, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(154, '130671', '保定高新技术产业开发区', 3, '1306', 21, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(155, '130672', '保定白沟新城', 3, '1306', 22, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(156, '130681', '涿州市', 3, '1306', 23, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(157, '130682', '定州市', 3, '1306', 24, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(158, '130683', '安国市', 3, '1306', 25, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(159, '130684', '高碑店市', 3, '1306', 26, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(160, '1307', '张家口市', 2, '13', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(161, '130702', '桥东区', 3, '1307', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(162, '130703', '桥西区', 3, '1307', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(163, '130705', '宣化区', 3, '1307', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(164, '130706', '下花园区', 3, '1307', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(165, '130708', '万全区', 3, '1307', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(166, '130709', '崇礼区', 3, '1307', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(167, '130722', '张北县', 3, '1307', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(168, '130723', '康保县', 3, '1307', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(169, '130724', '沽源县', 3, '1307', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(170, '130725', '尚义县', 3, '1307', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(171, '130726', '蔚县', 3, '1307', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(172, '130727', '阳原县', 3, '1307', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(173, '130728', '怀安县', 3, '1307', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(174, '130730', '怀来县', 3, '1307', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(175, '130731', '涿鹿县', 3, '1307', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(176, '130732', '赤城县', 3, '1307', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(177, '130771', '张家口经济开发区', 3, '1307', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(178, '130772', '张家口市察北管理区', 3, '1307', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(179, '130773', '张家口市塞北管理区', 3, '1307', 19, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(180, '1308', '承德市', 2, '13', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(181, '130802', '双桥区', 3, '1308', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(182, '130803', '双滦区', 3, '1308', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(183, '130804', '鹰手营子矿区', 3, '1308', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(184, '130821', '承德县', 3, '1308', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(185, '130822', '兴隆县', 3, '1308', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(186, '130824', '滦平县', 3, '1308', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(187, '130825', '隆化县', 3, '1308', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(188, '130826', '丰宁满族自治县', 3, '1308', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(189, '130827', '宽城满族自治县', 3, '1308', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(190, '130828', '围场满族蒙古族自治县', 3, '1308', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(191, '130871', '承德高新技术产业开发区', 3, '1308', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(192, '130881', '平泉市', 3, '1308', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(193, '1309', '沧州市', 2, '13', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(194, '130902', '新华区', 3, '1309', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(195, '130903', '运河区', 3, '1309', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(196, '130921', '沧县', 3, '1309', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(197, '130922', '青县', 3, '1309', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(198, '130923', '东光县', 3, '1309', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(199, '130924', '海兴县', 3, '1309', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(200, '130925', '盐山县', 3, '1309', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(201, '130926', '肃宁县', 3, '1309', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(202, '130927', '南皮县', 3, '1309', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(203, '130928', '吴桥县', 3, '1309', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(204, '130929', '献县', 3, '1309', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(205, '130930', '孟村回族自治县', 3, '1309', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(206, '130971', '河北沧州经济开发区', 3, '1309', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(207, '130972', '沧州高新技术产业开发区', 3, '1309', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(208, '130973', '沧州渤海新区', 3, '1309', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(209, '130981', '泊头市', 3, '1309', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(210, '130982', '任丘市', 3, '1309', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(211, '130983', '黄骅市', 3, '1309', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(212, '130984', '河间市', 3, '1309', 19, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(213, '1310', '廊坊市', 2, '13', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(214, '131002', '安次区', 3, '1310', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(215, '131003', '广阳区', 3, '1310', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(216, '131022', '固安县', 3, '1310', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(217, '131023', '永清县', 3, '1310', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(218, '131024', '香河县', 3, '1310', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(219, '131025', '大城县', 3, '1310', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(220, '131026', '文安县', 3, '1310', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(221, '131028', '大厂回族自治县', 3, '1310', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(222, '131071', '廊坊经济技术开发区', 3, '1310', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(223, '131081', '霸州市', 3, '1310', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(224, '131082', '三河市', 3, '1310', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(225, '1311', '衡水市', 2, '13', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(226, '131102', '桃城区', 3, '1311', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(227, '131103', '冀州区', 3, '1311', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(228, '131121', '枣强县', 3, '1311', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(229, '131122', '武邑县', 3, '1311', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(230, '131123', '武强县', 3, '1311', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(231, '131124', '饶阳县', 3, '1311', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(232, '131125', '安平县', 3, '1311', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(233, '131126', '故城县', 3, '1311', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(234, '131127', '景县', 3, '1311', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(235, '131128', '阜城县', 3, '1311', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(236, '131171', '河北衡水高新技术产业开发区', 3, '1311', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(237, '131172', '衡水滨湖新区', 3, '1311', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(238, '131182', '深州市', 3, '1311', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(239, '14', '山西省', 1, NULL, 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(240, '1401', '太原市', 2, '14', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(241, '140105', '小店区', 3, '1401', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(242, '140106', '迎泽区', 3, '1401', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(243, '140107', '杏花岭区', 3, '1401', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(244, '140108', '尖草坪区', 3, '1401', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(245, '140109', '万柏林区', 3, '1401', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(246, '140110', '晋源区', 3, '1401', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(247, '140121', '清徐县', 3, '1401', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(248, '140122', '阳曲县', 3, '1401', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(249, '140123', '娄烦县', 3, '1401', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(250, '140171', '山西转型综合改革示范区', 3, '1401', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(251, '140181', '古交市', 3, '1401', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(252, '1402', '大同市', 2, '14', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(253, '140212', '新荣区', 3, '1402', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(254, '140213', '平城区', 3, '1402', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(255, '140214', '云冈区', 3, '1402', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(256, '140215', '云州区', 3, '1402', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(257, '140221', '阳高县', 3, '1402', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(258, '140222', '天镇县', 3, '1402', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(259, '140223', '广灵县', 3, '1402', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(260, '140224', '灵丘县', 3, '1402', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(261, '140225', '浑源县', 3, '1402', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(262, '140226', '左云县', 3, '1402', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(263, '140271', '山西大同经济开发区', 3, '1402', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(264, '1403', '阳泉市', 2, '14', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(265, '140302', '城区', 3, '1403', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(266, '140303', '矿区', 3, '1403', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(267, '140311', '郊区', 3, '1403', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(268, '140321', '平定县', 3, '1403', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(269, '140322', '盂县', 3, '1403', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(270, '1404', '长治市', 2, '14', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(271, '140403', '潞州区', 3, '1404', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(272, '140404', '上党区', 3, '1404', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(273, '140405', '屯留区', 3, '1404', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(274, '140406', '潞城区', 3, '1404', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(275, '140423', '襄垣县', 3, '1404', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(276, '140425', '平顺县', 3, '1404', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(277, '140426', '黎城县', 3, '1404', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(278, '140427', '壶关县', 3, '1404', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(279, '140428', '长子县', 3, '1404', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(280, '140429', '武乡县', 3, '1404', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(281, '140430', '沁县', 3, '1404', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(282, '140431', '沁源县', 3, '1404', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(283, '1405', '晋城市', 2, '14', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(284, '140502', '城区', 3, '1405', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(285, '140521', '沁水县', 3, '1405', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(286, '140522', '阳城县', 3, '1405', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(287, '140524', '陵川县', 3, '1405', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(288, '140525', '泽州县', 3, '1405', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(289, '140581', '高平市', 3, '1405', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(290, '1406', '朔州市', 2, '14', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(291, '140602', '朔城区', 3, '1406', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(292, '140603', '平鲁区', 3, '1406', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(293, '140621', '山阴县', 3, '1406', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(294, '140622', '应县', 3, '1406', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(295, '140623', '右玉县', 3, '1406', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(296, '140671', '山西朔州经济开发区', 3, '1406', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(297, '140681', '怀仁市', 3, '1406', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(298, '1407', '晋中市', 2, '14', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(299, '140702', '榆次区', 3, '1407', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(300, '140703', '太谷区', 3, '1407', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(301, '140721', '榆社县', 3, '1407', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(302, '140722', '左权县', 3, '1407', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(303, '140723', '和顺县', 3, '1407', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(304, '140724', '昔阳县', 3, '1407', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(305, '140725', '寿阳县', 3, '1407', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(306, '140727', '祁县', 3, '1407', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(307, '140728', '平遥县', 3, '1407', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(308, '140729', '灵石县', 3, '1407', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(309, '140781', '介休市', 3, '1407', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(310, '1408', '运城市', 2, '14', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(311, '140802', '盐湖区', 3, '1408', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(312, '140821', '临猗县', 3, '1408', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(313, '140822', '万荣县', 3, '1408', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(314, '140823', '闻喜县', 3, '1408', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(315, '140824', '稷山县', 3, '1408', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(316, '140825', '新绛县', 3, '1408', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(317, '140826', '绛县', 3, '1408', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(318, '140827', '垣曲县', 3, '1408', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(319, '140828', '夏县', 3, '1408', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(320, '140829', '平陆县', 3, '1408', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(321, '140830', '芮城县', 3, '1408', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(322, '140881', '永济市', 3, '1408', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(323, '140882', '河津市', 3, '1408', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(324, '1409', '忻州市', 2, '14', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(325, '140902', '忻府区', 3, '1409', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(326, '140921', '定襄县', 3, '1409', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(327, '140922', '五台县', 3, '1409', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(328, '140923', '代县', 3, '1409', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(329, '140924', '繁峙县', 3, '1409', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(330, '140925', '宁武县', 3, '1409', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(331, '140926', '静乐县', 3, '1409', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(332, '140927', '神池县', 3, '1409', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(333, '140928', '五寨县', 3, '1409', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(334, '140929', '岢岚县', 3, '1409', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(335, '140930', '河曲县', 3, '1409', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(336, '140931', '保德县', 3, '1409', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(337, '140932', '偏关县', 3, '1409', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(338, '140971', '五台山风景名胜区', 3, '1409', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(339, '140981', '原平市', 3, '1409', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(340, '1410', '临汾市', 2, '14', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(341, '141002', '尧都区', 3, '1410', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(342, '141021', '曲沃县', 3, '1410', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(343, '141022', '翼城县', 3, '1410', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(344, '141023', '襄汾县', 3, '1410', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(345, '141024', '洪洞县', 3, '1410', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(346, '141025', '古县', 3, '1410', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(347, '141026', '安泽县', 3, '1410', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(348, '141027', '浮山县', 3, '1410', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(349, '141028', '吉县', 3, '1410', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(350, '141029', '乡宁县', 3, '1410', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(351, '141030', '大宁县', 3, '1410', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(352, '141031', '隰县', 3, '1410', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(353, '141032', '永和县', 3, '1410', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(354, '141033', '蒲县', 3, '1410', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(355, '141034', '汾西县', 3, '1410', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(356, '141081', '侯马市', 3, '1410', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(357, '141082', '霍州市', 3, '1410', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(358, '1411', '吕梁市', 2, '14', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(359, '141102', '离石区', 3, '1411', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(360, '141121', '文水县', 3, '1411', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(361, '141122', '交城县', 3, '1411', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(362, '141123', '兴县', 3, '1411', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(363, '141124', '临县', 3, '1411', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(364, '141125', '柳林县', 3, '1411', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(365, '141126', '石楼县', 3, '1411', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(366, '141127', '岚县', 3, '1411', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(367, '141128', '方山县', 3, '1411', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(368, '141129', '中阳县', 3, '1411', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(369, '141130', '交口县', 3, '1411', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(370, '141181', '孝义市', 3, '1411', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(371, '141182', '汾阳市', 3, '1411', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(372, '15', '内蒙古自治区', 1, NULL, 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(373, '1501', '呼和浩特市', 2, '15', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(374, '150102', '新城区', 3, '1501', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(375, '150103', '回民区', 3, '1501', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(376, '150104', '玉泉区', 3, '1501', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(377, '150105', '赛罕区', 3, '1501', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(378, '150121', '土默特左旗', 3, '1501', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(379, '150122', '托克托县', 3, '1501', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(380, '150123', '和林格尔县', 3, '1501', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(381, '150124', '清水河县', 3, '1501', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(382, '150125', '武川县', 3, '1501', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(383, '150172', '呼和浩特经济技术开发区', 3, '1501', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(384, '1502', '包头市', 2, '15', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(385, '150202', '东河区', 3, '1502', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(386, '150203', '昆都仑区', 3, '1502', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(387, '150204', '青山区', 3, '1502', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(388, '150205', '石拐区', 3, '1502', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(389, '150206', '白云鄂博矿区', 3, '1502', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(390, '150207', '九原区', 3, '1502', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(391, '150221', '土默特右旗', 3, '1502', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(392, '150222', '固阳县', 3, '1502', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(393, '150223', '达尔罕茂明安联合旗', 3, '1502', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(394, '150271', '包头稀土高新技术产业开发区', 3, '1502', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(395, '1503', '乌海市', 2, '15', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(396, '150302', '海勃湾区', 3, '1503', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(397, '150303', '海南区', 3, '1503', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(398, '150304', '乌达区', 3, '1503', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(399, '1504', '赤峰市', 2, '15', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(400, '150402', '红山区', 3, '1504', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(401, '150403', '元宝山区', 3, '1504', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(402, '150404', '松山区', 3, '1504', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(403, '150421', '阿鲁科尔沁旗', 3, '1504', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(404, '150422', '巴林左旗', 3, '1504', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(405, '150423', '巴林右旗', 3, '1504', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(406, '150424', '林西县', 3, '1504', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(407, '150425', '克什克腾旗', 3, '1504', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(408, '150426', '翁牛特旗', 3, '1504', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(409, '150428', '喀喇沁旗', 3, '1504', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(410, '150429', '宁城县', 3, '1504', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(411, '150430', '敖汉旗', 3, '1504', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(412, '1505', '通辽市', 2, '15', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(413, '150502', '科尔沁区', 3, '1505', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(414, '150521', '科尔沁左翼中旗', 3, '1505', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(415, '150522', '科尔沁左翼后旗', 3, '1505', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(416, '150523', '开鲁县', 3, '1505', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(417, '150524', '库伦旗', 3, '1505', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(418, '150525', '奈曼旗', 3, '1505', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(419, '150526', '扎鲁特旗', 3, '1505', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(420, '150571', '通辽经济技术开发区', 3, '1505', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(421, '150581', '霍林郭勒市', 3, '1505', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(422, '1506', '鄂尔多斯市', 2, '15', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(423, '150602', '东胜区', 3, '1506', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(424, '150603', '康巴什区', 3, '1506', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(425, '150621', '达拉特旗', 3, '1506', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(426, '150622', '准格尔旗', 3, '1506', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(427, '150623', '鄂托克前旗', 3, '1506', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(428, '150624', '鄂托克旗', 3, '1506', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(429, '150625', '杭锦旗', 3, '1506', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(430, '150626', '乌审旗', 3, '1506', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(431, '150627', '伊金霍洛旗', 3, '1506', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(432, '1507', '呼伦贝尔市', 2, '15', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(433, '150702', '海拉尔区', 3, '1507', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(434, '150703', '扎赉诺尔区', 3, '1507', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(435, '150721', '阿荣旗', 3, '1507', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(436, '150722', '莫力达瓦达斡尔族自治旗', 3, '1507', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(437, '150723', '鄂伦春自治旗', 3, '1507', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(438, '150724', '鄂温克族自治旗', 3, '1507', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(439, '150725', '陈巴尔虎旗', 3, '1507', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(440, '150726', '新巴尔虎左旗', 3, '1507', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(441, '150727', '新巴尔虎右旗', 3, '1507', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(442, '150781', '满洲里市', 3, '1507', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(443, '150782', '牙克石市', 3, '1507', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(444, '150783', '扎兰屯市', 3, '1507', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(445, '150784', '额尔古纳市', 3, '1507', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(446, '150785', '根河市', 3, '1507', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(447, '1508', '巴彦淖尔市', 2, '15', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(448, '150802', '临河区', 3, '1508', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(449, '150821', '五原县', 3, '1508', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(450, '150822', '磴口县', 3, '1508', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(451, '150823', '乌拉特前旗', 3, '1508', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(452, '150824', '乌拉特中旗', 3, '1508', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(453, '150825', '乌拉特后旗', 3, '1508', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(454, '150826', '杭锦后旗', 3, '1508', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(455, '1509', '乌兰察布市', 2, '15', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(456, '150902', '集宁区', 3, '1509', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(457, '150921', '卓资县', 3, '1509', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(458, '150922', '化德县', 3, '1509', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(459, '150923', '商都县', 3, '1509', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(460, '150924', '兴和县', 3, '1509', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(461, '150925', '凉城县', 3, '1509', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(462, '150926', '察哈尔右翼前旗', 3, '1509', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(463, '150927', '察哈尔右翼中旗', 3, '1509', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(464, '150928', '察哈尔右翼后旗', 3, '1509', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(465, '150929', '四子王旗', 3, '1509', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(466, '150981', '丰镇市', 3, '1509', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(467, '1522', '兴安盟', 2, '15', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(468, '152201', '乌兰浩特市', 3, '1522', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(469, '152202', '阿尔山市', 3, '1522', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(470, '152221', '科尔沁右翼前旗', 3, '1522', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(471, '152222', '科尔沁右翼中旗', 3, '1522', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(472, '152223', '扎赉特旗', 3, '1522', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(473, '152224', '突泉县', 3, '1522', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(474, '1525', '锡林郭勒盟', 2, '15', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(475, '152501', '二连浩特市', 3, '1525', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(476, '152502', '锡林浩特市', 3, '1525', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(477, '152522', '阿巴嘎旗', 3, '1525', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(478, '152523', '苏尼特左旗', 3, '1525', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(479, '152524', '苏尼特右旗', 3, '1525', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(480, '152525', '东乌珠穆沁旗', 3, '1525', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(481, '152526', '西乌珠穆沁旗', 3, '1525', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(482, '152527', '太仆寺旗', 3, '1525', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(483, '152528', '镶黄旗', 3, '1525', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(484, '152529', '正镶白旗', 3, '1525', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(485, '152530', '正蓝旗', 3, '1525', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(486, '152531', '多伦县', 3, '1525', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(487, '152571', '乌拉盖管理区管委会', 3, '1525', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(488, '1529', '阿拉善盟', 2, '15', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(489, '152921', '阿拉善左旗', 3, '1529', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(490, '152922', '阿拉善右旗', 3, '1529', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(491, '152923', '额济纳旗', 3, '1529', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(492, '152971', '内蒙古阿拉善高新技术产业开发区', 3, '1529', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(493, '21', '辽宁省', 1, NULL, 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(494, '2101', '沈阳市', 2, '21', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(495, '210102', '和平区', 3, '2101', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(496, '210103', '沈河区', 3, '2101', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(497, '210104', '大东区', 3, '2101', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(498, '210105', '皇姑区', 3, '2101', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(499, '210106', '铁西区', 3, '2101', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(500, '210111', '苏家屯区', 3, '2101', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(501, '210112', '浑南区', 3, '2101', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(502, '210113', '沈北新区', 3, '2101', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(503, '210114', '于洪区', 3, '2101', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(504, '210115', '辽中区', 3, '2101', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(505, '210123', '康平县', 3, '2101', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(506, '210124', '法库县', 3, '2101', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(507, '210181', '新民市', 3, '2101', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(508, '2102', '大连市', 2, '21', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(509, '210202', '中山区', 3, '2102', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(510, '210203', '西岗区', 3, '2102', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(511, '210204', '沙河口区', 3, '2102', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(512, '210211', '甘井子区', 3, '2102', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(513, '210212', '旅顺口区', 3, '2102', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(514, '210213', '金州区', 3, '2102', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(515, '210214', '普兰店区', 3, '2102', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(516, '210224', '长海县', 3, '2102', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(517, '210281', '瓦房店市', 3, '2102', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(518, '210283', '庄河市', 3, '2102', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(519, '2103', '鞍山市', 2, '21', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(520, '210302', '铁东区', 3, '2103', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(521, '210303', '铁西区', 3, '2103', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(522, '210304', '立山区', 3, '2103', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(523, '210311', '千山区', 3, '2103', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(524, '210321', '台安县', 3, '2103', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(525, '210323', '岫岩满族自治县', 3, '2103', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(526, '210381', '海城市', 3, '2103', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(527, '2104', '抚顺市', 2, '21', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(528, '210402', '新抚区', 3, '2104', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(529, '210403', '东洲区', 3, '2104', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(530, '210404', '望花区', 3, '2104', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(531, '210411', '顺城区', 3, '2104', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(532, '210421', '抚顺县', 3, '2104', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(533, '210422', '新宾满族自治县', 3, '2104', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(534, '210423', '清原满族自治县', 3, '2104', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(535, '2105', '本溪市', 2, '21', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(536, '210502', '平山区', 3, '2105', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(537, '210503', '溪湖区', 3, '2105', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(538, '210504', '明山区', 3, '2105', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(539, '210505', '南芬区', 3, '2105', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(540, '210521', '本溪满族自治县', 3, '2105', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(541, '210522', '桓仁满族自治县', 3, '2105', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(542, '2106', '丹东市', 2, '21', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(543, '210602', '元宝区', 3, '2106', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(544, '210603', '振兴区', 3, '2106', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(545, '210604', '振安区', 3, '2106', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(546, '210624', '宽甸满族自治县', 3, '2106', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(547, '210681', '东港市', 3, '2106', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(548, '210682', '凤城市', 3, '2106', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(549, '2107', '锦州市', 2, '21', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(550, '210702', '古塔区', 3, '2107', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(551, '210703', '凌河区', 3, '2107', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(552, '210711', '太和区', 3, '2107', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(553, '210726', '黑山县', 3, '2107', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(554, '210727', '义县', 3, '2107', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(555, '210781', '凌海市', 3, '2107', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(556, '210782', '北镇市', 3, '2107', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(557, '2108', '营口市', 2, '21', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(558, '210802', '站前区', 3, '2108', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(559, '210803', '西市区', 3, '2108', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(560, '210804', '鲅鱼圈区', 3, '2108', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(561, '210811', '老边区', 3, '2108', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(562, '210881', '盖州市', 3, '2108', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(563, '210882', '大石桥市', 3, '2108', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(564, '2109', '阜新市', 2, '21', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(565, '210902', '海州区', 3, '2109', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(566, '210903', '新邱区', 3, '2109', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(567, '210904', '太平区', 3, '2109', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(568, '210905', '清河门区', 3, '2109', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(569, '210911', '细河区', 3, '2109', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(570, '210921', '阜新蒙古族自治县', 3, '2109', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(571, '210922', '彰武县', 3, '2109', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(572, '2110', '辽阳市', 2, '21', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(573, '211002', '白塔区', 3, '2110', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(574, '211003', '文圣区', 3, '2110', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(575, '211004', '宏伟区', 3, '2110', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(576, '211005', '弓长岭区', 3, '2110', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(577, '211011', '太子河区', 3, '2110', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(578, '211021', '辽阳县', 3, '2110', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(579, '211081', '灯塔市', 3, '2110', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(580, '2111', '盘锦市', 2, '21', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(581, '211102', '双台子区', 3, '2111', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(582, '211103', '兴隆台区', 3, '2111', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(583, '211104', '大洼区', 3, '2111', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56');
INSERT INTO `china_region` (`id`, `code`, `name`, `level`, `parent_code`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(584, '211122', '盘山县', 3, '2111', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(585, '2112', '铁岭市', 2, '21', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(586, '211202', '银州区', 3, '2112', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(587, '211204', '清河区', 3, '2112', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(588, '211221', '铁岭县', 3, '2112', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(589, '211223', '西丰县', 3, '2112', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(590, '211224', '昌图县', 3, '2112', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(591, '211281', '调兵山市', 3, '2112', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(592, '211282', '开原市', 3, '2112', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(593, '2113', '朝阳市', 2, '21', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(594, '211302', '双塔区', 3, '2113', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(595, '211303', '龙城区', 3, '2113', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(596, '211321', '朝阳县', 3, '2113', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(597, '211322', '建平县', 3, '2113', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(598, '211324', '喀喇沁左翼蒙古族自治县', 3, '2113', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(599, '211381', '北票市', 3, '2113', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(600, '211382', '凌源市', 3, '2113', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(601, '2114', '葫芦岛市', 2, '21', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(602, '211402', '连山区', 3, '2114', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(603, '211403', '龙港区', 3, '2114', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(604, '211404', '南票区', 3, '2114', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(605, '211421', '绥中县', 3, '2114', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(606, '211422', '建昌县', 3, '2114', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(607, '211481', '兴城市', 3, '2114', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(608, '22', '吉林省', 1, NULL, 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(609, '2201', '长春市', 2, '22', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(610, '220102', '南关区', 3, '2201', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(611, '220103', '宽城区', 3, '2201', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(612, '220104', '朝阳区', 3, '2201', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(613, '220105', '二道区', 3, '2201', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(614, '220106', '绿园区', 3, '2201', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(615, '220112', '双阳区', 3, '2201', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(616, '220113', '九台区', 3, '2201', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(617, '220122', '农安县', 3, '2201', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(618, '220171', '长春经济技术开发区', 3, '2201', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(619, '220172', '长春净月高新技术产业开发区', 3, '2201', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(620, '220173', '长春高新技术产业开发区', 3, '2201', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(621, '220174', '长春汽车经济技术开发区', 3, '2201', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(622, '220182', '榆树市', 3, '2201', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(623, '220183', '德惠市', 3, '2201', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(624, '220184', '公主岭市', 3, '2201', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(625, '2202', '吉林市', 2, '22', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(626, '220202', '昌邑区', 3, '2202', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(627, '220203', '龙潭区', 3, '2202', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(628, '220204', '船营区', 3, '2202', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(629, '220211', '丰满区', 3, '2202', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(630, '220221', '永吉县', 3, '2202', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(631, '220271', '吉林经济开发区', 3, '2202', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(632, '220272', '吉林高新技术产业开发区', 3, '2202', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(633, '220273', '吉林中国新加坡食品区', 3, '2202', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(634, '220281', '蛟河市', 3, '2202', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(635, '220282', '桦甸市', 3, '2202', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(636, '220283', '舒兰市', 3, '2202', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(637, '220284', '磐石市', 3, '2202', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(638, '2203', '四平市', 2, '22', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(639, '220302', '铁西区', 3, '2203', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(640, '220303', '铁东区', 3, '2203', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(641, '220322', '梨树县', 3, '2203', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(642, '220323', '伊通满族自治县', 3, '2203', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(643, '220382', '双辽市', 3, '2203', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(644, '2204', '辽源市', 2, '22', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(645, '220402', '龙山区', 3, '2204', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(646, '220403', '西安区', 3, '2204', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(647, '220421', '东丰县', 3, '2204', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(648, '220422', '东辽县', 3, '2204', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(649, '2205', '通化市', 2, '22', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(650, '220502', '东昌区', 3, '2205', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(651, '220503', '二道江区', 3, '2205', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(652, '220521', '通化县', 3, '2205', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(653, '220523', '辉南县', 3, '2205', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(654, '220524', '柳河县', 3, '2205', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(655, '220581', '梅河口市', 3, '2205', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(656, '220582', '集安市', 3, '2205', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(657, '2206', '白山市', 2, '22', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(658, '220602', '浑江区', 3, '2206', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(659, '220605', '江源区', 3, '2206', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(660, '220621', '抚松县', 3, '2206', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(661, '220622', '靖宇县', 3, '2206', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(662, '220623', '长白朝鲜族自治县', 3, '2206', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(663, '220681', '临江市', 3, '2206', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(664, '2207', '松原市', 2, '22', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(665, '220702', '宁江区', 3, '2207', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(666, '220721', '前郭尔罗斯蒙古族自治县', 3, '2207', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(667, '220722', '长岭县', 3, '2207', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(668, '220723', '乾安县', 3, '2207', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(669, '220771', '吉林松原经济开发区', 3, '2207', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(670, '220781', '扶余市', 3, '2207', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(671, '2208', '白城市', 2, '22', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(672, '220802', '洮北区', 3, '2208', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(673, '220821', '镇赉县', 3, '2208', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(674, '220822', '通榆县', 3, '2208', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(675, '220871', '吉林白城经济开发区', 3, '2208', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(676, '220881', '洮南市', 3, '2208', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(677, '220882', '大安市', 3, '2208', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(678, '2224', '延边朝鲜族自治州', 2, '22', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(679, '222401', '延吉市', 3, '2224', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(680, '222402', '图们市', 3, '2224', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(681, '222403', '敦化市', 3, '2224', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(682, '222404', '珲春市', 3, '2224', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(683, '222405', '龙井市', 3, '2224', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(684, '222406', '和龙市', 3, '2224', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(685, '222424', '汪清县', 3, '2224', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(686, '222426', '安图县', 3, '2224', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(687, '23', '黑龙江省', 1, NULL, 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(688, '2301', '哈尔滨市', 2, '23', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(689, '230102', '道里区', 3, '2301', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(690, '230103', '南岗区', 3, '2301', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(691, '230104', '道外区', 3, '2301', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(692, '230108', '平房区', 3, '2301', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(693, '230109', '松北区', 3, '2301', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(694, '230110', '香坊区', 3, '2301', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(695, '230111', '呼兰区', 3, '2301', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(696, '230112', '阿城区', 3, '2301', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(697, '230113', '双城区', 3, '2301', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(698, '230123', '依兰县', 3, '2301', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(699, '230124', '方正县', 3, '2301', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(700, '230125', '宾县', 3, '2301', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(701, '230126', '巴彦县', 3, '2301', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(702, '230127', '木兰县', 3, '2301', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(703, '230128', '通河县', 3, '2301', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(704, '230129', '延寿县', 3, '2301', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(705, '230183', '尚志市', 3, '2301', 17, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(706, '230184', '五常市', 3, '2301', 18, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(707, '2302', '齐齐哈尔市', 2, '23', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(708, '230202', '龙沙区', 3, '2302', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(709, '230203', '建华区', 3, '2302', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(710, '230204', '铁锋区', 3, '2302', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(711, '230205', '昂昂溪区', 3, '2302', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(712, '230206', '富拉尔基区', 3, '2302', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(713, '230207', '碾子山区', 3, '2302', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(714, '230208', '梅里斯达斡尔族区', 3, '2302', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(715, '230221', '龙江县', 3, '2302', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(716, '230223', '依安县', 3, '2302', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(717, '230224', '泰来县', 3, '2302', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(718, '230225', '甘南县', 3, '2302', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(719, '230227', '富裕县', 3, '2302', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(720, '230229', '克山县', 3, '2302', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(721, '230230', '克东县', 3, '2302', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(722, '230231', '拜泉县', 3, '2302', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(723, '230281', '讷河市', 3, '2302', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(724, '2303', '鸡西市', 2, '23', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(725, '230302', '鸡冠区', 3, '2303', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(726, '230303', '恒山区', 3, '2303', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(727, '230304', '滴道区', 3, '2303', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(728, '230305', '梨树区', 3, '2303', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(729, '230306', '城子河区', 3, '2303', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(730, '230307', '麻山区', 3, '2303', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(731, '230321', '鸡东县', 3, '2303', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(732, '230381', '虎林市', 3, '2303', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(733, '230382', '密山市', 3, '2303', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(734, '2304', '鹤岗市', 2, '23', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(735, '230402', '向阳区', 3, '2304', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(736, '230403', '工农区', 3, '2304', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(737, '230404', '南山区', 3, '2304', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(738, '230405', '兴安区', 3, '2304', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(739, '230406', '东山区', 3, '2304', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(740, '230407', '兴山区', 3, '2304', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(741, '230421', '萝北县', 3, '2304', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(742, '230422', '绥滨县', 3, '2304', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(743, '2305', '双鸭山市', 2, '23', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(744, '230502', '尖山区', 3, '2305', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(745, '230503', '岭东区', 3, '2305', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(746, '230505', '四方台区', 3, '2305', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(747, '230506', '宝山区', 3, '2305', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(748, '230521', '集贤县', 3, '2305', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(749, '230522', '友谊县', 3, '2305', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(750, '230523', '宝清县', 3, '2305', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(751, '230524', '饶河县', 3, '2305', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(752, '2306', '大庆市', 2, '23', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(753, '230602', '萨尔图区', 3, '2306', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(754, '230603', '龙凤区', 3, '2306', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(755, '230604', '让胡路区', 3, '2306', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(756, '230605', '红岗区', 3, '2306', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(757, '230606', '大同区', 3, '2306', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(758, '230621', '肇州县', 3, '2306', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(759, '230622', '肇源县', 3, '2306', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(760, '230623', '林甸县', 3, '2306', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(761, '230624', '杜尔伯特蒙古族自治县', 3, '2306', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(762, '230671', '大庆高新技术产业开发区', 3, '2306', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(763, '2307', '伊春市', 2, '23', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(764, '230717', '伊美区', 3, '2307', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(765, '230718', '乌翠区', 3, '2307', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(766, '230719', '友好区', 3, '2307', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(767, '230722', '嘉荫县', 3, '2307', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(768, '230723', '汤旺县', 3, '2307', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(769, '230724', '丰林县', 3, '2307', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(770, '230725', '大箐山县', 3, '2307', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(771, '230726', '南岔县', 3, '2307', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(772, '230751', '金林区', 3, '2307', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(773, '230781', '铁力市', 3, '2307', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(774, '2308', '佳木斯市', 2, '23', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(775, '230803', '向阳区', 3, '2308', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(776, '230804', '前进区', 3, '2308', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(777, '230805', '东风区', 3, '2308', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(778, '230811', '郊区', 3, '2308', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(779, '230822', '桦南县', 3, '2308', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(780, '230826', '桦川县', 3, '2308', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(781, '230828', '汤原县', 3, '2308', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(782, '230881', '同江市', 3, '2308', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(783, '230882', '富锦市', 3, '2308', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(784, '230883', '抚远市', 3, '2308', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(785, '2309', '七台河市', 2, '23', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(786, '230902', '新兴区', 3, '2309', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(787, '230903', '桃山区', 3, '2309', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(788, '230904', '茄子河区', 3, '2309', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(789, '230921', '勃利县', 3, '2309', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(790, '2310', '牡丹江市', 2, '23', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(791, '231002', '东安区', 3, '2310', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(792, '231003', '阳明区', 3, '2310', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(793, '231004', '爱民区', 3, '2310', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(794, '231005', '西安区', 3, '2310', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(795, '231025', '林口县', 3, '2310', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(796, '231081', '绥芬河市', 3, '2310', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(797, '231083', '海林市', 3, '2310', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(798, '231084', '宁安市', 3, '2310', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(799, '231085', '穆棱市', 3, '2310', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(800, '231086', '东宁市', 3, '2310', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(801, '2311', '黑河市', 2, '23', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(802, '231102', '爱辉区', 3, '2311', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(803, '231123', '逊克县', 3, '2311', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(804, '231124', '孙吴县', 3, '2311', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(805, '231181', '北安市', 3, '2311', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(806, '231182', '五大连池市', 3, '2311', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(807, '231183', '嫩江市', 3, '2311', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(808, '2312', '绥化市', 2, '23', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(809, '231202', '北林区', 3, '2312', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(810, '231221', '望奎县', 3, '2312', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(811, '231222', '兰西县', 3, '2312', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(812, '231223', '青冈县', 3, '2312', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(813, '231224', '庆安县', 3, '2312', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(814, '231225', '明水县', 3, '2312', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(815, '231226', '绥棱县', 3, '2312', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(816, '231281', '安达市', 3, '2312', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(817, '231282', '肇东市', 3, '2312', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(818, '231283', '海伦市', 3, '2312', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(819, '2327', '大兴安岭地区', 2, '23', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(820, '232701', '漠河市', 3, '2327', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(821, '232721', '呼玛县', 3, '2327', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(822, '232722', '塔河县', 3, '2327', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(823, '232761', '加格达奇区', 3, '2327', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(824, '232762', '松岭区', 3, '2327', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(825, '232763', '新林区', 3, '2327', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(826, '232764', '呼中区', 3, '2327', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(827, '31', '上海市', 1, NULL, 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(828, '3101', '市辖区', 2, '31', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(829, '310101', '黄浦区', 3, '3101', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(830, '310104', '徐汇区', 3, '3101', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(831, '310105', '长宁区', 3, '3101', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(832, '310106', '静安区', 3, '3101', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(833, '310107', '普陀区', 3, '3101', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(834, '310109', '虹口区', 3, '3101', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(835, '310110', '杨浦区', 3, '3101', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(836, '310112', '闵行区', 3, '3101', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(837, '310113', '宝山区', 3, '3101', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(838, '310114', '嘉定区', 3, '3101', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(839, '310115', '浦东新区', 3, '3101', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(840, '310116', '金山区', 3, '3101', 12, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(841, '310117', '松江区', 3, '3101', 13, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(842, '310118', '青浦区', 3, '3101', 14, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(843, '310120', '奉贤区', 3, '3101', 15, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(844, '310151', '崇明区', 3, '3101', 16, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(845, '32', '江苏省', 1, NULL, 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(846, '3201', '南京市', 2, '32', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(847, '320102', '玄武区', 3, '3201', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(848, '320104', '秦淮区', 3, '3201', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(849, '320105', '建邺区', 3, '3201', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(850, '320106', '鼓楼区', 3, '3201', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(851, '320111', '浦口区', 3, '3201', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(852, '320113', '栖霞区', 3, '3201', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(853, '320114', '雨花台区', 3, '3201', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(854, '320115', '江宁区', 3, '3201', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(855, '320116', '六合区', 3, '3201', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(856, '320117', '溧水区', 3, '3201', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(857, '320118', '高淳区', 3, '3201', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(858, '3202', '无锡市', 2, '32', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(859, '320205', '锡山区', 3, '3202', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(860, '320206', '惠山区', 3, '3202', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(861, '320211', '滨湖区', 3, '3202', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(862, '320213', '梁溪区', 3, '3202', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(863, '320214', '新吴区', 3, '3202', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(864, '320281', '江阴市', 3, '3202', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(865, '320282', '宜兴市', 3, '3202', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(866, '3203', '徐州市', 2, '32', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(867, '320302', '鼓楼区', 3, '3203', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(868, '320303', '云龙区', 3, '3203', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(869, '320305', '贾汪区', 3, '3203', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(870, '320311', '泉山区', 3, '3203', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(871, '320312', '铜山区', 3, '3203', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(872, '320321', '丰县', 3, '3203', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(873, '320322', '沛县', 3, '3203', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(874, '320324', '睢宁县', 3, '3203', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(875, '320371', '徐州经济技术开发区', 3, '3203', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(876, '320381', '新沂市', 3, '3203', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(877, '320382', '邳州市', 3, '3203', 11, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(878, '3204', '常州市', 2, '32', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(879, '320402', '天宁区', 3, '3204', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(880, '320404', '钟楼区', 3, '3204', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(881, '320411', '新北区', 3, '3204', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(882, '320412', '武进区', 3, '3204', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(883, '320413', '金坛区', 3, '3204', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(884, '320481', '溧阳市', 3, '3204', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(885, '3205', '苏州市', 2, '32', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(886, '320505', '虎丘区', 3, '3205', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(887, '320506', '吴中区', 3, '3205', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(888, '320507', '相城区', 3, '3205', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(889, '320508', '姑苏区', 3, '3205', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(890, '320509', '吴江区', 3, '3205', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(891, '320576', '苏州工业园区', 3, '3205', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(892, '320581', '常熟市', 3, '3205', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(893, '320582', '张家港市', 3, '3205', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(894, '320583', '昆山市', 3, '3205', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(895, '320585', '太仓市', 3, '3205', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(896, '3206', '南通市', 2, '32', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(897, '320612', '通州区', 3, '3206', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(898, '320613', '崇川区', 3, '3206', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(899, '320614', '海门区', 3, '3206', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(900, '320623', '如东县', 3, '3206', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(901, '320671', '南通经济技术开发区', 3, '3206', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(902, '320681', '启东市', 3, '3206', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(903, '320682', '如皋市', 3, '3206', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(904, '320685', '海安市', 3, '3206', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(905, '3207', '连云港市', 2, '32', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(906, '320703', '连云区', 3, '3207', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(907, '320706', '海州区', 3, '3207', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(908, '320707', '赣榆区', 3, '3207', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(909, '320722', '东海县', 3, '3207', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(910, '320723', '灌云县', 3, '3207', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(911, '320724', '灌南县', 3, '3207', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(912, '320771', '连云港经济技术开发区', 3, '3207', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(913, '3208', '淮安市', 2, '32', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(914, '320803', '淮安区', 3, '3208', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(915, '320804', '淮阴区', 3, '3208', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(916, '320812', '清江浦区', 3, '3208', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(917, '320813', '洪泽区', 3, '3208', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(918, '320826', '涟水县', 3, '3208', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(919, '320830', '盱眙县', 3, '3208', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(920, '320831', '金湖县', 3, '3208', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(921, '320871', '淮安经济技术开发区', 3, '3208', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(922, '3209', '盐城市', 2, '32', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(923, '320902', '亭湖区', 3, '3209', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(924, '320903', '盐都区', 3, '3209', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(925, '320904', '大丰区', 3, '3209', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(926, '320921', '响水县', 3, '3209', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(927, '320922', '滨海县', 3, '3209', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(928, '320923', '阜宁县', 3, '3209', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(929, '320924', '射阳县', 3, '3209', 7, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(930, '320925', '建湖县', 3, '3209', 8, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(931, '320971', '盐城经济技术开发区', 3, '3209', 9, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(932, '320981', '东台市', 3, '3209', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(933, '3210', '扬州市', 2, '32', 10, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(934, '321002', '广陵区', 3, '3210', 1, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(935, '321003', '邗江区', 3, '3210', 2, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(936, '321012', '江都区', 3, '3210', 3, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(937, '321023', '宝应县', 3, '3210', 4, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(938, '321071', '扬州经济技术开发区', 3, '3210', 5, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(939, '321081', '仪征市', 3, '3210', 6, 1, '2025-10-02 02:34:56', '2025-10-02 02:34:56'),
(940, '321084', '高邮市', 3, '3210', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(941, '3211', '镇江市', 2, '32', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(942, '321102', '京口区', 3, '3211', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(943, '321111', '润州区', 3, '3211', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(944, '321112', '丹徒区', 3, '3211', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(945, '321171', '镇江新区', 3, '3211', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(946, '321181', '丹阳市', 3, '3211', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(947, '321182', '扬中市', 3, '3211', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(948, '321183', '句容市', 3, '3211', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(949, '3212', '泰州市', 2, '32', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(950, '321202', '海陵区', 3, '3212', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(951, '321203', '高港区', 3, '3212', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(952, '321204', '姜堰区', 3, '3212', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(953, '321281', '兴化市', 3, '3212', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(954, '321282', '靖江市', 3, '3212', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(955, '321283', '泰兴市', 3, '3212', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(956, '3213', '宿迁市', 2, '32', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(957, '321302', '宿城区', 3, '3213', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(958, '321311', '宿豫区', 3, '3213', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(959, '321322', '沭阳县', 3, '3213', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(960, '321323', '泗阳县', 3, '3213', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(961, '321324', '泗洪县', 3, '3213', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(962, '321371', '宿迁经济技术开发区', 3, '3213', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(963, '33', '浙江省', 1, NULL, 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(964, '3301', '杭州市', 2, '33', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(965, '330102', '上城区', 3, '3301', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(966, '330105', '拱墅区', 3, '3301', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(967, '330106', '西湖区', 3, '3301', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(968, '330108', '滨江区', 3, '3301', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(969, '330109', '萧山区', 3, '3301', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(970, '330110', '余杭区', 3, '3301', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(971, '330111', '富阳区', 3, '3301', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(972, '330112', '临安区', 3, '3301', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(973, '330113', '临平区', 3, '3301', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(974, '330114', '钱塘区', 3, '3301', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(975, '330122', '桐庐县', 3, '3301', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(976, '330127', '淳安县', 3, '3301', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(977, '330182', '建德市', 3, '3301', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(978, '3302', '宁波市', 2, '33', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(979, '330203', '海曙区', 3, '3302', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(980, '330205', '江北区', 3, '3302', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(981, '330206', '北仑区', 3, '3302', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(982, '330211', '镇海区', 3, '3302', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(983, '330212', '鄞州区', 3, '3302', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(984, '330213', '奉化区', 3, '3302', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(985, '330225', '象山县', 3, '3302', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(986, '330226', '宁海县', 3, '3302', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(987, '330281', '余姚市', 3, '3302', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(988, '330282', '慈溪市', 3, '3302', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(989, '3303', '温州市', 2, '33', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(990, '330302', '鹿城区', 3, '3303', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(991, '330303', '龙湾区', 3, '3303', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(992, '330304', '瓯海区', 3, '3303', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(993, '330305', '洞头区', 3, '3303', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(994, '330324', '永嘉县', 3, '3303', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(995, '330326', '平阳县', 3, '3303', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(996, '330327', '苍南县', 3, '3303', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(997, '330328', '文成县', 3, '3303', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(998, '330329', '泰顺县', 3, '3303', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(999, '330381', '瑞安市', 3, '3303', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1000, '330382', '乐清市', 3, '3303', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1001, '330383', '龙港市', 3, '3303', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1002, '3304', '嘉兴市', 2, '33', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1003, '330402', '南湖区', 3, '3304', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1004, '330411', '秀洲区', 3, '3304', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1005, '330421', '嘉善县', 3, '3304', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1006, '330424', '海盐县', 3, '3304', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1007, '330481', '海宁市', 3, '3304', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1008, '330482', '平湖市', 3, '3304', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1009, '330483', '桐乡市', 3, '3304', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1010, '3305', '湖州市', 2, '33', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1011, '330502', '吴兴区', 3, '3305', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1012, '330503', '南浔区', 3, '3305', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1013, '330521', '德清县', 3, '3305', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1014, '330522', '长兴县', 3, '3305', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1015, '330523', '安吉县', 3, '3305', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1016, '3306', '绍兴市', 2, '33', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1017, '330602', '越城区', 3, '3306', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1018, '330603', '柯桥区', 3, '3306', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1019, '330604', '上虞区', 3, '3306', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1020, '330624', '新昌县', 3, '3306', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1021, '330681', '诸暨市', 3, '3306', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1022, '330683', '嵊州市', 3, '3306', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1023, '3307', '金华市', 2, '33', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1024, '330702', '婺城区', 3, '3307', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1025, '330703', '金东区', 3, '3307', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1026, '330723', '武义县', 3, '3307', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1027, '330726', '浦江县', 3, '3307', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1028, '330727', '磐安县', 3, '3307', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1029, '330781', '兰溪市', 3, '3307', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1030, '330782', '义乌市', 3, '3307', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1031, '330783', '东阳市', 3, '3307', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1032, '330784', '永康市', 3, '3307', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1033, '3308', '衢州市', 2, '33', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1034, '330802', '柯城区', 3, '3308', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1035, '330803', '衢江区', 3, '3308', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1036, '330822', '常山县', 3, '3308', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1037, '330824', '开化县', 3, '3308', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1038, '330825', '龙游县', 3, '3308', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1039, '330881', '江山市', 3, '3308', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1040, '3309', '舟山市', 2, '33', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1041, '330902', '定海区', 3, '3309', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1042, '330903', '普陀区', 3, '3309', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1043, '330921', '岱山县', 3, '3309', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1044, '330922', '嵊泗县', 3, '3309', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1045, '3310', '台州市', 2, '33', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1046, '331002', '椒江区', 3, '3310', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1047, '331003', '黄岩区', 3, '3310', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1048, '331004', '路桥区', 3, '3310', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1049, '331022', '三门县', 3, '3310', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1050, '331023', '天台县', 3, '3310', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1051, '331024', '仙居县', 3, '3310', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1052, '331081', '温岭市', 3, '3310', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1053, '331082', '临海市', 3, '3310', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1054, '331083', '玉环市', 3, '3310', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1055, '3311', '丽水市', 2, '33', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1056, '331102', '莲都区', 3, '3311', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1057, '331121', '青田县', 3, '3311', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1058, '331122', '缙云县', 3, '3311', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1059, '331123', '遂昌县', 3, '3311', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1060, '331124', '松阳县', 3, '3311', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1061, '331125', '云和县', 3, '3311', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1062, '331126', '庆元县', 3, '3311', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1063, '331127', '景宁畲族自治县', 3, '3311', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1064, '331181', '龙泉市', 3, '3311', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1065, '34', '安徽省', 1, NULL, 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1066, '3401', '合肥市', 2, '34', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1067, '340102', '瑶海区', 3, '3401', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1068, '340103', '庐阳区', 3, '3401', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1069, '340104', '蜀山区', 3, '3401', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1070, '340111', '包河区', 3, '3401', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1071, '340121', '长丰县', 3, '3401', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1072, '340122', '肥东县', 3, '3401', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1073, '340123', '肥西县', 3, '3401', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1074, '340124', '庐江县', 3, '3401', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1075, '340176', '合肥高新技术产业开发区', 3, '3401', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1076, '340177', '合肥经济技术开发区', 3, '3401', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1077, '340178', '合肥新站高新技术产业开发区', 3, '3401', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1078, '340181', '巢湖市', 3, '3401', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1079, '3402', '芜湖市', 2, '34', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1080, '340202', '镜湖区', 3, '3402', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1081, '340207', '鸠江区', 3, '3402', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1082, '340209', '弋江区', 3, '3402', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1083, '340210', '湾沚区', 3, '3402', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1084, '340212', '繁昌区', 3, '3402', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1085, '340223', '南陵县', 3, '3402', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1086, '340271', '芜湖经济技术开发区', 3, '3402', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1087, '340272', '安徽芜湖三山经济开发区', 3, '3402', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1088, '340281', '无为市', 3, '3402', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1089, '3403', '蚌埠市', 2, '34', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1090, '340302', '龙子湖区', 3, '3403', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1091, '340303', '蚌山区', 3, '3403', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1092, '340304', '禹会区', 3, '3403', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1093, '340311', '淮上区', 3, '3403', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1094, '340321', '怀远县', 3, '3403', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1095, '340322', '五河县', 3, '3403', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1096, '340323', '固镇县', 3, '3403', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1097, '340371', '蚌埠市高新技术开发区', 3, '3403', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1098, '340372', '蚌埠市经济开发区', 3, '3403', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1099, '3404', '淮南市', 2, '34', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1100, '340402', '大通区', 3, '3404', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1101, '340403', '田家庵区', 3, '3404', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1102, '340404', '谢家集区', 3, '3404', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1103, '340405', '八公山区', 3, '3404', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1104, '340406', '潘集区', 3, '3404', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1105, '340421', '凤台县', 3, '3404', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1106, '340422', '寿县', 3, '3404', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1107, '3405', '马鞍山市', 2, '34', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1108, '340503', '花山区', 3, '3405', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1109, '340504', '雨山区', 3, '3405', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1110, '340506', '博望区', 3, '3405', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1111, '340521', '当涂县', 3, '3405', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1112, '340522', '含山县', 3, '3405', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1113, '340523', '和县', 3, '3405', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1114, '3406', '淮北市', 2, '34', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1115, '340602', '杜集区', 3, '3406', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1116, '340603', '相山区', 3, '3406', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1117, '340604', '烈山区', 3, '3406', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1118, '340621', '濉溪县', 3, '3406', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1119, '3407', '铜陵市', 2, '34', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1120, '340705', '铜官区', 3, '3407', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1121, '340706', '义安区', 3, '3407', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1122, '340711', '郊区', 3, '3407', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1123, '340722', '枞阳县', 3, '3407', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1124, '3408', '安庆市', 2, '34', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1125, '340802', '迎江区', 3, '3408', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1126, '340803', '大观区', 3, '3408', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1127, '340811', '宜秀区', 3, '3408', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1128, '340822', '怀宁县', 3, '3408', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1129, '340825', '太湖县', 3, '3408', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1130, '340826', '宿松县', 3, '3408', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1131, '340827', '望江县', 3, '3408', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1132, '340828', '岳西县', 3, '3408', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1133, '340871', '安徽安庆经济开发区', 3, '3408', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1134, '340881', '桐城市', 3, '3408', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1135, '340882', '潜山市', 3, '3408', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1136, '3410', '黄山市', 2, '34', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1137, '341002', '屯溪区', 3, '3410', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1138, '341003', '黄山区', 3, '3410', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1139, '341004', '徽州区', 3, '3410', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1140, '341021', '歙县', 3, '3410', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1141, '341022', '休宁县', 3, '3410', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1142, '341023', '黟县', 3, '3410', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1143, '341024', '祁门县', 3, '3410', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1144, '3411', '滁州市', 2, '34', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1145, '341102', '琅琊区', 3, '3411', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1146, '341103', '南谯区', 3, '3411', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1147, '341122', '来安县', 3, '3411', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1148, '341124', '全椒县', 3, '3411', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1149, '341125', '定远县', 3, '3411', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1150, '341126', '凤阳县', 3, '3411', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1151, '341171', '中新苏滁高新技术产业开发区', 3, '3411', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1152, '341172', '滁州经济技术开发区', 3, '3411', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1153, '341181', '天长市', 3, '3411', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1154, '341182', '明光市', 3, '3411', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1155, '3412', '阜阳市', 2, '34', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1156, '341202', '颍州区', 3, '3412', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1157, '341203', '颍东区', 3, '3412', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1158, '341204', '颍泉区', 3, '3412', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1159, '341221', '临泉县', 3, '3412', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1160, '341222', '太和县', 3, '3412', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1161, '341225', '阜南县', 3, '3412', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1162, '341226', '颍上县', 3, '3412', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1163, '341271', '阜阳合肥现代产业园区', 3, '3412', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1164, '341272', '阜阳经济技术开发区', 3, '3412', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1165, '341282', '界首市', 3, '3412', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1166, '3413', '宿州市', 2, '34', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57');
INSERT INTO `china_region` (`id`, `code`, `name`, `level`, `parent_code`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(1167, '341302', '埇桥区', 3, '3413', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1168, '341321', '砀山县', 3, '3413', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1169, '341322', '萧县', 3, '3413', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1170, '341323', '灵璧县', 3, '3413', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1171, '341324', '泗县', 3, '3413', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1172, '341371', '宿州马鞍山现代产业园区', 3, '3413', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1173, '341372', '宿州经济技术开发区', 3, '3413', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1174, '3415', '六安市', 2, '34', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1175, '341502', '金安区', 3, '3415', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1176, '341503', '裕安区', 3, '3415', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1177, '341504', '叶集区', 3, '3415', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1178, '341522', '霍邱县', 3, '3415', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1179, '341523', '舒城县', 3, '3415', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1180, '341524', '金寨县', 3, '3415', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1181, '341525', '霍山县', 3, '3415', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1182, '3416', '亳州市', 2, '34', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1183, '341602', '谯城区', 3, '3416', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1184, '341621', '涡阳县', 3, '3416', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1185, '341622', '蒙城县', 3, '3416', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1186, '341623', '利辛县', 3, '3416', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1187, '3417', '池州市', 2, '34', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1188, '341702', '贵池区', 3, '3417', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1189, '341721', '东至县', 3, '3417', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1190, '341722', '石台县', 3, '3417', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1191, '341723', '青阳县', 3, '3417', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1192, '3418', '宣城市', 2, '34', 16, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1193, '341802', '宣州区', 3, '3418', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1194, '341821', '郎溪县', 3, '3418', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1195, '341823', '泾县', 3, '3418', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1196, '341824', '绩溪县', 3, '3418', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1197, '341825', '旌德县', 3, '3418', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1198, '341871', '宣城市经济开发区', 3, '3418', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1199, '341881', '宁国市', 3, '3418', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1200, '341882', '广德市', 3, '3418', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1201, '35', '福建省', 1, NULL, 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1202, '3501', '福州市', 2, '35', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1203, '350102', '鼓楼区', 3, '3501', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1204, '350103', '台江区', 3, '3501', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1205, '350104', '仓山区', 3, '3501', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1206, '350105', '马尾区', 3, '3501', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1207, '350111', '晋安区', 3, '3501', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1208, '350112', '长乐区', 3, '3501', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1209, '350121', '闽侯县', 3, '3501', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1210, '350122', '连江县', 3, '3501', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1211, '350123', '罗源县', 3, '3501', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1212, '350124', '闽清县', 3, '3501', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1213, '350125', '永泰县', 3, '3501', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1214, '350128', '平潭县', 3, '3501', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1215, '350181', '福清市', 3, '3501', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1216, '3502', '厦门市', 2, '35', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1217, '350203', '思明区', 3, '3502', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1218, '350205', '海沧区', 3, '3502', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1219, '350206', '湖里区', 3, '3502', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1220, '350211', '集美区', 3, '3502', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1221, '350212', '同安区', 3, '3502', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1222, '350213', '翔安区', 3, '3502', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1223, '3503', '莆田市', 2, '35', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1224, '350302', '城厢区', 3, '3503', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1225, '350303', '涵江区', 3, '3503', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1226, '350304', '荔城区', 3, '3503', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1227, '350305', '秀屿区', 3, '3503', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1228, '350322', '仙游县', 3, '3503', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1229, '3504', '三明市', 2, '35', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1230, '350404', '三元区', 3, '3504', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1231, '350405', '沙县区', 3, '3504', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1232, '350421', '明溪县', 3, '3504', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1233, '350423', '清流县', 3, '3504', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1234, '350424', '宁化县', 3, '3504', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1235, '350425', '大田县', 3, '3504', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1236, '350426', '尤溪县', 3, '3504', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1237, '350428', '将乐县', 3, '3504', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1238, '350429', '泰宁县', 3, '3504', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1239, '350430', '建宁县', 3, '3504', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1240, '350481', '永安市', 3, '3504', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1241, '3505', '泉州市', 2, '35', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1242, '350502', '鲤城区', 3, '3505', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1243, '350503', '丰泽区', 3, '3505', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1244, '350504', '洛江区', 3, '3505', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1245, '350505', '泉港区', 3, '3505', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1246, '350521', '惠安县', 3, '3505', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1247, '350524', '安溪县', 3, '3505', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1248, '350525', '永春县', 3, '3505', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1249, '350526', '德化县', 3, '3505', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1250, '350527', '金门县', 3, '3505', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1251, '350581', '石狮市', 3, '3505', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1252, '350582', '晋江市', 3, '3505', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1253, '350583', '南安市', 3, '3505', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1254, '3506', '漳州市', 2, '35', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1255, '350602', '芗城区', 3, '3506', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1256, '350603', '龙文区', 3, '3506', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1257, '350604', '龙海区', 3, '3506', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1258, '350605', '长泰区', 3, '3506', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1259, '350622', '云霄县', 3, '3506', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1260, '350623', '漳浦县', 3, '3506', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1261, '350624', '诏安县', 3, '3506', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1262, '350626', '东山县', 3, '3506', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1263, '350627', '南靖县', 3, '3506', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1264, '350628', '平和县', 3, '3506', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1265, '350629', '华安县', 3, '3506', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1266, '3507', '南平市', 2, '35', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1267, '350702', '延平区', 3, '3507', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1268, '350703', '建阳区', 3, '3507', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1269, '350721', '顺昌县', 3, '3507', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1270, '350722', '浦城县', 3, '3507', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1271, '350723', '光泽县', 3, '3507', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1272, '350724', '松溪县', 3, '3507', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1273, '350725', '政和县', 3, '3507', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1274, '350781', '邵武市', 3, '3507', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1275, '350782', '武夷山市', 3, '3507', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1276, '350783', '建瓯市', 3, '3507', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1277, '3508', '龙岩市', 2, '35', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1278, '350802', '新罗区', 3, '3508', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1279, '350803', '永定区', 3, '3508', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1280, '350821', '长汀县', 3, '3508', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1281, '350823', '上杭县', 3, '3508', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1282, '350824', '武平县', 3, '3508', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1283, '350825', '连城县', 3, '3508', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1284, '350881', '漳平市', 3, '3508', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1285, '3509', '宁德市', 2, '35', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1286, '350902', '蕉城区', 3, '3509', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1287, '350921', '霞浦县', 3, '3509', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1288, '350922', '古田县', 3, '3509', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1289, '350923', '屏南县', 3, '3509', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1290, '350924', '寿宁县', 3, '3509', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1291, '350925', '周宁县', 3, '3509', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1292, '350926', '柘荣县', 3, '3509', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1293, '350981', '福安市', 3, '3509', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1294, '350982', '福鼎市', 3, '3509', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1295, '36', '江西省', 1, NULL, 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1296, '3601', '南昌市', 2, '36', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1297, '360102', '东湖区', 3, '3601', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1298, '360103', '西湖区', 3, '3601', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1299, '360104', '青云谱区', 3, '3601', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1300, '360111', '青山湖区', 3, '3601', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1301, '360112', '新建区', 3, '3601', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1302, '360113', '红谷滩区', 3, '3601', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1303, '360121', '南昌县', 3, '3601', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1304, '360123', '安义县', 3, '3601', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1305, '360124', '进贤县', 3, '3601', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1306, '3602', '景德镇市', 2, '36', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1307, '360202', '昌江区', 3, '3602', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1308, '360203', '珠山区', 3, '3602', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1309, '360222', '浮梁县', 3, '3602', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1310, '360281', '乐平市', 3, '3602', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1311, '3603', '萍乡市', 2, '36', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1312, '360302', '安源区', 3, '3603', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1313, '360313', '湘东区', 3, '3603', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1314, '360321', '莲花县', 3, '3603', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1315, '360322', '上栗县', 3, '3603', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1316, '360323', '芦溪县', 3, '3603', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1317, '3604', '九江市', 2, '36', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1318, '360402', '濂溪区', 3, '3604', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1319, '360403', '浔阳区', 3, '3604', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1320, '360404', '柴桑区', 3, '3604', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1321, '360423', '武宁县', 3, '3604', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1322, '360424', '修水县', 3, '3604', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1323, '360425', '永修县', 3, '3604', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1324, '360426', '德安县', 3, '3604', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1325, '360428', '都昌县', 3, '3604', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1326, '360429', '湖口县', 3, '3604', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1327, '360430', '彭泽县', 3, '3604', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1328, '360481', '瑞昌市', 3, '3604', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1329, '360482', '共青城市', 3, '3604', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1330, '360483', '庐山市', 3, '3604', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1331, '3605', '新余市', 2, '36', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1332, '360502', '渝水区', 3, '3605', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1333, '360521', '分宜县', 3, '3605', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1334, '3606', '鹰潭市', 2, '36', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1335, '360602', '月湖区', 3, '3606', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1336, '360603', '余江区', 3, '3606', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1337, '360681', '贵溪市', 3, '3606', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1338, '3607', '赣州市', 2, '36', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1339, '360702', '章贡区', 3, '3607', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1340, '360703', '南康区', 3, '3607', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1341, '360704', '赣县区', 3, '3607', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1342, '360722', '信丰县', 3, '3607', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1343, '360723', '大余县', 3, '3607', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1344, '360724', '上犹县', 3, '3607', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1345, '360725', '崇义县', 3, '3607', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1346, '360726', '安远县', 3, '3607', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1347, '360728', '定南县', 3, '3607', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1348, '360729', '全南县', 3, '3607', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1349, '360730', '宁都县', 3, '3607', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1350, '360731', '于都县', 3, '3607', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1351, '360732', '兴国县', 3, '3607', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1352, '360733', '会昌县', 3, '3607', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1353, '360734', '寻乌县', 3, '3607', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1354, '360735', '石城县', 3, '3607', 16, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1355, '360781', '瑞金市', 3, '3607', 17, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1356, '360783', '龙南市', 3, '3607', 18, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1357, '3608', '吉安市', 2, '36', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1358, '360802', '吉州区', 3, '3608', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1359, '360803', '青原区', 3, '3608', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1360, '360821', '吉安县', 3, '3608', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1361, '360822', '吉水县', 3, '3608', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1362, '360823', '峡江县', 3, '3608', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1363, '360824', '新干县', 3, '3608', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1364, '360825', '永丰县', 3, '3608', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1365, '360826', '泰和县', 3, '3608', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1366, '360827', '遂川县', 3, '3608', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1367, '360828', '万安县', 3, '3608', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1368, '360829', '安福县', 3, '3608', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1369, '360830', '永新县', 3, '3608', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1370, '360881', '井冈山市', 3, '3608', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1371, '3609', '宜春市', 2, '36', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1372, '360902', '袁州区', 3, '3609', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1373, '360921', '奉新县', 3, '3609', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1374, '360922', '万载县', 3, '3609', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1375, '360923', '上高县', 3, '3609', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1376, '360924', '宜丰县', 3, '3609', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1377, '360925', '靖安县', 3, '3609', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1378, '360926', '铜鼓县', 3, '3609', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1379, '360981', '丰城市', 3, '3609', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1380, '360982', '樟树市', 3, '3609', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1381, '360983', '高安市', 3, '3609', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1382, '3610', '抚州市', 2, '36', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1383, '361002', '临川区', 3, '3610', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1384, '361003', '东乡区', 3, '3610', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1385, '361021', '南城县', 3, '3610', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1386, '361022', '黎川县', 3, '3610', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1387, '361023', '南丰县', 3, '3610', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1388, '361024', '崇仁县', 3, '3610', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1389, '361025', '乐安县', 3, '3610', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1390, '361026', '宜黄县', 3, '3610', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1391, '361027', '金溪县', 3, '3610', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1392, '361028', '资溪县', 3, '3610', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1393, '361030', '广昌县', 3, '3610', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1394, '3611', '上饶市', 2, '36', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1395, '361102', '信州区', 3, '3611', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1396, '361103', '广丰区', 3, '3611', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1397, '361104', '广信区', 3, '3611', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1398, '361123', '玉山县', 3, '3611', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1399, '361124', '铅山县', 3, '3611', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1400, '361125', '横峰县', 3, '3611', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1401, '361126', '弋阳县', 3, '3611', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1402, '361127', '余干县', 3, '3611', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1403, '361128', '鄱阳县', 3, '3611', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1404, '361129', '万年县', 3, '3611', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1405, '361130', '婺源县', 3, '3611', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1406, '361181', '德兴市', 3, '3611', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1407, '37', '山东省', 1, NULL, 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1408, '3701', '济南市', 2, '37', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1409, '370102', '历下区', 3, '3701', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1410, '370103', '市中区', 3, '3701', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1411, '370104', '槐荫区', 3, '3701', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1412, '370105', '天桥区', 3, '3701', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1413, '370112', '历城区', 3, '3701', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1414, '370113', '长清区', 3, '3701', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1415, '370114', '章丘区', 3, '3701', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1416, '370115', '济阳区', 3, '3701', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1417, '370116', '莱芜区', 3, '3701', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1418, '370117', '钢城区', 3, '3701', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1419, '370124', '平阴县', 3, '3701', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1420, '370126', '商河县', 3, '3701', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1421, '370176', '济南高新技术产业开发区', 3, '3701', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1422, '3702', '青岛市', 2, '37', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1423, '370202', '市南区', 3, '3702', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1424, '370203', '市北区', 3, '3702', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1425, '370211', '黄岛区', 3, '3702', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1426, '370212', '崂山区', 3, '3702', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1427, '370213', '李沧区', 3, '3702', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1428, '370214', '城阳区', 3, '3702', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1429, '370215', '即墨区', 3, '3702', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1430, '370281', '胶州市', 3, '3702', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1431, '370283', '平度市', 3, '3702', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1432, '370285', '莱西市', 3, '3702', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1433, '3703', '淄博市', 2, '37', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1434, '370302', '淄川区', 3, '3703', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1435, '370303', '张店区', 3, '3703', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1436, '370304', '博山区', 3, '3703', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1437, '370305', '临淄区', 3, '3703', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1438, '370306', '周村区', 3, '3703', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1439, '370321', '桓台县', 3, '3703', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1440, '370322', '高青县', 3, '3703', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1441, '370323', '沂源县', 3, '3703', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1442, '3704', '枣庄市', 2, '37', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1443, '370402', '市中区', 3, '3704', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1444, '370403', '薛城区', 3, '3704', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1445, '370404', '峄城区', 3, '3704', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1446, '370405', '台儿庄区', 3, '3704', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1447, '370406', '山亭区', 3, '3704', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1448, '370481', '滕州市', 3, '3704', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1449, '3705', '东营市', 2, '37', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1450, '370502', '东营区', 3, '3705', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1451, '370503', '河口区', 3, '3705', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1452, '370505', '垦利区', 3, '3705', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1453, '370522', '利津县', 3, '3705', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1454, '370523', '广饶县', 3, '3705', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1455, '370571', '东营经济技术开发区', 3, '3705', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1456, '370572', '东营港经济开发区', 3, '3705', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1457, '3706', '烟台市', 2, '37', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1458, '370602', '芝罘区', 3, '3706', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1459, '370611', '福山区', 3, '3706', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1460, '370612', '牟平区', 3, '3706', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1461, '370613', '莱山区', 3, '3706', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1462, '370614', '蓬莱区', 3, '3706', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1463, '370671', '烟台高新技术产业开发区', 3, '3706', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1464, '370676', '烟台经济技术开发区', 3, '3706', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1465, '370681', '龙口市', 3, '3706', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1466, '370682', '莱阳市', 3, '3706', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1467, '370683', '莱州市', 3, '3706', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1468, '370685', '招远市', 3, '3706', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1469, '370686', '栖霞市', 3, '3706', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1470, '370687', '海阳市', 3, '3706', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1471, '3707', '潍坊市', 2, '37', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1472, '370702', '潍城区', 3, '3707', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1473, '370703', '寒亭区', 3, '3707', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1474, '370704', '坊子区', 3, '3707', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1475, '370705', '奎文区', 3, '3707', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1476, '370724', '临朐县', 3, '3707', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1477, '370725', '昌乐县', 3, '3707', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1478, '370772', '潍坊滨海经济技术开发区', 3, '3707', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1479, '370781', '青州市', 3, '3707', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1480, '370782', '诸城市', 3, '3707', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1481, '370783', '寿光市', 3, '3707', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1482, '370784', '安丘市', 3, '3707', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1483, '370785', '高密市', 3, '3707', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1484, '370786', '昌邑市', 3, '3707', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1485, '3708', '济宁市', 2, '37', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1486, '370811', '任城区', 3, '3708', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1487, '370812', '兖州区', 3, '3708', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1488, '370826', '微山县', 3, '3708', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1489, '370827', '鱼台县', 3, '3708', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1490, '370828', '金乡县', 3, '3708', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1491, '370829', '嘉祥县', 3, '3708', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1492, '370830', '汶上县', 3, '3708', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1493, '370831', '泗水县', 3, '3708', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1494, '370832', '梁山县', 3, '3708', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1495, '370871', '济宁高新技术产业开发区', 3, '3708', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1496, '370881', '曲阜市', 3, '3708', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1497, '370883', '邹城市', 3, '3708', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1498, '3709', '泰安市', 2, '37', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1499, '370902', '泰山区', 3, '3709', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1500, '370911', '岱岳区', 3, '3709', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1501, '370921', '宁阳县', 3, '3709', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1502, '370923', '东平县', 3, '3709', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1503, '370982', '新泰市', 3, '3709', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1504, '370983', '肥城市', 3, '3709', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1505, '3710', '威海市', 2, '37', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1506, '371002', '环翠区', 3, '3710', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1507, '371003', '文登区', 3, '3710', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1508, '371071', '威海火炬高技术产业开发区', 3, '3710', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1509, '371072', '威海经济技术开发区', 3, '3710', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1510, '371073', '威海临港经济技术开发区', 3, '3710', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1511, '371082', '荣成市', 3, '3710', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1512, '371083', '乳山市', 3, '3710', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1513, '3711', '日照市', 2, '37', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1514, '371102', '东港区', 3, '3711', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1515, '371103', '岚山区', 3, '3711', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1516, '371121', '五莲县', 3, '3711', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1517, '371122', '莒县', 3, '3711', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1518, '371171', '日照经济技术开发区', 3, '3711', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1519, '3713', '临沂市', 2, '37', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1520, '371302', '兰山区', 3, '3713', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1521, '371311', '罗庄区', 3, '3713', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1522, '371312', '河东区', 3, '3713', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1523, '371321', '沂南县', 3, '3713', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1524, '371322', '郯城县', 3, '3713', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1525, '371323', '沂水县', 3, '3713', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1526, '371324', '兰陵县', 3, '3713', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1527, '371325', '费县', 3, '3713', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1528, '371326', '平邑县', 3, '3713', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1529, '371327', '莒南县', 3, '3713', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1530, '371328', '蒙阴县', 3, '3713', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1531, '371329', '临沭县', 3, '3713', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1532, '371371', '临沂高新技术产业开发区', 3, '3713', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1533, '3714', '德州市', 2, '37', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1534, '371402', '德城区', 3, '3714', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1535, '371403', '陵城区', 3, '3714', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1536, '371422', '宁津县', 3, '3714', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1537, '371423', '庆云县', 3, '3714', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1538, '371424', '临邑县', 3, '3714', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1539, '371425', '齐河县', 3, '3714', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1540, '371426', '平原县', 3, '3714', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1541, '371427', '夏津县', 3, '3714', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1542, '371428', '武城县', 3, '3714', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1543, '371471', '德州天衢新区', 3, '3714', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1544, '371481', '乐陵市', 3, '3714', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1545, '371482', '禹城市', 3, '3714', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1546, '3715', '聊城市', 2, '37', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1547, '371502', '东昌府区', 3, '3715', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1548, '371503', '茌平区', 3, '3715', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1549, '371521', '阳谷县', 3, '3715', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1550, '371522', '莘县', 3, '3715', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1551, '371524', '东阿县', 3, '3715', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1552, '371525', '冠县', 3, '3715', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1553, '371526', '高唐县', 3, '3715', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1554, '371581', '临清市', 3, '3715', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1555, '3716', '滨州市', 2, '37', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1556, '371602', '滨城区', 3, '3716', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1557, '371603', '沾化区', 3, '3716', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1558, '371621', '惠民县', 3, '3716', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1559, '371622', '阳信县', 3, '3716', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1560, '371623', '无棣县', 3, '3716', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1561, '371625', '博兴县', 3, '3716', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1562, '371681', '邹平市', 3, '3716', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1563, '3717', '菏泽市', 2, '37', 16, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1564, '371702', '牡丹区', 3, '3717', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1565, '371703', '定陶区', 3, '3717', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1566, '371721', '曹县', 3, '3717', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1567, '371722', '单县', 3, '3717', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1568, '371723', '成武县', 3, '3717', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1569, '371724', '巨野县', 3, '3717', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1570, '371725', '郓城县', 3, '3717', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1571, '371726', '鄄城县', 3, '3717', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1572, '371728', '东明县', 3, '3717', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1573, '371771', '菏泽经济技术开发区', 3, '3717', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1574, '371772', '菏泽高新技术开发区', 3, '3717', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1575, '41', '河南省', 1, NULL, 16, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1576, '4101', '郑州市', 2, '41', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1577, '410102', '中原区', 3, '4101', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1578, '410103', '二七区', 3, '4101', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1579, '410104', '管城回族区', 3, '4101', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1580, '410105', '金水区', 3, '4101', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1581, '410106', '上街区', 3, '4101', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1582, '410108', '惠济区', 3, '4101', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1583, '410122', '中牟县', 3, '4101', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1584, '410171', '郑州经济技术开发区', 3, '4101', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1585, '410172', '郑州高新技术产业开发区', 3, '4101', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1586, '410173', '郑州航空港经济综合实验区', 3, '4101', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1587, '410181', '巩义市', 3, '4101', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1588, '410182', '荥阳市', 3, '4101', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1589, '410183', '新密市', 3, '4101', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1590, '410184', '新郑市', 3, '4101', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1591, '410185', '登封市', 3, '4101', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1592, '4102', '开封市', 2, '41', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1593, '410202', '龙亭区', 3, '4102', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1594, '410203', '顺河回族区', 3, '4102', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1595, '410204', '鼓楼区', 3, '4102', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1596, '410205', '禹王台区', 3, '4102', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1597, '410212', '祥符区', 3, '4102', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1598, '410221', '杞县', 3, '4102', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1599, '410222', '通许县', 3, '4102', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1600, '410223', '尉氏县', 3, '4102', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1601, '410225', '兰考县', 3, '4102', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1602, '4103', '洛阳市', 2, '41', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1603, '410302', '老城区', 3, '4103', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1604, '410303', '西工区', 3, '4103', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1605, '410304', '瀍河回族区', 3, '4103', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1606, '410305', '涧西区', 3, '4103', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1607, '410307', '偃师区', 3, '4103', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1608, '410308', '孟津区', 3, '4103', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1609, '410311', '洛龙区', 3, '4103', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1610, '410323', '新安县', 3, '4103', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1611, '410324', '栾川县', 3, '4103', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1612, '410325', '嵩县', 3, '4103', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1613, '410326', '汝阳县', 3, '4103', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1614, '410327', '宜阳县', 3, '4103', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1615, '410328', '洛宁县', 3, '4103', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1616, '410329', '伊川县', 3, '4103', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1617, '410371', '洛阳高新技术产业开发区', 3, '4103', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1618, '4104', '平顶山市', 2, '41', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1619, '410402', '新华区', 3, '4104', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1620, '410403', '卫东区', 3, '4104', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1621, '410404', '石龙区', 3, '4104', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1622, '410411', '湛河区', 3, '4104', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1623, '410421', '宝丰县', 3, '4104', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1624, '410422', '叶县', 3, '4104', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1625, '410423', '鲁山县', 3, '4104', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1626, '410425', '郏县', 3, '4104', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1627, '410471', '平顶山高新技术产业开发区', 3, '4104', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1628, '410472', '平顶山市城乡一体化示范区', 3, '4104', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1629, '410481', '舞钢市', 3, '4104', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1630, '410482', '汝州市', 3, '4104', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1631, '4105', '安阳市', 2, '41', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1632, '410502', '文峰区', 3, '4105', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1633, '410503', '北关区', 3, '4105', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1634, '410505', '殷都区', 3, '4105', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1635, '410506', '龙安区', 3, '4105', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1636, '410522', '安阳县', 3, '4105', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1637, '410523', '汤阴县', 3, '4105', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1638, '410526', '滑县', 3, '4105', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1639, '410527', '内黄县', 3, '4105', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1640, '410571', '安阳高新技术产业开发区', 3, '4105', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1641, '410581', '林州市', 3, '4105', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1642, '4106', '鹤壁市', 2, '41', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1643, '410602', '鹤山区', 3, '4106', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1644, '410603', '山城区', 3, '4106', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1645, '410611', '淇滨区', 3, '4106', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1646, '410621', '浚县', 3, '4106', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1647, '410622', '淇县', 3, '4106', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1648, '410671', '鹤壁经济技术开发区', 3, '4106', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1649, '4107', '新乡市', 2, '41', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1650, '410702', '红旗区', 3, '4107', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1651, '410703', '卫滨区', 3, '4107', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1652, '410704', '凤泉区', 3, '4107', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1653, '410711', '牧野区', 3, '4107', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1654, '410721', '新乡县', 3, '4107', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1655, '410724', '获嘉县', 3, '4107', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1656, '410725', '原阳县', 3, '4107', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1657, '410726', '延津县', 3, '4107', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1658, '410727', '封丘县', 3, '4107', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1659, '410771', '新乡高新技术产业开发区', 3, '4107', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1660, '410772', '新乡经济技术开发区', 3, '4107', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1661, '410773', '新乡市平原城乡一体化示范区', 3, '4107', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1662, '410781', '卫辉市', 3, '4107', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1663, '410782', '辉县市', 3, '4107', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1664, '410783', '长垣市', 3, '4107', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1665, '4108', '焦作市', 2, '41', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1666, '410802', '解放区', 3, '4108', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1667, '410803', '中站区', 3, '4108', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1668, '410804', '马村区', 3, '4108', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1669, '410811', '山阳区', 3, '4108', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1670, '410821', '修武县', 3, '4108', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1671, '410822', '博爱县', 3, '4108', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1672, '410823', '武陟县', 3, '4108', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1673, '410825', '温县', 3, '4108', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1674, '410871', '焦作城乡一体化示范区', 3, '4108', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1675, '410882', '沁阳市', 3, '4108', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1676, '410883', '孟州市', 3, '4108', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1677, '4109', '濮阳市', 2, '41', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1678, '410902', '华龙区', 3, '4109', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1679, '410922', '清丰县', 3, '4109', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1680, '410923', '南乐县', 3, '4109', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1681, '410926', '范县', 3, '4109', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1682, '410927', '台前县', 3, '4109', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1683, '410928', '濮阳县', 3, '4109', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1684, '410971', '河南濮阳工业园区', 3, '4109', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1685, '410972', '濮阳经济技术开发区', 3, '4109', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1686, '4110', '许昌市', 2, '41', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1687, '411002', '魏都区', 3, '4110', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1688, '411003', '建安区', 3, '4110', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1689, '411024', '鄢陵县', 3, '4110', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1690, '411025', '襄城县', 3, '4110', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1691, '411071', '许昌经济技术开发区', 3, '4110', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1692, '411081', '禹州市', 3, '4110', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1693, '411082', '长葛市', 3, '4110', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1694, '4111', '漯河市', 2, '41', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1695, '411102', '源汇区', 3, '4111', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1696, '411103', '郾城区', 3, '4111', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1697, '411104', '召陵区', 3, '4111', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1698, '411121', '舞阳县', 3, '4111', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1699, '411122', '临颍县', 3, '4111', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1700, '411171', '漯河经济技术开发区', 3, '4111', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1701, '4112', '三门峡市', 2, '41', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1702, '411202', '湖滨区', 3, '4112', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1703, '411203', '陕州区', 3, '4112', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1704, '411221', '渑池县', 3, '4112', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1705, '411224', '卢氏县', 3, '4112', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1706, '411271', '河南三门峡经济开发区', 3, '4112', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1707, '411281', '义马市', 3, '4112', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1708, '411282', '灵宝市', 3, '4112', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1709, '4113', '南阳市', 2, '41', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1710, '411302', '宛城区', 3, '4113', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1711, '411303', '卧龙区', 3, '4113', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1712, '411321', '南召县', 3, '4113', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1713, '411322', '方城县', 3, '4113', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1714, '411323', '西峡县', 3, '4113', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1715, '411324', '镇平县', 3, '4113', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1716, '411325', '内乡县', 3, '4113', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1717, '411326', '淅川县', 3, '4113', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1718, '411327', '社旗县', 3, '4113', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1719, '411328', '唐河县', 3, '4113', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1720, '411329', '新野县', 3, '4113', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1721, '411330', '桐柏县', 3, '4113', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1722, '411371', '南阳高新技术产业开发区', 3, '4113', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1723, '411372', '南阳市城乡一体化示范区', 3, '4113', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1724, '411381', '邓州市', 3, '4113', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1725, '4114', '商丘市', 2, '41', 14, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1726, '411402', '梁园区', 3, '4114', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1727, '411403', '睢阳区', 3, '4114', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1728, '411421', '民权县', 3, '4114', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1729, '411422', '睢县', 3, '4114', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1730, '411423', '宁陵县', 3, '4114', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1731, '411424', '柘城县', 3, '4114', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1732, '411425', '虞城县', 3, '4114', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1733, '411426', '夏邑县', 3, '4114', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1734, '411471', '豫东综合物流产业聚集区', 3, '4114', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1735, '411472', '河南商丘经济开发区', 3, '4114', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1736, '411481', '永城市', 3, '4114', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1737, '4115', '信阳市', 2, '41', 15, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1738, '411502', '浉河区', 3, '4115', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1739, '411503', '平桥区', 3, '4115', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1740, '411521', '罗山县', 3, '4115', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1741, '411522', '光山县', 3, '4115', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1742, '411523', '新县', 3, '4115', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1743, '411524', '商城县', 3, '4115', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1744, '411525', '固始县', 3, '4115', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57');
INSERT INTO `china_region` (`id`, `code`, `name`, `level`, `parent_code`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(1745, '411526', '潢川县', 3, '4115', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1746, '411527', '淮滨县', 3, '4115', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1747, '411528', '息县', 3, '4115', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1748, '411571', '信阳高新技术产业开发区', 3, '4115', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1749, '4116', '周口市', 2, '41', 16, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1750, '411602', '川汇区', 3, '4116', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1751, '411603', '淮阳区', 3, '4116', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1752, '411621', '扶沟县', 3, '4116', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1753, '411622', '西华县', 3, '4116', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1754, '411623', '商水县', 3, '4116', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1755, '411624', '沈丘县', 3, '4116', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1756, '411625', '郸城县', 3, '4116', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1757, '411627', '太康县', 3, '4116', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1758, '411628', '鹿邑县', 3, '4116', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1759, '411671', '周口临港开发区', 3, '4116', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1760, '411681', '项城市', 3, '4116', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1761, '4117', '驻马店市', 2, '41', 17, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1762, '411702', '驿城区', 3, '4117', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1763, '411721', '西平县', 3, '4117', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1764, '411722', '上蔡县', 3, '4117', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1765, '411723', '平舆县', 3, '4117', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1766, '411724', '正阳县', 3, '4117', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1767, '411725', '确山县', 3, '4117', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1768, '411726', '泌阳县', 3, '4117', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1769, '411727', '汝南县', 3, '4117', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1770, '411728', '遂平县', 3, '4117', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1771, '411729', '新蔡县', 3, '4117', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1772, '411771', '河南驻马店经济开发区', 3, '4117', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1773, '4190', '省直辖县级行政区划', 2, '41', 18, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1774, '419001', '济源市', 3, '4190', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1775, '42', '湖北省', 1, NULL, 17, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1776, '4201', '武汉市', 2, '42', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1777, '420102', '江岸区', 3, '4201', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1778, '420103', '江汉区', 3, '4201', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1779, '420104', '硚口区', 3, '4201', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1780, '420105', '汉阳区', 3, '4201', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1781, '420106', '武昌区', 3, '4201', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1782, '420107', '青山区', 3, '4201', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1783, '420111', '洪山区', 3, '4201', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1784, '420112', '东西湖区', 3, '4201', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1785, '420113', '汉南区', 3, '4201', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1786, '420114', '蔡甸区', 3, '4201', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1787, '420115', '江夏区', 3, '4201', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1788, '420116', '黄陂区', 3, '4201', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1789, '420117', '新洲区', 3, '4201', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1790, '4202', '黄石市', 2, '42', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1791, '420202', '黄石港区', 3, '4202', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1792, '420203', '西塞山区', 3, '4202', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1793, '420204', '下陆区', 3, '4202', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1794, '420205', '铁山区', 3, '4202', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1795, '420222', '阳新县', 3, '4202', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1796, '420281', '大冶市', 3, '4202', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1797, '4203', '十堰市', 2, '42', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1798, '420302', '茅箭区', 3, '4203', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1799, '420303', '张湾区', 3, '4203', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1800, '420304', '郧阳区', 3, '4203', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1801, '420322', '郧西县', 3, '4203', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1802, '420323', '竹山县', 3, '4203', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1803, '420324', '竹溪县', 3, '4203', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1804, '420325', '房县', 3, '4203', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1805, '420381', '丹江口市', 3, '4203', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1806, '4205', '宜昌市', 2, '42', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1807, '420502', '西陵区', 3, '4205', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1808, '420503', '伍家岗区', 3, '4205', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1809, '420504', '点军区', 3, '4205', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1810, '420505', '猇亭区', 3, '4205', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1811, '420506', '夷陵区', 3, '4205', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1812, '420525', '远安县', 3, '4205', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1813, '420526', '兴山县', 3, '4205', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1814, '420527', '秭归县', 3, '4205', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1815, '420528', '长阳土家族自治县', 3, '4205', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1816, '420529', '五峰土家族自治县', 3, '4205', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1817, '420581', '宜都市', 3, '4205', 11, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1818, '420582', '当阳市', 3, '4205', 12, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1819, '420583', '枝江市', 3, '4205', 13, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1820, '4206', '襄阳市', 2, '42', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1821, '420602', '襄城区', 3, '4206', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1822, '420606', '樊城区', 3, '4206', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1823, '420607', '襄州区', 3, '4206', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1824, '420624', '南漳县', 3, '4206', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1825, '420625', '谷城县', 3, '4206', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1826, '420626', '保康县', 3, '4206', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1827, '420682', '老河口市', 3, '4206', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1828, '420683', '枣阳市', 3, '4206', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1829, '420684', '宜城市', 3, '4206', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1830, '4207', '鄂州市', 2, '42', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1831, '420702', '梁子湖区', 3, '4207', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1832, '420703', '华容区', 3, '4207', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1833, '420704', '鄂城区', 3, '4207', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1834, '4208', '荆门市', 2, '42', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1835, '420802', '东宝区', 3, '4208', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1836, '420804', '掇刀区', 3, '4208', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1837, '420822', '沙洋县', 3, '4208', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1838, '420881', '钟祥市', 3, '4208', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1839, '420882', '京山市', 3, '4208', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1840, '4209', '孝感市', 2, '42', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1841, '420902', '孝南区', 3, '4209', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1842, '420921', '孝昌县', 3, '4209', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1843, '420922', '大悟县', 3, '4209', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1844, '420923', '云梦县', 3, '4209', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1845, '420981', '应城市', 3, '4209', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1846, '420982', '安陆市', 3, '4209', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1847, '420984', '汉川市', 3, '4209', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1848, '4210', '荆州市', 2, '42', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1849, '421002', '沙市区', 3, '4210', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1850, '421003', '荆州区', 3, '4210', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1851, '421022', '公安县', 3, '4210', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1852, '421024', '江陵县', 3, '4210', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1853, '421071', '荆州经济技术开发区', 3, '4210', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1854, '421081', '石首市', 3, '4210', 6, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1855, '421083', '洪湖市', 3, '4210', 7, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1856, '421087', '松滋市', 3, '4210', 8, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1857, '421088', '监利市', 3, '4210', 9, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1858, '4211', '黄冈市', 2, '42', 10, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1859, '421102', '黄州区', 3, '4211', 1, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1860, '421121', '团风县', 3, '4211', 2, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1861, '421122', '红安县', 3, '4211', 3, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1862, '421123', '罗田县', 3, '4211', 4, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1863, '421124', '英山县', 3, '4211', 5, 1, '2025-10-02 02:34:57', '2025-10-02 02:34:57'),
(1864, '421125', '浠水县', 3, '4211', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1865, '421126', '蕲春县', 3, '4211', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1866, '421127', '黄梅县', 3, '4211', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1867, '421171', '龙感湖管理区', 3, '4211', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1868, '421181', '麻城市', 3, '4211', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1869, '421182', '武穴市', 3, '4211', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1870, '4212', '咸宁市', 2, '42', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1871, '421202', '咸安区', 3, '4212', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1872, '421221', '嘉鱼县', 3, '4212', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1873, '421222', '通城县', 3, '4212', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1874, '421223', '崇阳县', 3, '4212', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1875, '421224', '通山县', 3, '4212', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1876, '421281', '赤壁市', 3, '4212', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1877, '4213', '随州市', 2, '42', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1878, '421303', '曾都区', 3, '4213', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1879, '421321', '随县', 3, '4213', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1880, '421381', '广水市', 3, '4213', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1881, '4228', '恩施土家族苗族自治州', 2, '42', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1882, '422801', '恩施市', 3, '4228', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1883, '422802', '利川市', 3, '4228', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1884, '422822', '建始县', 3, '4228', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1885, '422823', '巴东县', 3, '4228', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1886, '422825', '宣恩县', 3, '4228', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1887, '422826', '咸丰县', 3, '4228', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1888, '422827', '来凤县', 3, '4228', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1889, '422828', '鹤峰县', 3, '4228', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1890, '4290', '省直辖县级行政区划', 2, '42', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1891, '429004', '仙桃市', 3, '4290', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1892, '429005', '潜江市', 3, '4290', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1893, '429006', '天门市', 3, '4290', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1894, '429021', '神农架林区', 3, '4290', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1895, '43', '湖南省', 1, NULL, 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1896, '4301', '长沙市', 2, '43', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1897, '430102', '芙蓉区', 3, '4301', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1898, '430103', '天心区', 3, '4301', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1899, '430104', '岳麓区', 3, '4301', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1900, '430105', '开福区', 3, '4301', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1901, '430111', '雨花区', 3, '4301', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1902, '430112', '望城区', 3, '4301', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1903, '430121', '长沙县', 3, '4301', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1904, '430181', '浏阳市', 3, '4301', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1905, '430182', '宁乡市', 3, '4301', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1906, '4302', '株洲市', 2, '43', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1907, '430202', '荷塘区', 3, '4302', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1908, '430203', '芦淞区', 3, '4302', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1909, '430204', '石峰区', 3, '4302', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1910, '430211', '天元区', 3, '4302', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1911, '430212', '渌口区', 3, '4302', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1912, '430223', '攸县', 3, '4302', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1913, '430224', '茶陵县', 3, '4302', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1914, '430225', '炎陵县', 3, '4302', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1915, '430281', '醴陵市', 3, '4302', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1916, '4303', '湘潭市', 2, '43', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1917, '430302', '雨湖区', 3, '4303', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1918, '430304', '岳塘区', 3, '4303', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1919, '430321', '湘潭县', 3, '4303', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1920, '430371', '湖南湘潭高新技术产业园区', 3, '4303', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1921, '430372', '湘潭昭山示范区', 3, '4303', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1922, '430373', '湘潭九华示范区', 3, '4303', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1923, '430381', '湘乡市', 3, '4303', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1924, '430382', '韶山市', 3, '4303', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1925, '4304', '衡阳市', 2, '43', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1926, '430405', '珠晖区', 3, '4304', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1927, '430406', '雁峰区', 3, '4304', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1928, '430407', '石鼓区', 3, '4304', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1929, '430408', '蒸湘区', 3, '4304', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1930, '430412', '南岳区', 3, '4304', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1931, '430421', '衡阳县', 3, '4304', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1932, '430422', '衡南县', 3, '4304', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1933, '430423', '衡山县', 3, '4304', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1934, '430424', '衡东县', 3, '4304', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1935, '430426', '祁东县', 3, '4304', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1936, '430473', '湖南衡阳松木经济开发区', 3, '4304', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1937, '430476', '湖南衡阳高新技术产业园区', 3, '4304', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1938, '430481', '耒阳市', 3, '4304', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1939, '430482', '常宁市', 3, '4304', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1940, '4305', '邵阳市', 2, '43', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1941, '430502', '双清区', 3, '4305', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1942, '430503', '大祥区', 3, '4305', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1943, '430511', '北塔区', 3, '4305', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1944, '430522', '新邵县', 3, '4305', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1945, '430523', '邵阳县', 3, '4305', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1946, '430524', '隆回县', 3, '4305', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1947, '430525', '洞口县', 3, '4305', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1948, '430527', '绥宁县', 3, '4305', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1949, '430528', '新宁县', 3, '4305', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1950, '430529', '城步苗族自治县', 3, '4305', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1951, '430581', '武冈市', 3, '4305', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1952, '430582', '邵东市', 3, '4305', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1953, '4306', '岳阳市', 2, '43', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1954, '430602', '岳阳楼区', 3, '4306', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1955, '430603', '云溪区', 3, '4306', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1956, '430611', '君山区', 3, '4306', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1957, '430621', '岳阳县', 3, '4306', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1958, '430623', '华容县', 3, '4306', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1959, '430624', '湘阴县', 3, '4306', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1960, '430626', '平江县', 3, '4306', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1961, '430671', '岳阳市屈原管理区', 3, '4306', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1962, '430681', '汨罗市', 3, '4306', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1963, '430682', '临湘市', 3, '4306', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1964, '4307', '常德市', 2, '43', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1965, '430702', '武陵区', 3, '4307', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1966, '430703', '鼎城区', 3, '4307', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1967, '430721', '安乡县', 3, '4307', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1968, '430722', '汉寿县', 3, '4307', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1969, '430723', '澧县', 3, '4307', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1970, '430724', '临澧县', 3, '4307', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1971, '430725', '桃源县', 3, '4307', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1972, '430726', '石门县', 3, '4307', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1973, '430771', '常德市西洞庭管理区', 3, '4307', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1974, '430781', '津市市', 3, '4307', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1975, '4308', '张家界市', 2, '43', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1976, '430802', '永定区', 3, '4308', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1977, '430811', '武陵源区', 3, '4308', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1978, '430821', '慈利县', 3, '4308', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1979, '430822', '桑植县', 3, '4308', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1980, '4309', '益阳市', 2, '43', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1981, '430902', '资阳区', 3, '4309', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1982, '430903', '赫山区', 3, '4309', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1983, '430921', '南县', 3, '4309', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1984, '430922', '桃江县', 3, '4309', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1985, '430923', '安化县', 3, '4309', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1986, '430971', '益阳市大通湖管理区', 3, '4309', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1987, '430972', '湖南益阳高新技术产业园区', 3, '4309', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1988, '430981', '沅江市', 3, '4309', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1989, '4310', '郴州市', 2, '43', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1990, '431002', '北湖区', 3, '4310', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1991, '431003', '苏仙区', 3, '4310', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1992, '431021', '桂阳县', 3, '4310', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1993, '431022', '宜章县', 3, '4310', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1994, '431023', '永兴县', 3, '4310', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1995, '431024', '嘉禾县', 3, '4310', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1996, '431025', '临武县', 3, '4310', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1997, '431026', '汝城县', 3, '4310', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1998, '431027', '桂东县', 3, '4310', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(1999, '431028', '安仁县', 3, '4310', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2000, '431081', '资兴市', 3, '4310', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2001, '4311', '永州市', 2, '43', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2002, '431102', '零陵区', 3, '4311', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2003, '431103', '冷水滩区', 3, '4311', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2004, '431122', '东安县', 3, '4311', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2005, '431123', '双牌县', 3, '4311', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2006, '431124', '道县', 3, '4311', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2007, '431125', '江永县', 3, '4311', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2008, '431126', '宁远县', 3, '4311', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2009, '431127', '蓝山县', 3, '4311', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2010, '431128', '新田县', 3, '4311', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2011, '431129', '江华瑶族自治县', 3, '4311', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2012, '431171', '永州经济技术开发区', 3, '4311', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2013, '431173', '永州市回龙圩管理区', 3, '4311', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2014, '431181', '祁阳市', 3, '4311', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2015, '4312', '怀化市', 2, '43', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2016, '431202', '鹤城区', 3, '4312', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2017, '431221', '中方县', 3, '4312', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2018, '431222', '沅陵县', 3, '4312', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2019, '431223', '辰溪县', 3, '4312', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2020, '431224', '溆浦县', 3, '4312', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2021, '431225', '会同县', 3, '4312', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2022, '431226', '麻阳苗族自治县', 3, '4312', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2023, '431227', '新晃侗族自治县', 3, '4312', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2024, '431228', '芷江侗族自治县', 3, '4312', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2025, '431229', '靖州苗族侗族自治县', 3, '4312', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2026, '431230', '通道侗族自治县', 3, '4312', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2027, '431271', '怀化市洪江管理区', 3, '4312', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2028, '431281', '洪江市', 3, '4312', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2029, '4313', '娄底市', 2, '43', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2030, '431302', '娄星区', 3, '4313', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2031, '431321', '双峰县', 3, '4313', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2032, '431322', '新化县', 3, '4313', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2033, '431381', '冷水江市', 3, '4313', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2034, '431382', '涟源市', 3, '4313', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2035, '4331', '湘西土家族苗族自治州', 2, '43', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2036, '433101', '吉首市', 3, '4331', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2037, '433122', '泸溪县', 3, '4331', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2038, '433123', '凤凰县', 3, '4331', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2039, '433124', '花垣县', 3, '4331', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2040, '433125', '保靖县', 3, '4331', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2041, '433126', '古丈县', 3, '4331', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2042, '433127', '永顺县', 3, '4331', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2043, '433130', '龙山县', 3, '4331', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2044, '44', '广东省', 1, NULL, 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2045, '4401', '广州市', 2, '44', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2046, '440103', '荔湾区', 3, '4401', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2047, '440104', '越秀区', 3, '4401', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2048, '440105', '海珠区', 3, '4401', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2049, '440106', '天河区', 3, '4401', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2050, '440111', '白云区', 3, '4401', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2051, '440112', '黄埔区', 3, '4401', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2052, '440113', '番禺区', 3, '4401', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2053, '440114', '花都区', 3, '4401', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2054, '440115', '南沙区', 3, '4401', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2055, '440117', '从化区', 3, '4401', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2056, '440118', '增城区', 3, '4401', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2057, '4402', '韶关市', 2, '44', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2058, '440203', '武江区', 3, '4402', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2059, '440204', '浈江区', 3, '4402', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2060, '440205', '曲江区', 3, '4402', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2061, '440222', '始兴县', 3, '4402', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2062, '440224', '仁化县', 3, '4402', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2063, '440229', '翁源县', 3, '4402', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2064, '440232', '乳源瑶族自治县', 3, '4402', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2065, '440233', '新丰县', 3, '4402', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2066, '440281', '乐昌市', 3, '4402', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2067, '440282', '南雄市', 3, '4402', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2068, '4403', '深圳市', 2, '44', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2069, '440303', '罗湖区', 3, '4403', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2070, '440304', '福田区', 3, '4403', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2071, '440305', '南山区', 3, '4403', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2072, '440306', '宝安区', 3, '4403', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2073, '440307', '龙岗区', 3, '4403', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2074, '440308', '盐田区', 3, '4403', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2075, '440309', '龙华区', 3, '4403', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2076, '440310', '坪山区', 3, '4403', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2077, '440311', '光明区', 3, '4403', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2078, '4404', '珠海市', 2, '44', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2079, '440402', '香洲区', 3, '4404', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2080, '440403', '斗门区', 3, '4404', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2081, '440404', '金湾区', 3, '4404', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2082, '4405', '汕头市', 2, '44', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2083, '440507', '龙湖区', 3, '4405', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2084, '440511', '金平区', 3, '4405', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2085, '440512', '濠江区', 3, '4405', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2086, '440513', '潮阳区', 3, '4405', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2087, '440514', '潮南区', 3, '4405', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2088, '440515', '澄海区', 3, '4405', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2089, '440523', '南澳县', 3, '4405', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2090, '4406', '佛山市', 2, '44', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2091, '440604', '禅城区', 3, '4406', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2092, '440605', '南海区', 3, '4406', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2093, '440606', '顺德区', 3, '4406', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2094, '440607', '三水区', 3, '4406', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2095, '440608', '高明区', 3, '4406', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2096, '4407', '江门市', 2, '44', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2097, '440703', '蓬江区', 3, '4407', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2098, '440704', '江海区', 3, '4407', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2099, '440705', '新会区', 3, '4407', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2100, '440781', '台山市', 3, '4407', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2101, '440783', '开平市', 3, '4407', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2102, '440784', '鹤山市', 3, '4407', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2103, '440785', '恩平市', 3, '4407', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2104, '4408', '湛江市', 2, '44', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2105, '440802', '赤坎区', 3, '4408', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2106, '440803', '霞山区', 3, '4408', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2107, '440804', '坡头区', 3, '4408', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2108, '440811', '麻章区', 3, '4408', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2109, '440823', '遂溪县', 3, '4408', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2110, '440825', '徐闻县', 3, '4408', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2111, '440881', '廉江市', 3, '4408', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2112, '440882', '雷州市', 3, '4408', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2113, '440883', '吴川市', 3, '4408', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2114, '4409', '茂名市', 2, '44', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2115, '440902', '茂南区', 3, '4409', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2116, '440904', '电白区', 3, '4409', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2117, '440981', '高州市', 3, '4409', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2118, '440982', '化州市', 3, '4409', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2119, '440983', '信宜市', 3, '4409', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2120, '4412', '肇庆市', 2, '44', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2121, '441202', '端州区', 3, '4412', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2122, '441203', '鼎湖区', 3, '4412', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2123, '441204', '高要区', 3, '4412', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2124, '441223', '广宁县', 3, '4412', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2125, '441224', '怀集县', 3, '4412', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2126, '441225', '封开县', 3, '4412', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2127, '441226', '德庆县', 3, '4412', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2128, '441284', '四会市', 3, '4412', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2129, '4413', '惠州市', 2, '44', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2130, '441302', '惠城区', 3, '4413', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2131, '441303', '惠阳区', 3, '4413', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2132, '441322', '博罗县', 3, '4413', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2133, '441323', '惠东县', 3, '4413', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2134, '441324', '龙门县', 3, '4413', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2135, '4414', '梅州市', 2, '44', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2136, '441402', '梅江区', 3, '4414', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2137, '441403', '梅县区', 3, '4414', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2138, '441422', '大埔县', 3, '4414', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2139, '441423', '丰顺县', 3, '4414', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2140, '441424', '五华县', 3, '4414', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2141, '441426', '平远县', 3, '4414', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2142, '441427', '蕉岭县', 3, '4414', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2143, '441481', '兴宁市', 3, '4414', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2144, '4415', '汕尾市', 2, '44', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2145, '441502', '城区', 3, '4415', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2146, '441521', '海丰县', 3, '4415', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2147, '441523', '陆河县', 3, '4415', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2148, '441581', '陆丰市', 3, '4415', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2149, '4416', '河源市', 2, '44', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2150, '441602', '源城区', 3, '4416', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2151, '441621', '紫金县', 3, '4416', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2152, '441622', '龙川县', 3, '4416', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2153, '441623', '连平县', 3, '4416', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2154, '441624', '和平县', 3, '4416', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2155, '441625', '东源县', 3, '4416', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2156, '4417', '阳江市', 2, '44', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2157, '441702', '江城区', 3, '4417', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2158, '441704', '阳东区', 3, '4417', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2159, '441721', '阳西县', 3, '4417', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2160, '441781', '阳春市', 3, '4417', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2161, '4418', '清远市', 2, '44', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2162, '441802', '清城区', 3, '4418', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2163, '441803', '清新区', 3, '4418', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2164, '441821', '佛冈县', 3, '4418', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2165, '441823', '阳山县', 3, '4418', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2166, '441825', '连山壮族瑶族自治县', 3, '4418', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2167, '441826', '连南瑶族自治县', 3, '4418', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2168, '441881', '英德市', 3, '4418', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2169, '441882', '连州市', 3, '4418', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2170, '4419', '东莞市', 2, '44', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2171, '441900003', '东城街道', 3, '4419', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2172, '441900004', '南城街道', 3, '4419', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2173, '441900005', '万江街道', 3, '4419', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2174, '441900006', '莞城街道', 3, '4419', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2175, '441900101', '石碣镇', 3, '4419', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2176, '441900102', '石龙镇', 3, '4419', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2177, '441900103', '茶山镇', 3, '4419', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2178, '441900104', '石排镇', 3, '4419', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2179, '441900105', '企石镇', 3, '4419', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2180, '441900106', '横沥镇', 3, '4419', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2181, '441900107', '桥头镇', 3, '4419', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2182, '441900108', '谢岗镇', 3, '4419', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2183, '441900109', '东坑镇', 3, '4419', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2184, '441900110', '常平镇', 3, '4419', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2185, '441900111', '寮步镇', 3, '4419', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2186, '441900112', '樟木头镇', 3, '4419', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2187, '441900113', '大朗镇', 3, '4419', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2188, '441900114', '黄江镇', 3, '4419', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2189, '441900115', '清溪镇', 3, '4419', 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2190, '441900116', '塘厦镇', 3, '4419', 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2191, '441900117', '凤岗镇', 3, '4419', 21, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2192, '441900118', '大岭山镇', 3, '4419', 22, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2193, '441900119', '长安镇', 3, '4419', 23, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2194, '441900121', '虎门镇', 3, '4419', 24, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2195, '441900122', '厚街镇', 3, '4419', 25, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2196, '441900123', '沙田镇', 3, '4419', 26, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2197, '441900124', '道滘镇', 3, '4419', 27, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2198, '441900125', '洪梅镇', 3, '4419', 28, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2199, '441900126', '麻涌镇', 3, '4419', 29, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2200, '441900127', '望牛墩镇', 3, '4419', 30, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2201, '441900128', '中堂镇', 3, '4419', 31, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2202, '441900129', '高埗镇', 3, '4419', 32, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2203, '441900401', '松山湖', 3, '4419', 33, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2204, '441900402', '东莞港', 3, '4419', 34, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2205, '441900403', '东莞生态园', 3, '4419', 35, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2206, '441900404', '东莞滨海湾新区', 3, '4419', 36, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2207, '4420', '中山市', 2, '44', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2208, '442000001', '石岐街道', 3, '4420', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2209, '442000002', '东区街道', 3, '4420', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2210, '442000003', '中山港街道', 3, '4420', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2211, '442000004', '西区街道', 3, '4420', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2212, '442000005', '南区街道', 3, '4420', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2213, '442000006', '五桂山街道', 3, '4420', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2214, '442000007', '民众街道', 3, '4420', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2215, '442000008', '南朗街道', 3, '4420', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2216, '442000101', '黄圃镇', 3, '4420', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2217, '442000103', '东凤镇', 3, '4420', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2218, '442000105', '古镇镇', 3, '4420', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2219, '442000106', '沙溪镇', 3, '4420', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2220, '442000107', '坦洲镇', 3, '4420', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2221, '442000108', '港口镇', 3, '4420', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2222, '442000109', '三角镇', 3, '4420', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2223, '442000110', '横栏镇', 3, '4420', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2224, '442000111', '南头镇', 3, '4420', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2225, '442000112', '阜沙镇', 3, '4420', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2226, '442000114', '三乡镇', 3, '4420', 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2227, '442000115', '板芙镇', 3, '4420', 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2228, '442000116', '大涌镇', 3, '4420', 21, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2229, '442000117', '神湾镇', 3, '4420', 22, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2230, '442000118', '小榄镇', 3, '4420', 23, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2231, '4451', '潮州市', 2, '44', 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2232, '445102', '湘桥区', 3, '4451', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2233, '445103', '潮安区', 3, '4451', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2234, '445122', '饶平县', 3, '4451', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2235, '4452', '揭阳市', 2, '44', 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2236, '445202', '榕城区', 3, '4452', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2237, '445203', '揭东区', 3, '4452', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2238, '445222', '揭西县', 3, '4452', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2239, '445224', '惠来县', 3, '4452', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2240, '445281', '普宁市', 3, '4452', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2241, '4453', '云浮市', 2, '44', 21, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2242, '445302', '云城区', 3, '4453', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2243, '445303', '云安区', 3, '4453', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2244, '445321', '新兴县', 3, '4453', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2245, '445322', '郁南县', 3, '4453', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2246, '445381', '罗定市', 3, '4453', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2247, '45', '广西壮族自治区', 1, NULL, 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2248, '4501', '南宁市', 2, '45', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2249, '450102', '兴宁区', 3, '4501', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2250, '450103', '青秀区', 3, '4501', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2251, '450105', '江南区', 3, '4501', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2252, '450107', '西乡塘区', 3, '4501', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2253, '450108', '良庆区', 3, '4501', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2254, '450109', '邕宁区', 3, '4501', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2255, '450110', '武鸣区', 3, '4501', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2256, '450123', '隆安县', 3, '4501', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2257, '450124', '马山县', 3, '4501', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2258, '450125', '上林县', 3, '4501', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2259, '450126', '宾阳县', 3, '4501', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2260, '450181', '横州市', 3, '4501', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2261, '4502', '柳州市', 2, '45', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2262, '450202', '城中区', 3, '4502', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2263, '450203', '鱼峰区', 3, '4502', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2264, '450204', '柳南区', 3, '4502', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2265, '450205', '柳北区', 3, '4502', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2266, '450206', '柳江区', 3, '4502', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2267, '450222', '柳城县', 3, '4502', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2268, '450223', '鹿寨县', 3, '4502', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2269, '450224', '融安县', 3, '4502', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2270, '450225', '融水苗族自治县', 3, '4502', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2271, '450226', '三江侗族自治县', 3, '4502', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2272, '4503', '桂林市', 2, '45', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2273, '450302', '秀峰区', 3, '4503', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2274, '450303', '叠彩区', 3, '4503', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2275, '450304', '象山区', 3, '4503', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2276, '450305', '七星区', 3, '4503', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2277, '450311', '雁山区', 3, '4503', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2278, '450312', '临桂区', 3, '4503', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2279, '450321', '阳朔县', 3, '4503', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2280, '450323', '灵川县', 3, '4503', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2281, '450324', '全州县', 3, '4503', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2282, '450325', '兴安县', 3, '4503', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2283, '450326', '永福县', 3, '4503', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2284, '450327', '灌阳县', 3, '4503', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2285, '450328', '龙胜各族自治县', 3, '4503', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2286, '450329', '资源县', 3, '4503', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2287, '450330', '平乐县', 3, '4503', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2288, '450332', '恭城瑶族自治县', 3, '4503', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2289, '450381', '荔浦市', 3, '4503', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2290, '4504', '梧州市', 2, '45', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2291, '450403', '万秀区', 3, '4504', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2292, '450405', '长洲区', 3, '4504', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2293, '450406', '龙圩区', 3, '4504', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2294, '450421', '苍梧县', 3, '4504', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2295, '450422', '藤县', 3, '4504', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2296, '450423', '蒙山县', 3, '4504', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2297, '450481', '岑溪市', 3, '4504', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2298, '4505', '北海市', 2, '45', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2299, '450502', '海城区', 3, '4505', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2300, '450503', '银海区', 3, '4505', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2301, '450512', '铁山港区', 3, '4505', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2302, '450521', '合浦县', 3, '4505', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2303, '4506', '防城港市', 2, '45', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2304, '450602', '港口区', 3, '4506', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2305, '450603', '防城区', 3, '4506', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2306, '450621', '上思县', 3, '4506', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2307, '450681', '东兴市', 3, '4506', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2308, '4507', '钦州市', 2, '45', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2309, '450702', '钦南区', 3, '4507', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2310, '450703', '钦北区', 3, '4507', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2311, '450721', '灵山县', 3, '4507', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2312, '450722', '浦北县', 3, '4507', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2313, '4508', '贵港市', 2, '45', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2314, '450802', '港北区', 3, '4508', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2315, '450803', '港南区', 3, '4508', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2316, '450804', '覃塘区', 3, '4508', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2317, '450821', '平南县', 3, '4508', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2318, '450881', '桂平市', 3, '4508', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2319, '4509', '玉林市', 2, '45', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2320, '450902', '玉州区', 3, '4509', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58');
INSERT INTO `china_region` (`id`, `code`, `name`, `level`, `parent_code`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(2321, '450903', '福绵区', 3, '4509', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2322, '450921', '容县', 3, '4509', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2323, '450922', '陆川县', 3, '4509', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2324, '450923', '博白县', 3, '4509', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2325, '450924', '兴业县', 3, '4509', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2326, '450981', '北流市', 3, '4509', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2327, '4510', '百色市', 2, '45', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2328, '451002', '右江区', 3, '4510', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2329, '451003', '田阳区', 3, '4510', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2330, '451022', '田东县', 3, '4510', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2331, '451024', '德保县', 3, '4510', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2332, '451026', '那坡县', 3, '4510', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2333, '451027', '凌云县', 3, '4510', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2334, '451028', '乐业县', 3, '4510', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2335, '451029', '田林县', 3, '4510', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2336, '451030', '西林县', 3, '4510', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2337, '451031', '隆林各族自治县', 3, '4510', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2338, '451081', '靖西市', 3, '4510', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2339, '451082', '平果市', 3, '4510', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2340, '4511', '贺州市', 2, '45', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2341, '451102', '八步区', 3, '4511', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2342, '451103', '平桂区', 3, '4511', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2343, '451121', '昭平县', 3, '4511', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2344, '451122', '钟山县', 3, '4511', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2345, '451123', '富川瑶族自治县', 3, '4511', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2346, '4512', '河池市', 2, '45', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2347, '451202', '金城江区', 3, '4512', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2348, '451203', '宜州区', 3, '4512', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2349, '451221', '南丹县', 3, '4512', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2350, '451222', '天峨县', 3, '4512', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2351, '451223', '凤山县', 3, '4512', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2352, '451224', '东兰县', 3, '4512', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2353, '451225', '罗城仫佬族自治县', 3, '4512', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2354, '451226', '环江毛南族自治县', 3, '4512', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2355, '451227', '巴马瑶族自治县', 3, '4512', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2356, '451228', '都安瑶族自治县', 3, '4512', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2357, '451229', '大化瑶族自治县', 3, '4512', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2358, '4513', '来宾市', 2, '45', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2359, '451302', '兴宾区', 3, '4513', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2360, '451321', '忻城县', 3, '4513', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2361, '451322', '象州县', 3, '4513', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2362, '451323', '武宣县', 3, '4513', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2363, '451324', '金秀瑶族自治县', 3, '4513', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2364, '451381', '合山市', 3, '4513', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2365, '4514', '崇左市', 2, '45', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2366, '451402', '江州区', 3, '4514', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2367, '451421', '扶绥县', 3, '4514', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2368, '451422', '宁明县', 3, '4514', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2369, '451423', '龙州县', 3, '4514', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2370, '451424', '大新县', 3, '4514', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2371, '451425', '天等县', 3, '4514', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2372, '451481', '凭祥市', 3, '4514', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2373, '46', '海南省', 1, NULL, 21, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2374, '4601', '海口市', 2, '46', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2375, '460105', '秀英区', 3, '4601', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2376, '460106', '龙华区', 3, '4601', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2377, '460107', '琼山区', 3, '4601', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2378, '460108', '美兰区', 3, '4601', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2379, '4602', '三亚市', 2, '46', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2380, '460202', '海棠区', 3, '4602', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2381, '460203', '吉阳区', 3, '4602', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2382, '460204', '天涯区', 3, '4602', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2383, '460205', '崖州区', 3, '4602', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2384, '4603', '三沙市', 2, '46', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2385, '460321', '西沙群岛', 3, '4603', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2386, '460322', '南沙群岛', 3, '4603', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2387, '460323', '中沙群岛的岛礁及其海域', 3, '4603', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2388, '4604', '儋州市', 2, '46', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2389, '460400100', '那大镇', 3, '4604', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2390, '460400101', '和庆镇', 3, '4604', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2391, '460400102', '南丰镇', 3, '4604', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2392, '460400103', '大成镇', 3, '4604', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2393, '460400104', '雅星镇', 3, '4604', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2394, '460400105', '兰洋镇', 3, '4604', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2395, '460400106', '光村镇', 3, '4604', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2396, '460400107', '木棠镇', 3, '4604', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2397, '460400108', '海头镇', 3, '4604', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2398, '460400109', '峨蔓镇', 3, '4604', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2399, '460400111', '王五镇', 3, '4604', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2400, '460400112', '白马井镇', 3, '4604', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2401, '460400113', '中和镇', 3, '4604', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2402, '460400114', '排浦镇', 3, '4604', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2403, '460400115', '东成镇', 3, '4604', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2404, '460400116', '新州镇', 3, '4604', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2405, '460400499', '洋浦经济开发区', 3, '4604', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2406, '460400500', '华南热作学院', 3, '4604', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2407, '4690', '省直辖县级行政区划', 2, '46', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2408, '469001', '五指山市', 3, '4690', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2409, '469002', '琼海市', 3, '4690', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2410, '469005', '文昌市', 3, '4690', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2411, '469006', '万宁市', 3, '4690', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2412, '469007', '东方市', 3, '4690', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2413, '469021', '定安县', 3, '4690', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2414, '469022', '屯昌县', 3, '4690', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2415, '469023', '澄迈县', 3, '4690', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2416, '469024', '临高县', 3, '4690', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2417, '469025', '白沙黎族自治县', 3, '4690', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2418, '469026', '昌江黎族自治县', 3, '4690', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2419, '469027', '乐东黎族自治县', 3, '4690', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2420, '469028', '陵水黎族自治县', 3, '4690', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2421, '469029', '保亭黎族苗族自治县', 3, '4690', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2422, '469030', '琼中黎族苗族自治县', 3, '4690', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2423, '50', '重庆市', 1, NULL, 22, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2424, '5001', '市辖区', 2, '50', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2425, '500101', '万州区', 3, '5001', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2426, '500102', '涪陵区', 3, '5001', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2427, '500103', '渝中区', 3, '5001', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2428, '500104', '大渡口区', 3, '5001', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2429, '500105', '江北区', 3, '5001', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2430, '500106', '沙坪坝区', 3, '5001', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2431, '500107', '九龙坡区', 3, '5001', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2432, '500108', '南岸区', 3, '5001', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2433, '500109', '北碚区', 3, '5001', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2434, '500110', '綦江区', 3, '5001', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2435, '500111', '大足区', 3, '5001', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2436, '500112', '渝北区', 3, '5001', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2437, '500113', '巴南区', 3, '5001', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2438, '500114', '黔江区', 3, '5001', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2439, '500115', '长寿区', 3, '5001', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2440, '500116', '江津区', 3, '5001', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2441, '500117', '合川区', 3, '5001', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2442, '500118', '永川区', 3, '5001', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2443, '500119', '南川区', 3, '5001', 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2444, '500120', '璧山区', 3, '5001', 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2445, '500151', '铜梁区', 3, '5001', 21, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2446, '500152', '潼南区', 3, '5001', 22, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2447, '500153', '荣昌区', 3, '5001', 23, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2448, '500154', '开州区', 3, '5001', 24, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2449, '500155', '梁平区', 3, '5001', 25, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2450, '500156', '武隆区', 3, '5001', 26, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2451, '5002', '县', 2, '50', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2452, '500229', '城口县', 3, '5002', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2453, '500230', '丰都县', 3, '5002', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2454, '500231', '垫江县', 3, '5002', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2455, '500233', '忠县', 3, '5002', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2456, '500235', '云阳县', 3, '5002', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2457, '500236', '奉节县', 3, '5002', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2458, '500237', '巫山县', 3, '5002', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2459, '500238', '巫溪县', 3, '5002', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2460, '500240', '石柱土家族自治县', 3, '5002', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2461, '500241', '秀山土家族苗族自治县', 3, '5002', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2462, '500242', '酉阳土家族苗族自治县', 3, '5002', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2463, '500243', '彭水苗族土家族自治县', 3, '5002', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2464, '51', '四川省', 1, NULL, 23, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2465, '5101', '成都市', 2, '51', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2466, '510104', '锦江区', 3, '5101', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2467, '510105', '青羊区', 3, '5101', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2468, '510106', '金牛区', 3, '5101', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2469, '510107', '武侯区', 3, '5101', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2470, '510108', '成华区', 3, '5101', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2471, '510112', '龙泉驿区', 3, '5101', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2472, '510113', '青白江区', 3, '5101', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2473, '510114', '新都区', 3, '5101', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2474, '510115', '温江区', 3, '5101', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2475, '510116', '双流区', 3, '5101', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2476, '510117', '郫都区', 3, '5101', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2477, '510118', '新津区', 3, '5101', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2478, '510121', '金堂县', 3, '5101', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2479, '510129', '大邑县', 3, '5101', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2480, '510131', '蒲江县', 3, '5101', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2481, '510181', '都江堰市', 3, '5101', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2482, '510182', '彭州市', 3, '5101', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2483, '510183', '邛崃市', 3, '5101', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2484, '510184', '崇州市', 3, '5101', 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2485, '510185', '简阳市', 3, '5101', 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2486, '5103', '自贡市', 2, '51', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2487, '510302', '自流井区', 3, '5103', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2488, '510303', '贡井区', 3, '5103', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2489, '510304', '大安区', 3, '5103', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2490, '510311', '沿滩区', 3, '5103', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2491, '510321', '荣县', 3, '5103', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2492, '510322', '富顺县', 3, '5103', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2493, '5104', '攀枝花市', 2, '51', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2494, '510402', '东区', 3, '5104', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2495, '510403', '西区', 3, '5104', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2496, '510411', '仁和区', 3, '5104', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2497, '510421', '米易县', 3, '5104', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2498, '510422', '盐边县', 3, '5104', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2499, '5105', '泸州市', 2, '51', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2500, '510502', '江阳区', 3, '5105', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2501, '510503', '纳溪区', 3, '5105', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2502, '510504', '龙马潭区', 3, '5105', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2503, '510521', '泸县', 3, '5105', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2504, '510522', '合江县', 3, '5105', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2505, '510524', '叙永县', 3, '5105', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2506, '510525', '古蔺县', 3, '5105', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2507, '5106', '德阳市', 2, '51', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2508, '510603', '旌阳区', 3, '5106', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2509, '510604', '罗江区', 3, '5106', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2510, '510623', '中江县', 3, '5106', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2511, '510681', '广汉市', 3, '5106', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2512, '510682', '什邡市', 3, '5106', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2513, '510683', '绵竹市', 3, '5106', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2514, '5107', '绵阳市', 2, '51', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2515, '510703', '涪城区', 3, '5107', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2516, '510704', '游仙区', 3, '5107', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2517, '510705', '安州区', 3, '5107', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2518, '510722', '三台县', 3, '5107', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2519, '510723', '盐亭县', 3, '5107', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2520, '510725', '梓潼县', 3, '5107', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2521, '510726', '北川羌族自治县', 3, '5107', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2522, '510727', '平武县', 3, '5107', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2523, '510781', '江油市', 3, '5107', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2524, '5108', '广元市', 2, '51', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2525, '510802', '利州区', 3, '5108', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2526, '510811', '昭化区', 3, '5108', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2527, '510812', '朝天区', 3, '5108', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2528, '510821', '旺苍县', 3, '5108', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2529, '510822', '青川县', 3, '5108', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2530, '510823', '剑阁县', 3, '5108', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2531, '510824', '苍溪县', 3, '5108', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2532, '5109', '遂宁市', 2, '51', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2533, '510903', '船山区', 3, '5109', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2534, '510904', '安居区', 3, '5109', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2535, '510921', '蓬溪县', 3, '5109', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2536, '510923', '大英县', 3, '5109', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2537, '510981', '射洪市', 3, '5109', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2538, '5110', '内江市', 2, '51', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2539, '511002', '市中区', 3, '5110', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2540, '511011', '东兴区', 3, '5110', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2541, '511024', '威远县', 3, '5110', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2542, '511025', '资中县', 3, '5110', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2543, '511083', '隆昌市', 3, '5110', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2544, '5111', '乐山市', 2, '51', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2545, '511102', '市中区', 3, '5111', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2546, '511111', '沙湾区', 3, '5111', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2547, '511112', '五通桥区', 3, '5111', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2548, '511113', '金口河区', 3, '5111', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2549, '511123', '犍为县', 3, '5111', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2550, '511124', '井研县', 3, '5111', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2551, '511126', '夹江县', 3, '5111', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2552, '511129', '沐川县', 3, '5111', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2553, '511132', '峨边彝族自治县', 3, '5111', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2554, '511133', '马边彝族自治县', 3, '5111', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2555, '511181', '峨眉山市', 3, '5111', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2556, '5113', '南充市', 2, '51', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2557, '511302', '顺庆区', 3, '5113', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2558, '511303', '高坪区', 3, '5113', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2559, '511304', '嘉陵区', 3, '5113', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2560, '511321', '南部县', 3, '5113', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2561, '511322', '营山县', 3, '5113', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2562, '511323', '蓬安县', 3, '5113', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2563, '511324', '仪陇县', 3, '5113', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2564, '511325', '西充县', 3, '5113', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2565, '511381', '阆中市', 3, '5113', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2566, '5114', '眉山市', 2, '51', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2567, '511402', '东坡区', 3, '5114', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2568, '511403', '彭山区', 3, '5114', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2569, '511421', '仁寿县', 3, '5114', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2570, '511423', '洪雅县', 3, '5114', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2571, '511424', '丹棱县', 3, '5114', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2572, '511425', '青神县', 3, '5114', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2573, '5115', '宜宾市', 2, '51', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2574, '511502', '翠屏区', 3, '5115', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2575, '511503', '南溪区', 3, '5115', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2576, '511504', '叙州区', 3, '5115', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2577, '511523', '江安县', 3, '5115', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2578, '511524', '长宁县', 3, '5115', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2579, '511525', '高县', 3, '5115', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2580, '511526', '珙县', 3, '5115', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2581, '511527', '筠连县', 3, '5115', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2582, '511528', '兴文县', 3, '5115', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2583, '511529', '屏山县', 3, '5115', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2584, '5116', '广安市', 2, '51', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2585, '511602', '广安区', 3, '5116', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2586, '511603', '前锋区', 3, '5116', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2587, '511621', '岳池县', 3, '5116', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2588, '511622', '武胜县', 3, '5116', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2589, '511623', '邻水县', 3, '5116', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2590, '511681', '华蓥市', 3, '5116', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2591, '5117', '达州市', 2, '51', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2592, '511702', '通川区', 3, '5117', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2593, '511703', '达川区', 3, '5117', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2594, '511722', '宣汉县', 3, '5117', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2595, '511723', '开江县', 3, '5117', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2596, '511724', '大竹县', 3, '5117', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2597, '511725', '渠县', 3, '5117', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2598, '511781', '万源市', 3, '5117', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2599, '5118', '雅安市', 2, '51', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2600, '511802', '雨城区', 3, '5118', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2601, '511803', '名山区', 3, '5118', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2602, '511822', '荥经县', 3, '5118', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2603, '511823', '汉源县', 3, '5118', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2604, '511824', '石棉县', 3, '5118', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2605, '511825', '天全县', 3, '5118', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2606, '511826', '芦山县', 3, '5118', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2607, '511827', '宝兴县', 3, '5118', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2608, '5119', '巴中市', 2, '51', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2609, '511902', '巴州区', 3, '5119', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2610, '511903', '恩阳区', 3, '5119', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2611, '511921', '通江县', 3, '5119', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2612, '511922', '南江县', 3, '5119', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2613, '511923', '平昌县', 3, '5119', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2614, '5120', '资阳市', 2, '51', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2615, '512002', '雁江区', 3, '5120', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2616, '512021', '安岳县', 3, '5120', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2617, '512022', '乐至县', 3, '5120', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2618, '5132', '阿坝藏族羌族自治州', 2, '51', 19, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2619, '513201', '马尔康市', 3, '5132', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2620, '513221', '汶川县', 3, '5132', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2621, '513222', '理县', 3, '5132', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2622, '513223', '茂县', 3, '5132', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2623, '513224', '松潘县', 3, '5132', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2624, '513225', '九寨沟县', 3, '5132', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2625, '513226', '金川县', 3, '5132', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2626, '513227', '小金县', 3, '5132', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2627, '513228', '黑水县', 3, '5132', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2628, '513230', '壤塘县', 3, '5132', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2629, '513231', '阿坝县', 3, '5132', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2630, '513232', '若尔盖县', 3, '5132', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2631, '513233', '红原县', 3, '5132', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2632, '5133', '甘孜藏族自治州', 2, '51', 20, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2633, '513301', '康定市', 3, '5133', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2634, '513322', '泸定县', 3, '5133', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2635, '513323', '丹巴县', 3, '5133', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2636, '513324', '九龙县', 3, '5133', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2637, '513325', '雅江县', 3, '5133', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2638, '513326', '道孚县', 3, '5133', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2639, '513327', '炉霍县', 3, '5133', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2640, '513328', '甘孜县', 3, '5133', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2641, '513329', '新龙县', 3, '5133', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2642, '513330', '德格县', 3, '5133', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2643, '513331', '白玉县', 3, '5133', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2644, '513332', '石渠县', 3, '5133', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2645, '513333', '色达县', 3, '5133', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2646, '513334', '理塘县', 3, '5133', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2647, '513335', '巴塘县', 3, '5133', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2648, '513336', '乡城县', 3, '5133', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2649, '513337', '稻城县', 3, '5133', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2650, '513338', '得荣县', 3, '5133', 18, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2651, '5134', '凉山彝族自治州', 2, '51', 21, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2652, '513401', '西昌市', 3, '5134', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2653, '513402', '会理市', 3, '5134', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2654, '513422', '木里藏族自治县', 3, '5134', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2655, '513423', '盐源县', 3, '5134', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2656, '513424', '德昌县', 3, '5134', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2657, '513426', '会东县', 3, '5134', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2658, '513427', '宁南县', 3, '5134', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2659, '513428', '普格县', 3, '5134', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2660, '513429', '布拖县', 3, '5134', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2661, '513430', '金阳县', 3, '5134', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2662, '513431', '昭觉县', 3, '5134', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2663, '513432', '喜德县', 3, '5134', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2664, '513433', '冕宁县', 3, '5134', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2665, '513434', '越西县', 3, '5134', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2666, '513435', '甘洛县', 3, '5134', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2667, '513436', '美姑县', 3, '5134', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2668, '513437', '雷波县', 3, '5134', 17, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2669, '52', '贵州省', 1, NULL, 24, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2670, '5201', '贵阳市', 2, '52', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2671, '520102', '南明区', 3, '5201', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2672, '520103', '云岩区', 3, '5201', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2673, '520111', '花溪区', 3, '5201', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2674, '520112', '乌当区', 3, '5201', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2675, '520113', '白云区', 3, '5201', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2676, '520115', '观山湖区', 3, '5201', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2677, '520121', '开阳县', 3, '5201', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2678, '520122', '息烽县', 3, '5201', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2679, '520123', '修文县', 3, '5201', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2680, '520181', '清镇市', 3, '5201', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2681, '5202', '六盘水市', 2, '52', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2682, '520201', '钟山区', 3, '5202', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2683, '520203', '六枝特区', 3, '5202', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2684, '520204', '水城区', 3, '5202', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2685, '520281', '盘州市', 3, '5202', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2686, '5203', '遵义市', 2, '52', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2687, '520302', '红花岗区', 3, '5203', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2688, '520303', '汇川区', 3, '5203', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2689, '520304', '播州区', 3, '5203', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2690, '520322', '桐梓县', 3, '5203', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2691, '520323', '绥阳县', 3, '5203', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2692, '520324', '正安县', 3, '5203', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2693, '520325', '道真仡佬族苗族自治县', 3, '5203', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2694, '520326', '务川仡佬族苗族自治县', 3, '5203', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2695, '520327', '凤冈县', 3, '5203', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2696, '520328', '湄潭县', 3, '5203', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2697, '520329', '余庆县', 3, '5203', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2698, '520330', '习水县', 3, '5203', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2699, '520381', '赤水市', 3, '5203', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2700, '520382', '仁怀市', 3, '5203', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2701, '5204', '安顺市', 2, '52', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2702, '520402', '西秀区', 3, '5204', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2703, '520403', '平坝区', 3, '5204', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2704, '520422', '普定县', 3, '5204', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2705, '520423', '镇宁布依族苗族自治县', 3, '5204', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2706, '520424', '关岭布依族苗族自治县', 3, '5204', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2707, '520425', '紫云苗族布依族自治县', 3, '5204', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2708, '5205', '毕节市', 2, '52', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2709, '520502', '七星关区', 3, '5205', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2710, '520521', '大方县', 3, '5205', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2711, '520523', '金沙县', 3, '5205', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2712, '520524', '织金县', 3, '5205', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2713, '520525', '纳雍县', 3, '5205', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2714, '520526', '威宁彝族回族苗族自治县', 3, '5205', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2715, '520527', '赫章县', 3, '5205', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2716, '520581', '黔西市', 3, '5205', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2717, '5206', '铜仁市', 2, '52', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2718, '520602', '碧江区', 3, '5206', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2719, '520603', '万山区', 3, '5206', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2720, '520621', '江口县', 3, '5206', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2721, '520622', '玉屏侗族自治县', 3, '5206', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2722, '520623', '石阡县', 3, '5206', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2723, '520624', '思南县', 3, '5206', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2724, '520625', '印江土家族苗族自治县', 3, '5206', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2725, '520626', '德江县', 3, '5206', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2726, '520627', '沿河土家族自治县', 3, '5206', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2727, '520628', '松桃苗族自治县', 3, '5206', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2728, '5223', '黔西南布依族苗族自治州', 2, '52', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2729, '522301', '兴义市', 3, '5223', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2730, '522302', '兴仁市', 3, '5223', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2731, '522323', '普安县', 3, '5223', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2732, '522324', '晴隆县', 3, '5223', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2733, '522325', '贞丰县', 3, '5223', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2734, '522326', '望谟县', 3, '5223', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2735, '522327', '册亨县', 3, '5223', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2736, '522328', '安龙县', 3, '5223', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2737, '5226', '黔东南苗族侗族自治州', 2, '52', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2738, '522601', '凯里市', 3, '5226', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2739, '522622', '黄平县', 3, '5226', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2740, '522623', '施秉县', 3, '5226', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2741, '522624', '三穗县', 3, '5226', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2742, '522625', '镇远县', 3, '5226', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2743, '522626', '岑巩县', 3, '5226', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2744, '522627', '天柱县', 3, '5226', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2745, '522628', '锦屏县', 3, '5226', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2746, '522629', '剑河县', 3, '5226', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2747, '522630', '台江县', 3, '5226', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2748, '522631', '黎平县', 3, '5226', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2749, '522632', '榕江县', 3, '5226', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2750, '522633', '从江县', 3, '5226', 13, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2751, '522634', '雷山县', 3, '5226', 14, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2752, '522635', '麻江县', 3, '5226', 15, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2753, '522636', '丹寨县', 3, '5226', 16, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2754, '5227', '黔南布依族苗族自治州', 2, '52', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2755, '522701', '都匀市', 3, '5227', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2756, '522702', '福泉市', 3, '5227', 2, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2757, '522722', '荔波县', 3, '5227', 3, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2758, '522723', '贵定县', 3, '5227', 4, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2759, '522725', '瓮安县', 3, '5227', 5, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2760, '522726', '独山县', 3, '5227', 6, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2761, '522727', '平塘县', 3, '5227', 7, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2762, '522728', '罗甸县', 3, '5227', 8, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2763, '522729', '长顺县', 3, '5227', 9, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2764, '522730', '龙里县', 3, '5227', 10, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2765, '522731', '惠水县', 3, '5227', 11, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2766, '522732', '三都水族自治县', 3, '5227', 12, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2767, '53', '云南省', 1, NULL, 25, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2768, '5301', '昆明市', 2, '53', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2769, '530102', '五华区', 3, '5301', 1, 1, '2025-10-02 02:34:58', '2025-10-02 02:34:58'),
(2770, '530103', '盘龙区', 3, '5301', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2771, '530111', '官渡区', 3, '5301', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2772, '530112', '西山区', 3, '5301', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2773, '530113', '东川区', 3, '5301', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2774, '530114', '呈贡区', 3, '5301', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2775, '530115', '晋宁区', 3, '5301', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2776, '530124', '富民县', 3, '5301', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2777, '530125', '宜良县', 3, '5301', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2778, '530126', '石林彝族自治县', 3, '5301', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2779, '530127', '嵩明县', 3, '5301', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2780, '530128', '禄劝彝族苗族自治县', 3, '5301', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2781, '530129', '寻甸回族彝族自治县', 3, '5301', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2782, '530181', '安宁市', 3, '5301', 14, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2783, '5303', '曲靖市', 2, '53', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2784, '530302', '麒麟区', 3, '5303', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2785, '530303', '沾益区', 3, '5303', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2786, '530304', '马龙区', 3, '5303', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2787, '530322', '陆良县', 3, '5303', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2788, '530323', '师宗县', 3, '5303', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2789, '530324', '罗平县', 3, '5303', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2790, '530325', '富源县', 3, '5303', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2791, '530326', '会泽县', 3, '5303', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2792, '530381', '宣威市', 3, '5303', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2793, '5304', '玉溪市', 2, '53', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2794, '530402', '红塔区', 3, '5304', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2795, '530403', '江川区', 3, '5304', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2796, '530423', '通海县', 3, '5304', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2797, '530424', '华宁县', 3, '5304', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2798, '530425', '易门县', 3, '5304', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2799, '530426', '峨山彝族自治县', 3, '5304', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2800, '530427', '新平彝族傣族自治县', 3, '5304', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2801, '530428', '元江哈尼族彝族傣族自治县', 3, '5304', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2802, '530481', '澄江市', 3, '5304', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2803, '5305', '保山市', 2, '53', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2804, '530502', '隆阳区', 3, '5305', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2805, '530521', '施甸县', 3, '5305', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2806, '530523', '龙陵县', 3, '5305', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2807, '530524', '昌宁县', 3, '5305', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2808, '530581', '腾冲市', 3, '5305', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2809, '5306', '昭通市', 2, '53', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2810, '530602', '昭阳区', 3, '5306', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2811, '530621', '鲁甸县', 3, '5306', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2812, '530622', '巧家县', 3, '5306', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2813, '530623', '盐津县', 3, '5306', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2814, '530624', '大关县', 3, '5306', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2815, '530625', '永善县', 3, '5306', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2816, '530626', '绥江县', 3, '5306', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2817, '530627', '镇雄县', 3, '5306', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2818, '530628', '彝良县', 3, '5306', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2819, '530629', '威信县', 3, '5306', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2820, '530681', '水富市', 3, '5306', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2821, '5307', '丽江市', 2, '53', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2822, '530702', '古城区', 3, '5307', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2823, '530721', '玉龙纳西族自治县', 3, '5307', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2824, '530722', '永胜县', 3, '5307', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2825, '530723', '华坪县', 3, '5307', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2826, '530724', '宁蒗彝族自治县', 3, '5307', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2827, '5308', '普洱市', 2, '53', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2828, '530802', '思茅区', 3, '5308', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2829, '530821', '宁洱哈尼族彝族自治县', 3, '5308', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2830, '530822', '墨江哈尼族自治县', 3, '5308', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2831, '530823', '景东彝族自治县', 3, '5308', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2832, '530824', '景谷傣族彝族自治县', 3, '5308', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2833, '530825', '镇沅彝族哈尼族拉祜族自治县', 3, '5308', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2834, '530826', '江城哈尼族彝族自治县', 3, '5308', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2835, '530827', '孟连傣族拉祜族佤族自治县', 3, '5308', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2836, '530828', '澜沧拉祜族自治县', 3, '5308', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2837, '530829', '西盟佤族自治县', 3, '5308', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2838, '5309', '临沧市', 2, '53', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2839, '530902', '临翔区', 3, '5309', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2840, '530921', '凤庆县', 3, '5309', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2841, '530922', '云县', 3, '5309', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2842, '530923', '永德县', 3, '5309', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2843, '530924', '镇康县', 3, '5309', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2844, '530925', '双江拉祜族佤族布朗族傣族自治县', 3, '5309', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2845, '530926', '耿马傣族佤族自治县', 3, '5309', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2846, '530927', '沧源佤族自治县', 3, '5309', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2847, '5323', '楚雄彝族自治州', 2, '53', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2848, '532301', '楚雄市', 3, '5323', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2849, '532302', '禄丰市', 3, '5323', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2850, '532322', '双柏县', 3, '5323', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2851, '532323', '牟定县', 3, '5323', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2852, '532324', '南华县', 3, '5323', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2853, '532325', '姚安县', 3, '5323', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2854, '532326', '大姚县', 3, '5323', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2855, '532327', '永仁县', 3, '5323', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2856, '532328', '元谋县', 3, '5323', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2857, '532329', '武定县', 3, '5323', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2858, '5325', '红河哈尼族彝族自治州', 2, '53', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2859, '532501', '个旧市', 3, '5325', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2860, '532502', '开远市', 3, '5325', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2861, '532503', '蒙自市', 3, '5325', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2862, '532504', '弥勒市', 3, '5325', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2863, '532523', '屏边苗族自治县', 3, '5325', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2864, '532524', '建水县', 3, '5325', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2865, '532525', '石屏县', 3, '5325', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2866, '532527', '泸西县', 3, '5325', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2867, '532528', '元阳县', 3, '5325', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2868, '532529', '红河县', 3, '5325', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2869, '532530', '金平苗族瑶族傣族自治县', 3, '5325', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2870, '532531', '绿春县', 3, '5325', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2871, '532532', '河口瑶族自治县', 3, '5325', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2872, '5326', '文山壮族苗族自治州', 2, '53', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2873, '532601', '文山市', 3, '5326', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2874, '532622', '砚山县', 3, '5326', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2875, '532623', '西畴县', 3, '5326', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2876, '532624', '麻栗坡县', 3, '5326', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2877, '532625', '马关县', 3, '5326', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2878, '532626', '丘北县', 3, '5326', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2879, '532627', '广南县', 3, '5326', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2880, '532628', '富宁县', 3, '5326', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2881, '5328', '西双版纳傣族自治州', 2, '53', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2882, '532801', '景洪市', 3, '5328', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2883, '532822', '勐海县', 3, '5328', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2884, '532823', '勐腊县', 3, '5328', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2885, '5329', '大理白族自治州', 2, '53', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2886, '532901', '大理市', 3, '5329', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2887, '532922', '漾濞彝族自治县', 3, '5329', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2888, '532923', '祥云县', 3, '5329', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2889, '532924', '宾川县', 3, '5329', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2890, '532925', '弥渡县', 3, '5329', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2891, '532926', '南涧彝族自治县', 3, '5329', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2892, '532927', '巍山彝族回族自治县', 3, '5329', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2893, '532928', '永平县', 3, '5329', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2894, '532929', '云龙县', 3, '5329', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2895, '532930', '洱源县', 3, '5329', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59');
INSERT INTO `china_region` (`id`, `code`, `name`, `level`, `parent_code`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(2896, '532931', '剑川县', 3, '5329', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2897, '532932', '鹤庆县', 3, '5329', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2898, '5331', '德宏傣族景颇族自治州', 2, '53', 14, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2899, '533102', '瑞丽市', 3, '5331', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2900, '533103', '芒市', 3, '5331', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2901, '533122', '梁河县', 3, '5331', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2902, '533123', '盈江县', 3, '5331', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2903, '533124', '陇川县', 3, '5331', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2904, '5333', '怒江傈僳族自治州', 2, '53', 15, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2905, '533301', '泸水市', 3, '5333', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2906, '533323', '福贡县', 3, '5333', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2907, '533324', '贡山独龙族怒族自治县', 3, '5333', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2908, '533325', '兰坪白族普米族自治县', 3, '5333', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2909, '5334', '迪庆藏族自治州', 2, '53', 16, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2910, '533401', '香格里拉市', 3, '5334', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2911, '533422', '德钦县', 3, '5334', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2912, '533423', '维西傈僳族自治县', 3, '5334', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2913, '54', '西藏自治区', 1, NULL, 26, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2914, '5401', '拉萨市', 2, '54', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2915, '540102', '城关区', 3, '5401', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2916, '540103', '堆龙德庆区', 3, '5401', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2917, '540104', '达孜区', 3, '5401', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2918, '540121', '林周县', 3, '5401', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2919, '540122', '当雄县', 3, '5401', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2920, '540123', '尼木县', 3, '5401', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2921, '540124', '曲水县', 3, '5401', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2922, '540127', '墨竹工卡县', 3, '5401', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2923, '540171', '格尔木藏青工业园区', 3, '5401', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2924, '540172', '拉萨经济技术开发区', 3, '5401', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2925, '540173', '西藏文化旅游创意园区', 3, '5401', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2926, '540174', '达孜工业园区', 3, '5401', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2927, '5402', '日喀则市', 2, '54', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2928, '540202', '桑珠孜区', 3, '5402', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2929, '540221', '南木林县', 3, '5402', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2930, '540222', '江孜县', 3, '5402', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2931, '540223', '定日县', 3, '5402', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2932, '540224', '萨迦县', 3, '5402', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2933, '540225', '拉孜县', 3, '5402', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2934, '540226', '昂仁县', 3, '5402', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2935, '540227', '谢通门县', 3, '5402', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2936, '540228', '白朗县', 3, '5402', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2937, '540229', '仁布县', 3, '5402', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2938, '540230', '康马县', 3, '5402', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2939, '540231', '定结县', 3, '5402', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2940, '540232', '仲巴县', 3, '5402', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2941, '540233', '亚东县', 3, '5402', 14, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2942, '540234', '吉隆县', 3, '5402', 15, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2943, '540235', '聂拉木县', 3, '5402', 16, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2944, '540236', '萨嘎县', 3, '5402', 17, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2945, '540237', '岗巴县', 3, '5402', 18, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2946, '5403', '昌都市', 2, '54', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2947, '540302', '卡若区', 3, '5403', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2948, '540321', '江达县', 3, '5403', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2949, '540322', '贡觉县', 3, '5403', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2950, '540323', '类乌齐县', 3, '5403', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2951, '540324', '丁青县', 3, '5403', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2952, '540325', '察雅县', 3, '5403', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2953, '540326', '八宿县', 3, '5403', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2954, '540327', '左贡县', 3, '5403', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2955, '540328', '芒康县', 3, '5403', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2956, '540329', '洛隆县', 3, '5403', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2957, '540330', '边坝县', 3, '5403', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2958, '5404', '林芝市', 2, '54', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2959, '540402', '巴宜区', 3, '5404', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2960, '540421', '工布江达县', 3, '5404', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2961, '540423', '墨脱县', 3, '5404', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2962, '540424', '波密县', 3, '5404', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2963, '540425', '察隅县', 3, '5404', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2964, '540426', '朗县', 3, '5404', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2965, '540481', '米林市', 3, '5404', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2966, '5405', '山南市', 2, '54', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2967, '540502', '乃东区', 3, '5405', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2968, '540521', '扎囊县', 3, '5405', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2969, '540522', '贡嘎县', 3, '5405', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2970, '540523', '桑日县', 3, '5405', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2971, '540524', '琼结县', 3, '5405', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2972, '540525', '曲松县', 3, '5405', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2973, '540526', '措美县', 3, '5405', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2974, '540527', '洛扎县', 3, '5405', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2975, '540528', '加查县', 3, '5405', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2976, '540529', '隆子县', 3, '5405', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2977, '540531', '浪卡子县', 3, '5405', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2978, '540581', '错那市', 3, '5405', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2979, '5406', '那曲市', 2, '54', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2980, '540602', '色尼区', 3, '5406', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2981, '540621', '嘉黎县', 3, '5406', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2982, '540622', '比如县', 3, '5406', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2983, '540623', '聂荣县', 3, '5406', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2984, '540624', '安多县', 3, '5406', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2985, '540625', '申扎县', 3, '5406', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2986, '540626', '索县', 3, '5406', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2987, '540627', '班戈县', 3, '5406', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2988, '540628', '巴青县', 3, '5406', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2989, '540629', '尼玛县', 3, '5406', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2990, '540630', '双湖县', 3, '5406', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2991, '5425', '阿里地区', 2, '54', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2992, '542521', '普兰县', 3, '5425', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2993, '542522', '札达县', 3, '5425', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2994, '542523', '噶尔县', 3, '5425', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2995, '542524', '日土县', 3, '5425', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2996, '542525', '革吉县', 3, '5425', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2997, '542526', '改则县', 3, '5425', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2998, '542527', '措勤县', 3, '5425', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(2999, '61', '陕西省', 1, NULL, 27, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3000, '6101', '西安市', 2, '61', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3001, '610102', '新城区', 3, '6101', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3002, '610103', '碑林区', 3, '6101', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3003, '610104', '莲湖区', 3, '6101', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3004, '610111', '灞桥区', 3, '6101', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3005, '610112', '未央区', 3, '6101', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3006, '610113', '雁塔区', 3, '6101', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3007, '610114', '阎良区', 3, '6101', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3008, '610115', '临潼区', 3, '6101', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3009, '610116', '长安区', 3, '6101', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3010, '610117', '高陵区', 3, '6101', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3011, '610118', '鄠邑区', 3, '6101', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3012, '610122', '蓝田县', 3, '6101', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3013, '610124', '周至县', 3, '6101', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3014, '6102', '铜川市', 2, '61', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3015, '610202', '王益区', 3, '6102', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3016, '610203', '印台区', 3, '6102', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3017, '610204', '耀州区', 3, '6102', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3018, '610222', '宜君县', 3, '6102', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3019, '6103', '宝鸡市', 2, '61', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3020, '610302', '渭滨区', 3, '6103', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3021, '610303', '金台区', 3, '6103', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3022, '610304', '陈仓区', 3, '6103', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3023, '610305', '凤翔区', 3, '6103', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3024, '610323', '岐山县', 3, '6103', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3025, '610324', '扶风县', 3, '6103', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3026, '610326', '眉县', 3, '6103', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3027, '610327', '陇县', 3, '6103', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3028, '610328', '千阳县', 3, '6103', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3029, '610329', '麟游县', 3, '6103', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3030, '610330', '凤县', 3, '6103', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3031, '610331', '太白县', 3, '6103', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3032, '6104', '咸阳市', 2, '61', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3033, '610402', '秦都区', 3, '6104', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3034, '610403', '杨陵区', 3, '6104', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3035, '610404', '渭城区', 3, '6104', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3036, '610422', '三原县', 3, '6104', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3037, '610423', '泾阳县', 3, '6104', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3038, '610424', '乾县', 3, '6104', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3039, '610425', '礼泉县', 3, '6104', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3040, '610426', '永寿县', 3, '6104', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3041, '610428', '长武县', 3, '6104', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3042, '610429', '旬邑县', 3, '6104', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3043, '610430', '淳化县', 3, '6104', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3044, '610431', '武功县', 3, '6104', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3045, '610481', '兴平市', 3, '6104', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3046, '610482', '彬州市', 3, '6104', 14, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3047, '6105', '渭南市', 2, '61', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3048, '610502', '临渭区', 3, '6105', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3049, '610503', '华州区', 3, '6105', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3050, '610522', '潼关县', 3, '6105', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3051, '610523', '大荔县', 3, '6105', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3052, '610524', '合阳县', 3, '6105', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3053, '610525', '澄城县', 3, '6105', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3054, '610526', '蒲城县', 3, '6105', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3055, '610527', '白水县', 3, '6105', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3056, '610528', '富平县', 3, '6105', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3057, '610581', '韩城市', 3, '6105', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3058, '610582', '华阴市', 3, '6105', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3059, '6106', '延安市', 2, '61', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3060, '610602', '宝塔区', 3, '6106', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3061, '610603', '安塞区', 3, '6106', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3062, '610621', '延长县', 3, '6106', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3063, '610622', '延川县', 3, '6106', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3064, '610625', '志丹县', 3, '6106', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3065, '610626', '吴起县', 3, '6106', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3066, '610627', '甘泉县', 3, '6106', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3067, '610628', '富县', 3, '6106', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3068, '610629', '洛川县', 3, '6106', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3069, '610630', '宜川县', 3, '6106', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3070, '610631', '黄龙县', 3, '6106', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3071, '610632', '黄陵县', 3, '6106', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3072, '610681', '子长市', 3, '6106', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3073, '6107', '汉中市', 2, '61', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3074, '610702', '汉台区', 3, '6107', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3075, '610703', '南郑区', 3, '6107', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3076, '610722', '城固县', 3, '6107', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3077, '610723', '洋县', 3, '6107', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3078, '610724', '西乡县', 3, '6107', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3079, '610725', '勉县', 3, '6107', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3080, '610726', '宁强县', 3, '6107', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3081, '610727', '略阳县', 3, '6107', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3082, '610728', '镇巴县', 3, '6107', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3083, '610729', '留坝县', 3, '6107', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3084, '610730', '佛坪县', 3, '6107', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3085, '6108', '榆林市', 2, '61', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3086, '610802', '榆阳区', 3, '6108', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3087, '610803', '横山区', 3, '6108', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3088, '610822', '府谷县', 3, '6108', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3089, '610824', '靖边县', 3, '6108', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3090, '610825', '定边县', 3, '6108', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3091, '610826', '绥德县', 3, '6108', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3092, '610827', '米脂县', 3, '6108', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3093, '610828', '佳县', 3, '6108', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3094, '610829', '吴堡县', 3, '6108', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3095, '610830', '清涧县', 3, '6108', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3096, '610831', '子洲县', 3, '6108', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3097, '610881', '神木市', 3, '6108', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3098, '6109', '安康市', 2, '61', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3099, '610902', '汉滨区', 3, '6109', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3100, '610921', '汉阴县', 3, '6109', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3101, '610922', '石泉县', 3, '6109', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3102, '610923', '宁陕县', 3, '6109', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3103, '610924', '紫阳县', 3, '6109', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3104, '610925', '岚皋县', 3, '6109', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3105, '610926', '平利县', 3, '6109', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3106, '610927', '镇坪县', 3, '6109', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3107, '610929', '白河县', 3, '6109', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3108, '610981', '旬阳市', 3, '6109', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3109, '6110', '商洛市', 2, '61', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3110, '611002', '商州区', 3, '6110', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3111, '611021', '洛南县', 3, '6110', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3112, '611022', '丹凤县', 3, '6110', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3113, '611023', '商南县', 3, '6110', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3114, '611024', '山阳县', 3, '6110', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3115, '611025', '镇安县', 3, '6110', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3116, '611026', '柞水县', 3, '6110', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3117, '62', '甘肃省', 1, NULL, 28, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3118, '6201', '兰州市', 2, '62', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3119, '620102', '城关区', 3, '6201', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3120, '620103', '七里河区', 3, '6201', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3121, '620104', '西固区', 3, '6201', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3122, '620105', '安宁区', 3, '6201', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3123, '620111', '红古区', 3, '6201', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3124, '620121', '永登县', 3, '6201', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3125, '620122', '皋兰县', 3, '6201', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3126, '620123', '榆中县', 3, '6201', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3127, '620171', '兰州新区', 3, '6201', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3128, '6202', '嘉峪关市', 2, '62', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3129, '620201001', '雄关街道', 3, '6202', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3130, '620201002', '钢城街道', 3, '6202', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3131, '620201100', '新城镇', 3, '6202', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3132, '620201101', '峪泉镇', 3, '6202', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3133, '620201102', '文殊镇', 3, '6202', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3134, '6203', '金昌市', 2, '62', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3135, '620302', '金川区', 3, '6203', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3136, '620321', '永昌县', 3, '6203', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3137, '6204', '白银市', 2, '62', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3138, '620402', '白银区', 3, '6204', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3139, '620403', '平川区', 3, '6204', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3140, '620421', '靖远县', 3, '6204', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3141, '620422', '会宁县', 3, '6204', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3142, '620423', '景泰县', 3, '6204', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3143, '6205', '天水市', 2, '62', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3144, '620502', '秦州区', 3, '6205', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3145, '620503', '麦积区', 3, '6205', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3146, '620521', '清水县', 3, '6205', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3147, '620522', '秦安县', 3, '6205', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3148, '620523', '甘谷县', 3, '6205', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3149, '620524', '武山县', 3, '6205', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3150, '620525', '张家川回族自治县', 3, '6205', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3151, '6206', '武威市', 2, '62', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3152, '620602', '凉州区', 3, '6206', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3153, '620621', '民勤县', 3, '6206', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3154, '620622', '古浪县', 3, '6206', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3155, '620623', '天祝藏族自治县', 3, '6206', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3156, '6207', '张掖市', 2, '62', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3157, '620702', '甘州区', 3, '6207', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3158, '620721', '肃南裕固族自治县', 3, '6207', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3159, '620722', '民乐县', 3, '6207', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3160, '620723', '临泽县', 3, '6207', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3161, '620724', '高台县', 3, '6207', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3162, '620725', '山丹县', 3, '6207', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3163, '6208', '平凉市', 2, '62', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3164, '620802', '崆峒区', 3, '6208', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3165, '620821', '泾川县', 3, '6208', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3166, '620822', '灵台县', 3, '6208', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3167, '620823', '崇信县', 3, '6208', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3168, '620825', '庄浪县', 3, '6208', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3169, '620826', '静宁县', 3, '6208', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3170, '620881', '华亭市', 3, '6208', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3171, '6209', '酒泉市', 2, '62', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3172, '620902', '肃州区', 3, '6209', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3173, '620921', '金塔县', 3, '6209', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3174, '620922', '瓜州县', 3, '6209', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3175, '620923', '肃北蒙古族自治县', 3, '6209', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3176, '620924', '阿克塞哈萨克族自治县', 3, '6209', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3177, '620981', '玉门市', 3, '6209', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3178, '620982', '敦煌市', 3, '6209', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3179, '6210', '庆阳市', 2, '62', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3180, '621002', '西峰区', 3, '6210', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3181, '621021', '庆城县', 3, '6210', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3182, '621022', '环县', 3, '6210', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3183, '621023', '华池县', 3, '6210', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3184, '621024', '合水县', 3, '6210', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3185, '621025', '正宁县', 3, '6210', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3186, '621026', '宁县', 3, '6210', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3187, '621027', '镇原县', 3, '6210', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3188, '6211', '定西市', 2, '62', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3189, '621102', '安定区', 3, '6211', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3190, '621121', '通渭县', 3, '6211', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3191, '621122', '陇西县', 3, '6211', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3192, '621123', '渭源县', 3, '6211', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3193, '621124', '临洮县', 3, '6211', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3194, '621125', '漳县', 3, '6211', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3195, '621126', '岷县', 3, '6211', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3196, '6212', '陇南市', 2, '62', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3197, '621202', '武都区', 3, '6212', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3198, '621221', '成县', 3, '6212', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3199, '621222', '文县', 3, '6212', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3200, '621223', '宕昌县', 3, '6212', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3201, '621224', '康县', 3, '6212', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3202, '621225', '西和县', 3, '6212', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3203, '621226', '礼县', 3, '6212', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3204, '621227', '徽县', 3, '6212', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3205, '621228', '两当县', 3, '6212', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3206, '6229', '临夏回族自治州', 2, '62', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3207, '622901', '临夏市', 3, '6229', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3208, '622921', '临夏县', 3, '6229', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3209, '622922', '康乐县', 3, '6229', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3210, '622923', '永靖县', 3, '6229', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3211, '622924', '广河县', 3, '6229', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3212, '622925', '和政县', 3, '6229', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3213, '622926', '东乡族自治县', 3, '6229', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3214, '622927', '积石山保安族东乡族撒拉族自治县', 3, '6229', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3215, '6230', '甘南藏族自治州', 2, '62', 14, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3216, '623001', '合作市', 3, '6230', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3217, '623021', '临潭县', 3, '6230', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3218, '623022', '卓尼县', 3, '6230', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3219, '623023', '舟曲县', 3, '6230', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3220, '623024', '迭部县', 3, '6230', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3221, '623025', '玛曲县', 3, '6230', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3222, '623026', '碌曲县', 3, '6230', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3223, '623027', '夏河县', 3, '6230', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3224, '63', '青海省', 1, NULL, 29, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3225, '6301', '西宁市', 2, '63', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3226, '630102', '城东区', 3, '6301', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3227, '630103', '城中区', 3, '6301', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3228, '630104', '城西区', 3, '6301', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3229, '630105', '城北区', 3, '6301', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3230, '630106', '湟中区', 3, '6301', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3231, '630121', '大通回族土族自治县', 3, '6301', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3232, '630123', '湟源县', 3, '6301', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3233, '6302', '海东市', 2, '63', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3234, '630202', '乐都区', 3, '6302', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3235, '630203', '平安区', 3, '6302', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3236, '630222', '民和回族土族自治县', 3, '6302', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3237, '630223', '互助土族自治县', 3, '6302', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3238, '630224', '化隆回族自治县', 3, '6302', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3239, '630225', '循化撒拉族自治县', 3, '6302', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3240, '6322', '海北藏族自治州', 2, '63', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3241, '632221', '门源回族自治县', 3, '6322', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3242, '632222', '祁连县', 3, '6322', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3243, '632223', '海晏县', 3, '6322', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3244, '632224', '刚察县', 3, '6322', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3245, '6323', '黄南藏族自治州', 2, '63', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3246, '632301', '同仁市', 3, '6323', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3247, '632322', '尖扎县', 3, '6323', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3248, '632323', '泽库县', 3, '6323', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3249, '632324', '河南蒙古族自治县', 3, '6323', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3250, '6325', '海南藏族自治州', 2, '63', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3251, '632521', '共和县', 3, '6325', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3252, '632522', '同德县', 3, '6325', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3253, '632523', '贵德县', 3, '6325', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3254, '632524', '兴海县', 3, '6325', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3255, '632525', '贵南县', 3, '6325', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3256, '6326', '果洛藏族自治州', 2, '63', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3257, '632621', '玛沁县', 3, '6326', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3258, '632622', '班玛县', 3, '6326', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3259, '632623', '甘德县', 3, '6326', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3260, '632624', '达日县', 3, '6326', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3261, '632625', '久治县', 3, '6326', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3262, '632626', '玛多县', 3, '6326', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3263, '6327', '玉树藏族自治州', 2, '63', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3264, '632701', '玉树市', 3, '6327', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3265, '632722', '杂多县', 3, '6327', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3266, '632723', '称多县', 3, '6327', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3267, '632724', '治多县', 3, '6327', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3268, '632725', '囊谦县', 3, '6327', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3269, '632726', '曲麻莱县', 3, '6327', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3270, '6328', '海西蒙古族藏族自治州', 2, '63', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3271, '632801', '格尔木市', 3, '6328', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3272, '632802', '德令哈市', 3, '6328', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3273, '632803', '茫崖市', 3, '6328', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3274, '632821', '乌兰县', 3, '6328', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3275, '632822', '都兰县', 3, '6328', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3276, '632823', '天峻县', 3, '6328', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3277, '632857', '大柴旦行政委员会', 3, '6328', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3278, '64', '宁夏回族自治区', 1, NULL, 30, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3279, '6401', '银川市', 2, '64', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3280, '640104', '兴庆区', 3, '6401', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3281, '640105', '西夏区', 3, '6401', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3282, '640106', '金凤区', 3, '6401', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3283, '640121', '永宁县', 3, '6401', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3284, '640122', '贺兰县', 3, '6401', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3285, '640181', '灵武市', 3, '6401', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3286, '6402', '石嘴山市', 2, '64', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3287, '640202', '大武口区', 3, '6402', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3288, '640205', '惠农区', 3, '6402', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3289, '640221', '平罗县', 3, '6402', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3290, '6403', '吴忠市', 2, '64', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3291, '640302', '利通区', 3, '6403', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3292, '640303', '红寺堡区', 3, '6403', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3293, '640323', '盐池县', 3, '6403', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3294, '640324', '同心县', 3, '6403', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3295, '640381', '青铜峡市', 3, '6403', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3296, '6404', '固原市', 2, '64', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3297, '640402', '原州区', 3, '6404', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3298, '640422', '西吉县', 3, '6404', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3299, '640423', '隆德县', 3, '6404', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3300, '640424', '泾源县', 3, '6404', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3301, '640425', '彭阳县', 3, '6404', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3302, '6405', '中卫市', 2, '64', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3303, '640502', '沙坡头区', 3, '6405', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3304, '640521', '中宁县', 3, '6405', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3305, '640522', '海原县', 3, '6405', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3306, '65', '新疆维吾尔自治区', 1, NULL, 31, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3307, '6501', '乌鲁木齐市', 2, '65', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3308, '650102', '天山区', 3, '6501', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3309, '650103', '沙依巴克区', 3, '6501', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3310, '650104', '新市区', 3, '6501', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3311, '650105', '水磨沟区', 3, '6501', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3312, '650106', '头屯河区', 3, '6501', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3313, '650107', '达坂城区', 3, '6501', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3314, '650109', '米东区', 3, '6501', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3315, '650121', '乌鲁木齐县', 3, '6501', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3316, '6502', '克拉玛依市', 2, '65', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3317, '650202', '独山子区', 3, '6502', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3318, '650203', '克拉玛依区', 3, '6502', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3319, '650204', '白碱滩区', 3, '6502', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3320, '650205', '乌尔禾区', 3, '6502', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3321, '6504', '吐鲁番市', 2, '65', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3322, '650402', '高昌区', 3, '6504', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3323, '650421', '鄯善县', 3, '6504', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3324, '650422', '托克逊县', 3, '6504', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3325, '6505', '哈密市', 2, '65', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3326, '650502', '伊州区', 3, '6505', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3327, '650521', '巴里坤哈萨克自治县', 3, '6505', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3328, '650522', '伊吾县', 3, '6505', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3329, '6523', '昌吉回族自治州', 2, '65', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3330, '652301', '昌吉市', 3, '6523', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3331, '652302', '阜康市', 3, '6523', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3332, '652323', '呼图壁县', 3, '6523', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3333, '652324', '玛纳斯县', 3, '6523', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3334, '652325', '奇台县', 3, '6523', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3335, '652327', '吉木萨尔县', 3, '6523', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3336, '652328', '木垒哈萨克自治县', 3, '6523', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3337, '6527', '博尔塔拉蒙古自治州', 2, '65', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3338, '652701', '博乐市', 3, '6527', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3339, '652702', '阿拉山口市', 3, '6527', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3340, '652722', '精河县', 3, '6527', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3341, '652723', '温泉县', 3, '6527', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3342, '6528', '巴音郭楞蒙古自治州', 2, '65', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3343, '652801', '库尔勒市', 3, '6528', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3344, '652822', '轮台县', 3, '6528', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3345, '652823', '尉犁县', 3, '6528', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3346, '652824', '若羌县', 3, '6528', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3347, '652825', '且末县', 3, '6528', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3348, '652826', '焉耆回族自治县', 3, '6528', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3349, '652827', '和静县', 3, '6528', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3350, '652828', '和硕县', 3, '6528', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3351, '652829', '博湖县', 3, '6528', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3352, '6529', '阿克苏地区', 2, '65', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3353, '652901', '阿克苏市', 3, '6529', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3354, '652902', '库车市', 3, '6529', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3355, '652922', '温宿县', 3, '6529', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3356, '652924', '沙雅县', 3, '6529', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3357, '652925', '新和县', 3, '6529', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3358, '652926', '拜城县', 3, '6529', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3359, '652927', '乌什县', 3, '6529', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3360, '652928', '阿瓦提县', 3, '6529', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3361, '652929', '柯坪县', 3, '6529', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3362, '6530', '克孜勒苏柯尔克孜自治州', 2, '65', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3363, '653001', '阿图什市', 3, '6530', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3364, '653022', '阿克陶县', 3, '6530', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3365, '653023', '阿合奇县', 3, '6530', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3366, '653024', '乌恰县', 3, '6530', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3367, '6531', '喀什地区', 2, '65', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3368, '653101', '喀什市', 3, '6531', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3369, '653121', '疏附县', 3, '6531', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3370, '653122', '疏勒县', 3, '6531', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3371, '653123', '英吉沙县', 3, '6531', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3372, '653124', '泽普县', 3, '6531', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3373, '653125', '莎车县', 3, '6531', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3374, '653126', '叶城县', 3, '6531', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3375, '653127', '麦盖提县', 3, '6531', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3376, '653128', '岳普湖县', 3, '6531', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3377, '653129', '伽师县', 3, '6531', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3378, '653130', '巴楚县', 3, '6531', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3379, '653131', '塔什库尔干塔吉克自治县', 3, '6531', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3380, '6532', '和田地区', 2, '65', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3381, '653201', '和田市', 3, '6532', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3382, '653221', '和田县', 3, '6532', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3383, '653222', '墨玉县', 3, '6532', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3384, '653223', '皮山县', 3, '6532', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3385, '653224', '洛浦县', 3, '6532', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3386, '653225', '策勒县', 3, '6532', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3387, '653226', '于田县', 3, '6532', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3388, '653227', '民丰县', 3, '6532', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3389, '6540', '伊犁哈萨克自治州', 2, '65', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3390, '654002', '伊宁市', 3, '6540', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3391, '654003', '奎屯市', 3, '6540', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3392, '654004', '霍尔果斯市', 3, '6540', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3393, '654021', '伊宁县', 3, '6540', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3394, '654022', '察布查尔锡伯自治县', 3, '6540', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3395, '654023', '霍城县', 3, '6540', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3396, '654024', '巩留县', 3, '6540', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3397, '654025', '新源县', 3, '6540', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3398, '654026', '昭苏县', 3, '6540', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3399, '654027', '特克斯县', 3, '6540', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3400, '654028', '尼勒克县', 3, '6540', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3401, '6542', '塔城地区', 2, '65', 13, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3402, '654201', '塔城市', 3, '6542', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3403, '654202', '乌苏市', 3, '6542', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3404, '654203', '沙湾市', 3, '6542', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3405, '654221', '额敏县', 3, '6542', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3406, '654224', '托里县', 3, '6542', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3407, '654225', '裕民县', 3, '6542', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3408, '654226', '和布克赛尔蒙古自治县', 3, '6542', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3409, '6543', '阿勒泰地区', 2, '65', 14, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3410, '654301', '阿勒泰市', 3, '6543', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3411, '654321', '布尔津县', 3, '6543', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3412, '654322', '富蕴县', 3, '6543', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3413, '654323', '福海县', 3, '6543', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3414, '654324', '哈巴河县', 3, '6543', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3415, '654325', '青河县', 3, '6543', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3416, '654326', '吉木乃县', 3, '6543', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3417, '6590', '自治区直辖县级行政区划', 2, '65', 15, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3418, '659001', '石河子市', 3, '6590', 1, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3419, '659002', '阿拉尔市', 3, '6590', 2, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3420, '659003', '图木舒克市', 3, '6590', 3, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3421, '659004', '五家渠市', 3, '6590', 4, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3422, '659005', '北屯市', 3, '6590', 5, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3423, '659006', '铁门关市', 3, '6590', 6, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3424, '659007', '双河市', 3, '6590', 7, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3425, '659008', '可克达拉市', 3, '6590', 8, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3426, '659009', '昆玉市', 3, '6590', 9, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3427, '659010', '胡杨河市', 3, '6590', 10, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3428, '659011', '新星市', 3, '6590', 11, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59'),
(3429, '659012', '白杨市', 3, '6590', 12, 1, '2025-10-02 02:34:59', '2025-10-02 02:34:59');

-- --------------------------------------------------------

--
-- 表的结构 `comment`
--

CREATE TABLE `comment` (
  `id` int NOT NULL,
  `post_id` bigint DEFAULT NULL COMMENT '帖子ID，与topic_id二选一',
  `topic_id` bigint DEFAULT NULL COMMENT '专题ID，与post_id二选一',
  `user_id` int NOT NULL,
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `parent_id` int DEFAULT '0',
  `likes_count` int DEFAULT '0',
  `status` int DEFAULT '1',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '评论位置'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `comment`
--

INSERT INTO `comment` (`id`, `post_id`, `topic_id`, `user_id`, `content`, `parent_id`, `likes_count`, `status`, `create_time`, `update_time`, `location`) VALUES
(104, 54, NULL, 76, '1', 0, 0, 1, '2026-03-24 08:49:33', '2026-03-24 08:49:32', NULL),
(105, 53, NULL, 76, '1', 0, 1, 1, '2026-03-24 08:49:42', '2026-03-24 08:49:42', NULL),
(106, 53, NULL, 76, '@用户01', 0, 1, 1, '2026-03-24 08:49:45', '2026-03-24 08:49:45', NULL),
(107, 52, NULL, 76, '1', 0, 1, 1, '2026-03-24 08:49:55', '2026-03-24 08:49:55', NULL),
(108, NULL, 20, 76, '1', 0, 0, 1, '2026-03-24 08:51:12', '2026-03-24 08:51:12', '广西'),
(109, NULL, 20, 76, '1', 0, 0, 1, '2026-04-03 21:47:59', '2026-04-03 21:47:59', ''),
(110, 58, NULL, 76, '1232', 0, 0, 1, '2026-04-09 23:15:08', '2026-04-09 23:15:08', NULL),
(111, 60, NULL, 76, '好好', 0, 1, 1, '2026-04-09 23:15:18', '2026-04-09 23:15:17', NULL),
(112, 62, NULL, 75, '@用户02', 0, 1, 1, '2026-04-13 02:36:23', '2026-04-13 02:36:22', NULL),
(113, 59, NULL, 75, '@用户02 111', 0, 1, 1, '2026-04-13 02:42:30', '2026-04-13 02:42:29', NULL),
(114, 54, NULL, 75, '1', 0, 0, 1, '2026-04-20 04:54:42', '2026-04-20 04:54:41', NULL),
(115, 63, NULL, 75, '1', 0, 0, 1, '2026-04-20 04:54:52', '2026-04-20 04:54:51', NULL),
(116, 63, NULL, 75, '12', 0, 0, 1, '2026-04-20 04:54:59', '2026-04-20 04:54:58', NULL),
(117, 65, NULL, 80, '1111', 0, 0, 1, '2026-04-30 07:51:32', '2026-04-30 07:51:32', NULL),
(118, 64, NULL, 80, '1111', 0, 0, 1, '2026-04-30 07:51:44', '2026-04-30 07:51:43', NULL),
(119, 75, NULL, 80, '111', 0, 0, 1, '2026-04-30 07:52:04', '2026-04-30 07:52:04', NULL),
(120, 65, NULL, 79, '111', 0, 0, 1, '2026-04-30 07:53:07', '2026-04-30 07:53:06', NULL),
(121, 64, NULL, 79, '111', 0, 0, 1, '2026-04-30 07:53:19', '2026-04-30 07:53:19', NULL),
(122, 75, NULL, 79, '111', 0, 0, 1, '2026-04-30 07:53:44', '2026-04-30 07:53:44', NULL),
(123, 74, NULL, 79, '111', 0, 0, 1, '2026-04-30 07:54:35', '2026-04-30 07:54:34', NULL),
(124, 80, NULL, 79, '111', 0, 0, 1, '2026-04-30 07:54:50', '2026-04-30 07:54:50', NULL),
(125, 82, NULL, 79, '111', 0, 0, 1, '2026-04-30 07:54:59', '2026-04-30 07:54:58', NULL),
(126, 75, NULL, 80, '111', 0, 0, 1, '2026-04-30 07:58:36', '2026-04-30 07:58:35', NULL),
(127, 80, NULL, 80, '111', 0, 0, 1, '2026-04-30 07:58:44', '2026-04-30 07:58:44', NULL),
(128, 82, NULL, 80, '111', 0, 0, 1, '2026-04-30 07:58:50', '2026-04-30 07:58:49', NULL),
(129, 74, NULL, 80, '111', 0, 0, 1, '2026-04-30 07:58:56', '2026-04-30 07:58:56', NULL),
(130, 65, NULL, 75, '111', 0, 0, 1, '2026-04-30 08:26:06', '2026-04-30 08:26:05', NULL),
(131, 65, NULL, 75, '111', 0, 0, 1, '2026-04-30 08:26:11', '2026-04-30 08:26:11', NULL),
(132, 64, NULL, 75, '111', 0, 0, 1, '2026-04-30 08:26:18', '2026-04-30 08:26:18', NULL),
(133, 75, NULL, 75, '111', 0, 0, 1, '2026-04-30 08:26:26', '2026-04-30 08:26:25', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `comment_like`
--

CREATE TABLE `comment_like` (
  `id` int NOT NULL,
  `comment_id` int NOT NULL,
  `user_id` int NOT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `comment_like`
--

INSERT INTO `comment_like` (`id`, `comment_id`, `user_id`, `create_time`) VALUES
(103, 106, 76, '2026-03-24 08:49:48'),
(104, 105, 76, '2026-03-24 08:49:48'),
(105, 111, 75, '2026-04-20 04:51:44'),
(106, 107, 75, '2026-04-20 04:51:49'),
(107, 113, 75, '2026-04-20 04:51:53'),
(108, 112, 75, '2026-04-20 04:52:05');

-- --------------------------------------------------------

--
-- 表的结构 `complaints`
--

CREATE TABLE `complaints` (
  `id` bigint NOT NULL,
  `user_id` bigint DEFAULT NULL COMMENT '提交用户ID，未登录为空',
  `type` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '投诉类型：内容违规、用户行为、系统问题、其他',
  `content` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '投诉内容',
  `contact_info` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '联系方式（选填）',
  `images` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '图片URL列表JSON',
  `status` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'pending' COMMENT '状态：pending-待处理，processing-处理中，resolved-已解决',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='投诉举报' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `complaints`
--

INSERT INTO `complaints` (`id`, `user_id`, `type`, `content`, `contact_info`, `images`, `status`, `create_time`, `update_time`) VALUES
(5, 15278562765, '内容违规', '测试', '15278536941', '[\"https://situationship.icu/upload/files/files-20260421003830-5d60b2a3.jpg\"]', 'pending', '2026-04-21 00:38:47', '2026-04-21 00:38:47');

-- --------------------------------------------------------

--
-- 表的结构 `daily_topic`
--

CREATE TABLE `daily_topic` (
  `id` bigint NOT NULL COMMENT '专题ID',
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '专题标题',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '专题描述',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '正文富内容 JSON：[{t:"text",v:"段落"},{t:"img",v:"url"}]',
  `cover_image` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '封面图片URL',
  `theme` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '主题分类（如：宠物健康、营养、训练等）',
  `publish_date` date NOT NULL COMMENT '发布日期',
  `status` tinyint DEFAULT '1' COMMENT '状态：0-草稿，1-已发布，2-已下线',
  `sort_order` int DEFAULT '0' COMMENT '排序',
  `view_count` int DEFAULT '0' COMMENT '浏览量',
  `like_count` int DEFAULT '0' COMMENT '点赞数',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='每日专题帖子表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `daily_topic`
--

INSERT INTO `daily_topic` (`id`, `title`, `description`, `content`, `cover_image`, `theme`, `publish_date`, `status`, `sort_order`, `view_count`, `like_count`, `create_time`, `update_time`) VALUES
(21, '新手养猫系列|猫咪饮食避坑指南，喂对粮才是养出健康毛孩子的关键', NULL, '[{\"t\":\"text\",\"v\":\"新手铲屎官最头疼的问题里，\\\"给猫咪喂什么\\\"绝对排第一。面对市面上五花八门的猫粮、猫罐头、零食，看着各种\\\"无谷”鲜肉”\\\"高蛋白\\\"的宣传，再加上身边人各有各的说法，很容易陷入迷茫:到底该选哪种粮?多久喂一次?哪些能喂哪些不能喂?其实猫咪饮食的核心很简单:适配年龄、营养均衡、避开雷区。很多新手因为喂错粮，导致猫咪出现软便、呕吐、掉毛严重，甚至患上肠胃病、肾病，追悔\\n莫及。\\n今天这篇饮食指南，专门为新手量身打造，从猫粮选择、喂食方式，到零食搭配、饮食禁忌，一次性讲清楚，帮你避开90%的饮食坑，喂出健康又可爱的毛孩。子~\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413010518-19b0e959.jpg\"},{\"t\":\"text\",\"v\":\"一、新手选粮:记住3个核心，不被商家套路选猫粮是养猫饮食的第一步，也是最关键的一步。新手不用盲目追求\\\"进口”\\\"贵价\\\"，只要抓住3个核心，就能选到适合自家猫咪的好粮，避开商家的宣传套路\\n1.先看年龄:幼猫、成猫、老年猫，粮不能混喂猫咪在不同年龄段，对营养的需求完全不同，混喂粮会导致营养过剩或不足，影响身体健康。新手一定要根据猫咪的年龄选粮，这是最基础的原则。幼猫(≤12个月):处于快速生长发育期，需要高蛋白、高钙、易消化的幼猫粮，帮助骨骼和身体发育，建议选择颗粒较小、易咀嚼的款式，方便幼猫进食;成猫(1-7岁):身体发育成熟，营养需求稳定，选择成猫粮即可，重点关注营养均衡，避免过高的脂肪，防止猫咪肥胖;老年猫(≥7岁):新陈代谢变慢，肠胃功能减弱，需要选择老年猫粮，低脂肪、易消化、富含膳食纤维，同时补充关节营养，减轻身体负担。2.再看配料表:3个重点，避开\\\"垃圾粮”配料表是猫粮的\\\"身份证\\\"，新手看不懂复杂的成分只要抓住3个重点，就能快速判断猫粮好坏，避开\\\"三无垃圾粮”。\\n重点一:第一位必须是\\\"鲜肉\\\"或\\\"肉粉\\\"，且明确标注肉类来源(如鸡肉、牛肉、鱼肉)，避免出现\\\"肉类副产品”\\\"动物内脏\\\"等模糊表述一一猫咪是肉食动物，蛋白质是核心营养，优质肉类才能满足需求;重点二:避开\\\"谷物”\\\"麸质\\\"等成分，尤其是小麦、玉米、大豆，很多猫咪对谷物过敏，会导致软便、皮肤瘙痒、掉毛严重，优先选择无谷猫粮;重点三:拒绝添加\\\"诱食剂”\\\"防腐剂”\\\"色素\\\"，这类成分对猫咪肠胃和肝脏伤害很大，配料表中出现\\\"风味剂”\\\"人工色素”\\\"BHA/BHT\\\"等，直接pass。3.最后看营养值:满足基础需求即可，不用追求\\\"极致”\\n新手不用过分纠结营养值的具体数字，只要满足猫咪的基础需求，就是合格的猫粮。一般来说，幼猫粮粗蛋白≥30%、粗脂肪≥18%;成猫粮粗蛋白≥28%、粗脂肪≥15%，就能满足猫咪的日常营养需求。小贴士:第一次买猫粮，建议先买小包装试吃，观察猫咪的进食情况和粪便状态，如果猫咪爱吃、粪便成型，再批量购买;如果出现软便、呕吐，说明这款粮不适合，及时更换。\\n二、喂食方式:这4个细节，决定猫咪肠胃健康选对了猫粮，还要喂对方式，否则再好的粮，也会伤害猫咪的肠胃。很多新手因为喂食不当，导致猫咪出现肠胃问题，这些细节一定要注意。\\n1.喂食频率:幼猫少量多餐，成猫定时定量幼猫肠胃功能弱，一次吃不了太多，且生长发育需要持续补充营养，建议少量多餐:3-4个月龄，每天喂4-5次;5-12个月龄，每天喂3-4次，每次喂食量以猫咪5-10分钟吃完为准，不要过量。成猫肠胃功能成熟，建议定时定量喂食，每天喂2次(早晚各一次)，每次喂食量根据猫咪的体重和活动量调整，避免暴饮暴食一一长期过量喂食，会导致猫咪肥胖，引发糖尿病、心脏病等问题。2.换粮:循序渐进，避免肠胃应激很多新手会因为猫咪不爱吃当前的粮，或者想给猫咪换更好的粮，直接一次性更换，这样很容易导致猫咪肠胃不适，出现软便、腹泻、呕吐等情况。正确的换粮方法:循序渐进，分5-7天完成。第1-2天，I旧粮80%+新粮20%;第3-4天，旧粮50%+新粮50%;第5-6天，I旧粮20%+新粮80%;第7天，完全换成新粮。换粮期间，多观察猫咪的粪便和食欲，有异常及时停止换粮。\\n3.饮水:必须保证\\\"新鲜、充足\\\"，别忽视!很多新手只关注猫粮，却忽视了猫咪的饮水，这是非常危险的一一猫咪天生不爱喝水，长期缺水会导致泌尿系统疾病(如尿结石、肾衰竭)，这是猫咪的高发疾病，严重时会危及生命。建议每天更换一次饮用水，保证水盆里有干净的温水;可以准备多个水盆，放在家里不同的位置，方便猫咪随时喝水;如果猫咪实在不爱喝水，可以尝试用饮水机(流动的水更能吸引猫咪)，或者在猫粮里少量加水(不要太多，避免猫粮变质)\\n4.喂食环境:安静、固定，不打扰猫咪进食时很敏感，喜欢安静、固定的环境，避免被打扰。建议将食盆和水盆放在安静、远离猫砂盆的地方(猫咪不喜欢在厕所附近吃饭)，不要频繁更换喂食位置;喂食时，不要追着猫咪喂，也不要在猫咪进食时大声说话、打闹，让猫咪安心进食。三、零食选择:解馋可以，但别当主食!很多新手喜欢用零食讨好猫咪，看着猫咪吃得开心就频繁喂食，却不知道，频繁喂零食不仅会让猫咪挑食、不爱吃主食，还会导致营养不均衡、肥胖，甚至伤害肠胃。1.零食选择:优先选\\\"天然、无添加\\\"的款式选择猫咪零食时，同样要看好配料表，优先选择天然、无添加的款式，比如冻干、烘干肉干、猫条(无诱食剂、无防腐剂)，避免选择\\\"火腿肠”\\\"人类零食”\\\"廉价猫条\\\"，这类零食添加剂多，对猫咪健康有害。2.喂食频率:每周2-3次，每次少量零食只能作为\\\"奖励\\\"，不能当主食，建议每周喂食2-3次，每次少量(比如1-2根猫条、1-2块冻干)，可以在猫咪听话、互动后喂食，既能增进感情，也不会让猫咪挑食。3.避坑提醒:这些\\\"零食\\\"绝对不能喂除了人类的禁忌食物(之前手册中提到的巧克力、洋葱等)，还有一些看似适合猫咪的零食，其实也不能喂:比如牛奶(猫咪大多乳糖不耐受)、生肉(可能含有寄生虫)、咸肉(高盐伤肾)、水果(除了少量苹果、蓝莓，大多水果含糖量高，会导致肥胖)。\\n四、新手常见饮食误区，看完直接避坑总结了几个新手最容易踩的饮食误区，看完这几点再也不用为猫咪喂食发愁，也能避免伤害猫咪的健康。\\n误区1:贵的粮就是好粮，越贵越好其实猫粮的好坏，和价格没有绝对的关系，关键看配料表和营养值。有些进口粮价格昂贵，但配料表一般;有些国产粮价格适中，却用料扎实、营养均衡。新手选粮，优先看配料和营养，再结合自己的预算，不用盲目追求贵价。误区2:猫咪爱吃，就一直喂同一款粮猫咪长期吃同一款粮，会导致营养单一，也可能出现挑食的情况。建议每6-12个月，给猫咪更换一次猫粮(换粮时仍需循序渐进)，既能补充不同的营养，也能避免猫咪挑食。误区3:给猫咪喂人类的饭菜，省事儿又有营养人类的饭菜大多高盐、高油、高糖，还含有葱姜蒜等对猫咪有害的成分，长期喂食会导致猫咪肾脏负担加重、肠胃不适，甚至引发疾病。猫咪有自己的饮食习性，一定要喂专用的猫粮和零食，不要喂人类饭菜。误区4:猫咪胖一点更可爱，多喂点没关系猫咪肥胖并不是可爱，而是一种疾病，会引发糖尿病、心脏病、关节疾病等多种问题，缩短猫咪的寿命。新手一定要控制猫咪的喂食量，定期陪猫咪运动，保持健康的体重。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413010855-99a88ce9.jpg\"},{\"t\":\"text\",\"v\":\"最后:饮食健康，是猫咪长寿的基础猫咪的肠胃很脆弱，饮食的好坏，直接决定了猫咪的健康和寿命。作为新手铲屎官，不用追求多么专业的喂养方式，只要记住\\\"适配年龄、营养均衡、定时定量、避开雷区\\\"这几个核心，就能喂好猫咪。每一只毛孩子，都需要我们细心呵护，而喂对粮、喂好粮，就是我们爱它的第一步。愿每一位新手铲屎官，都能掌握正确的喂食方法，养出健康、活泼、长寿的毛孩子\"}]', 'https://situationship.icu/upload/files/files-20260413010923-9ecd602a.jpg', 'recommend', '2026-04-12', 1, 1, 4, 0, '2026-04-13 01:09:32', '2026-04-13 01:09:38'),
(22, '养猫科普|如何鉴定猫咪的性别?', NULL, '[{\"t\":\"text\",\"v\":\"要区分公猫和母猫并不总是那么容易，而要辨别幼猫或已经绝育的猫咪性别就更难了。然而，有一些迹象和行为可以让主人，去更容易判断一只猫的性别。\\n\\n1.给幼猫鉴定性别\\n\\n对于那些领养小猫的人来说，这只小猫可能只有几个星期大。新生儿和幼猫发育不成熟，以至于几乎不可能分辨它们的性别。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413011225-ecf547b8.jpg\"},{\"t\":\"text\",\"v\":\"\\n然而，一旦它们六到八周大，它们的生殖器在视觉上就会变得更加明显。然而，阴茎在公猫身上通常是看不到的，而且主人也不太可能感觉到或看到阴囊。因此，明显没有阴茎或睾丸并不意味着小猫是雌性。\\n\\n作为经验，繁殖者使用标点符号来识别幼猫或已经绝育的猫的性别。要做到这一点，轻轻提高宠物的尾巴;开始轻轻地爱抚，并试着抚摸猫的下背部，因为这样他或她可能会提高尾巴自己开始咕噜咕噜。\\n2.小母猫的性别鉴定\\n\\n当观察母猫的生殖器区域，也就是尾巴下方的空间时，它看起来就像倒立的感叹号在肛门下面的阴道区域有一条长长的裂缝。肛门和阴道通常只有大约一厘米的距离。在小猫身上，肛门和阴道看起来都像圆点，甚至可能更靠近。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413011419-a80f9f00.jpg\"},{\"t\":\"text\",\"v\":\"\\n公猫的肛门和阴茎之间的距离较大，睾丸位于中间，比较幼年的猫可能看不到明显的睾丸或者说阴囊。这两个开口看起来更像点、圆圈或冒号，而不像狭缝或线条。\\n\\n对于成年猫来说，可以使用和幼猫相同的性别鉴定技术;这通常也适用于已经绝育的和未绝育的猫。如果宠物没有绝育，那么根据外表和行为来辨别它们的性别就会容易得多。一旦猫被绝育，性别之间就没有明显的行为差异，明显的差异很可能与个别猫的性情有关。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413011528-c12040f6.jpg\"},{\"t\":\"text\",\"v\":\"3.未绝育成年猫的性别鉴定\\n未绝育的公猫有明显的睾丸(隐睾除外)和宽阔的下颚。他们也有独特的行为，开始于他们发情的时候。未绝育的公猫往往更加活跃和好斗。他们也更有可能通过尿液喷洒来标记他们的领地。\\n\\n没有绝育的母猫会有周期性的发情行为。在当她试图寻找配偶时，她的行为会发生巨大的变化，发情的母猫通更会博取注意，声音也更大。\\n\\n4.已绝育成年猫的性别鉴定\\n\\n绝育过的母猫仍然会表现出打滚，蹭地板的样子。但如果养猫咪时已经成年且未知是否绝育，需要去医院，兽医会用一些专门的检测方法来判断是否绝育。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413011702-9ddb70c6.jpg\"},{\"t\":\"text\",\"v\":\"\\n绝大多数绝育后的公猫仍然会出现阴囊的残余，肛门和阴茎仍然相对靠近。绝育的猫不会表现出典型的雄性或雌性行为。绝育的公猫通常比未绝育公猫更安静，而绝育的母猫不会发情。\\n虽然所有的猫看起来都非常相似，但某些颜色和身体特征对于特定的性别来说是独一无的。\\n具体来说，玳瑁或着三花的公猫是极其罕见的。对于那些养着三花猫的人来说，很有可能宠物是母猫的。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413011753-929f5519.jpg\"},{\"t\":\"text\",\"v\":\"\\n对于那些养了一只橘猫母猫很少有橘色的。\\n的人来说，很有可能是一只公猫。\\n生过小猫的母猫更有可能有明显的乳头(尽管雄猫和雌猫都有乳头)。母猫在发情期时可能会有阴道分泌物，而怀孕的猫会有低垂的、膨胀的腹部。\"}]', 'https://situationship.icu/upload/files/files-20260413011815-52e6214c.jpg', 'basic', '2026-04-13', 1, 0, 2, 0, '2026-04-13 01:19:44', '2026-04-13 01:57:20'),
(34, '养猫科普|猫到底该喝多少水?', NULL, '[{\"t\":\"text\",\"v\":\"为了达到最佳健康状态，猫咪每天都需要新鲜的饮用水。水可以帮助肾脏带走血液中的毒素，是至关重要的。水也有助于保持其他器官组织的水分和健康。猫咪脱水是很危险的，如果不治疗，可能会导致死亡。\\n处于肾衰竭的猫，无论是急性肾衰竭还是慢性肾衰竭，往往需要通过静脉注射或皮下滴注的方式提供额外的液体。后者的治疗通常是在家里进行的，而且相对容易学习和执行。对大多数猫来说，这些治疗后的改善是明显的、可见的。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413021744-24ac1fb4.jpg\"},{\"t\":\"text\",\"v\":\"01\\n过度饮水\\n过度饮水可能是猫咪甲状腺功能亢进症或猫咪糖尿病的危险信号。虽然猫咪在炎热的天气里可能会本能地多喝水，但与所有猫咪的习惯一样，了解猫咪的正常饮水量是很重要的。如果与之前相比，它们突然开始大量饮水并出现其他症状，应立即向兽医咨询。\\n02\\n水的需求取决于饮食\\n正常猫咪会自发调整饮水量保持水分平衡。猫的身体组织由大约67%的水组成。巧合的是，这与它们在野外捕捉和食用的猎物中的水的比例差不多。相比之下，干猫粮含有约10%的水分，而猫罐头的水分含量至少为75%，这使其成为良好的水源。同样地，吃干粮的猫也需要更多的饮用水。\\n03\\n建议\\n1\\n无论猫咪的饮食习惯如何，请为你的猫咪随时提供新鲜、干净的水，最好使用自动饮水机。\\n2\\n注意脱水的迹象。可以通过拉起猫咪颈背上松弛的皮肤来测试猫咪是否脱水。如果它马上回弹，说明猫咪有足够的水分。如果它迟迟不退，则可以怀疑出现了脱水现象。试着在猫咪的罐头中加入水，或在它们的饮用水中加入一两块冰块，使其更有趣。如果颈部皮肤没有明显消退，而猫咪又出现了其他生病的迹象，请立即咨询宠物医生。\\n3\\n了解您的猫的饮水习惯。如果它们突然\\\"断水\\\"或开始过量饮水，请咨询宠物医生。\"}]', 'https://situationship.icu/upload/files/files-20260413021826-7daed45c.jpg', 'feeding', '2026-04-13', 1, 0, 3, 0, '2026-04-13 02:14:38', '2026-04-13 02:18:34'),
(35, '养猫科普|猫咪日常护理实操大全', NULL, '[{\"t\":\"text\",\"v\":\"开门见山，这次讲4个日常的护理，希望能够帮到大家~\\n\\n1.日常毛皮护理：梳毛几乎是每个养猫人都会做的事情了。梳毛除了可以帮助猫咪减少舔入体内的猫毛、减少毛球症，还能帮助大家在梳毛的过程中发现可能的皮肤病。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413022058-af715bc3.jpg\"},{\"t\":\"text\",\"v\":\"猫咪的梳毛频次其实是根据猫咪毛发的长短来决定的。长毛猫一般建议每日至少全身梳毛一次;中长毛发的猫一般建议2-3次/周;短毛猫一般建议一周一次即可;无毛猫建议每周清洁2-3次。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413022139-b19a78a4.jpg\"},{\"t\":\"text\",\"v\":\"随着养猫人变多，梳毛的工具也越多越多了.....简直让人陷入选择困难症......建议大家在使用梳子的时候，注意下面这几点:\\n使用梳子注意事项\\n1.选择针梳的时候要特别注意下手的力道，不要刮伤猫咪皮肤;\\n2.使用任何梳子梳猫咪头部时，要注意不要伤到猫咪的眼睛;\\n3.多猫家庭建议:一猫一梳，避免皮肤病传染，也便于找到猫咪喜欢的梳子类型。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413022238-75dfb4b4.jpg\"},{\"t\":\"text\",\"v\":\"梳毛步骤\\n1.梳毛前:让猫咪放松，不要抗拒你的梳毛的动作;\\n2.梳毛中:猫咪整个身体的刷毛是需要分为几个板块完成的。从猫咪的脸颊开始，往脖颈或下巴处梳毛;从猫咪的头部开始，往背部和身体处刷毛;从胳肢窝开始，往腹部梳毛;\\n3.梳毛后:可以用玩耍和零食作为奖励。\"}]', 'https://situationship.icu/upload/files/files-20260413022348-efe58317.jpg', 'care', '2026-04-12', 1, 0, 3, 0, '2026-04-13 02:23:52', '2026-04-13 02:23:52'),
(36, '猫猫疫苗全解', NULL, '[{\"t\":\"text\",\"v\":\"今天要给大家掰扯一个争议非常大的问题:疫苗。\\n疫苗肯定是要打的，但是市面上对于:打什么、怎么打、打几次......这些问题的讨论层出不穷，此起彼伏。\\n本着科学养猫的观念和大家探讨一下这个\\\"危险边缘\\\"的话题.\\n猫的初始疫苗与后续疫苗\\n初始疫苗的来源其实简单粗暴:母乳。(母源对于幼猫来说，这是被动免疫，来自抗体)外界。这是猫咪喵喵坠地之后的第一道免疫防线，因此，没有吃到母乳的幼猫体质一般会更弱，也更容易生病。\\n随着时间的流逝，母乳的抗体会逐渐减弱。这个时候，猫咪自身的免疫系统就开启了长达一生的工作一一主动免疫。小到我们没有发现的病毒，大到需要打疫苗抗衡的病毒，都是猫咪主动免疫的过程。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413022604-dd56be46.jpg\"},{\"t\":\"text\",\"v\":\"随着时间的流逝，这些主动免疫产生的抗体会逐渐变弱，这时候就需要\\\"补打疫苗”，从而让猫咪的身体再一次主动免疫，产生抗体，保护自己。\"}]', 'https://situationship.icu/upload/files/files-20260413022620-cfccd2e7.jpg', 'medical', '2026-04-12', 1, 0, 0, 0, '2026-04-13 02:26:23', '2026-04-13 02:26:27'),
(37, '驱虫药真的需要1月1次吗?驱虫药完全攻略', NULL, '[{\"t\":\"text\",\"v\":\"夏天到了，蚊虫滋生，掀起了一股驱虫热。打开各大APP，发现满眼都是各大药厂的驱虫药广告，各种营销术语搞得人眼冒金星:什么内外同驱啦、广谱驱虫啦、安全无毒啦、药效持久啦.....\\n相信大家或多或少都会有些疑问:到底什么是内驱外驱?各种不同品牌的驱虫药到底有什么不同?驱虫药到底多久用一次?驱虫药为什么这么贵?可以自己在家里给猫驱虫吗?\\n这篇文章就给大家对驱虫这件事情进行一个全面、详细的分析和建议。\\n首先，我们来看一下到底什么是内驱外驱?\\n内驱和外驱字面上理解是体内用的驱虫药和体外用的驱虫药。其实这个理解是不够准确的。\\n更准确的理解是:内驱指对体内寄生虫有用的驱虫药、外驱指对体外寄生虫有用的驱虫药。\\n有些外用的驱虫药也能杀灭体内的寄生虫;有些内服的驱虫药也能杀灭体外的寄生虫。\\n(感觉把自己都绕进去了......)\\nAnyway，记住一点就可以了:不要管什么内驱、外驱、内外同驱的概念了，最重要的是看驱虫药到底能驱什么虫!\\n各个品牌的驱虫药都有些什么不同?\\n注:我这里只列举了一些猫咪常用的大品牌驱虫药。一些小品牌的药不是说完全不好，只是自己没有用过，没有自己实证，就不推荐给大家了。\\n各个品牌的驱虫药在价格、用法、适用年龄、驱虫的种类等方面上各有不同。具体可以参考下表:\"}]', 'https://situationship.icu/upload/files/files-20260413022853-17368c0b.jpg', 'health', '2026-04-12', 1, 0, 2, 0, '2026-04-13 02:29:04', '2026-04-13 02:29:04'),
(38, '如何读懂猫咪的情绪?', NULL, '[{\"t\":\"text\",\"v\":\"猫有情绪吗?猫咪当然有情绪!从兴奋、高兴到紧张和沮丧，猫可以表现出一系列的情绪。\\n或许会有一天，会有一种设备可以轻松地翻译猫咪的行为，这样我们也就可以准确地知道猫咪的感受。在我们掌握这项技术之前，铲屎官们需要学习如何理解你的猫咪的肢体语言和叫声，以便了解它的情绪。\"},{\"t\":\"img\",\"v\":\"https://situationship.icu/upload/files/files-20260413023000-ca131f38.jpg\"},{\"t\":\"text\",\"v\":\"猫用整个身体进行交流，从尾巴到耳朵和眼睛。虽然猫咪的肢体语言可能很复杂，但是通过以下这些小指导，可以帮助你解读你的猫咪在想什么以及读懂它们的感受。\\n然而，请记住，每只猫，都是特殊的个体，所以猫咪表现某些情绪的确切方式可能是独一无二的。\\n下面我们来看看猫咪放松、快乐、好奇、恐惧、愤怒以及生病时的一些肢体语言。\\n\\n猫咪表达情绪的肢体语言\\n猫咪感到放松或满足大多数时候，猫咪都感到放松和满足。以下是要注意的地方:\\n身体:\\n一只放松的猫，通常侧卧或仰卧，后腿张开。\\n尾巴:\\n它们的尾巴基本上是静止的，不会摇晃。\\n眼睛:\\n它们可能闭着眼，也可能是半睁开着的。当一只猫用半睁开的眼睛看着你时，或者它们在\\\"慢慢的眨眼\\\"，这是一种对铲屎官的\\\"欣赏”，因为这表明它们足够信任你，不会在你周围很警惕。\\n耳朵:\\n一只放松的猫的耳朵会竖起并且指向前方在一个中立的位置。\\n行为:\\n它们会呼噜呼噜地叫，或者揉捏爪子(也被称\\\"踩奶\\\")一只开心满足的猫通常会以一种放松的方式打扮自己和主人相处。\"}]', 'https://situationship.icu/upload/files/files-20260413022949-63bdf1f9.jpg', 'behavior', '2026-04-12', 1, 0, 5, 1, '2026-04-13 02:30:58', '2026-04-13 02:30:58');

-- --------------------------------------------------------

--
-- 表的结构 `daily_topic_post`
--

CREATE TABLE `daily_topic_post` (
  `id` bigint NOT NULL COMMENT '关联ID',
  `topic_id` bigint NOT NULL COMMENT '专题ID',
  `post_id` bigint NOT NULL COMMENT '帖子ID',
  `sort_order` int DEFAULT '0' COMMENT '排序',
  `is_featured` tinyint DEFAULT '0' COMMENT '是否精选：0-否，1-是',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='宠物专题关联表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `daily_topic_post`
--

INSERT INTO `daily_topic_post` (`id`, `topic_id`, `post_id`, `sort_order`, `is_featured`, `create_time`) VALUES
(1, 3, 23, 0, 1, '2025-12-01 17:52:27'),
(2, 3, 22, 1, 1, '2025-12-01 17:52:27'),
(3, 3, 21, 2, 1, '2025-12-01 17:52:27'),
(4, 3, 20, 3, 0, '2025-12-01 17:52:27');

-- --------------------------------------------------------

--
-- 表的结构 `daily_topic_theme`
--

CREATE TABLE `daily_topic_theme` (
  `id` bigint NOT NULL,
  `code` varchar(50) NOT NULL COMMENT '唯一标识，如 recommend、basic',
  `name` varchar(50) NOT NULL COMMENT '显示名称',
  `sort_order` int DEFAULT '0',
  `status` tinyint DEFAULT '1' COMMENT '1-启用 0-禁用',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='宠物专题分类表';

--
-- 转存表中的数据 `daily_topic_theme`
--

INSERT INTO `daily_topic_theme` (`id`, `code`, `name`, `sort_order`, `status`, `create_time`, `update_time`) VALUES
(1, 'recommend', '推荐', 0, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09'),
(2, 'basic', '基本知识', 1, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09'),
(3, 'feeding', '喂养', 2, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09'),
(4, 'care', '护理', 3, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09'),
(5, 'medical', '医疗', 4, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09'),
(6, 'health', '健康', 5, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09'),
(7, 'behavior', '行为', 6, 1, '2026-03-20 01:37:09', '2026-03-20 01:37:09');

-- --------------------------------------------------------

--
-- 表的结构 `department`
--

CREATE TABLE `department` (
  `id` bigint NOT NULL COMMENT '部门ID',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '部门名称',
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '服务类型标识（唯一）',
  `store_id` bigint DEFAULT NULL COMMENT '所属服务门店ID(service_stores)，NULL表示平台级部门',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT '部门描述',
  `status` int DEFAULT '1' COMMENT '状态：1-启用，0-禁用',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='部门管理表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `department`
--

INSERT INTO `department` (`id`, `name`, `service_type`, `store_id`, `description`, `status`, `create_time`, `update_time`) VALUES
(1, '上门铲屎部门', '上门铲屎', NULL, NULL, 1, '2025-11-03 18:11:56', '2025-11-03 18:11:56'),
(3, '宠物医院部门', '宠物医疗', NULL, NULL, 1, '2025-11-03 21:45:30', '2025-11-03 21:45:30'),
(4, '宠物洗护部门', '宠物洗护', NULL, NULL, 1, '2025-11-03 21:45:44', '2025-11-03 21:45:44'),
(9, '医师', '医师', 1, NULL, 1, '2026-03-24 01:01:21', '2026-03-24 01:01:21'),
(10, '商城', '商城', 1, NULL, 1, '2026-03-24 01:02:20', '2026-03-24 01:02:20');

-- --------------------------------------------------------

--
-- 表的结构 `door_cleaning_appointment`
--

CREATE TABLE `door_cleaning_appointment` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `pet_id` int DEFAULT NULL,
  `member_id` bigint DEFAULT NULL COMMENT '服务人员ID',
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `store_id` bigint DEFAULT NULL COMMENT '预约门店/所属门店ID',
  `appointment_date` datetime DEFAULT NULL,
  `time_slot` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '???',
  `date` date DEFAULT NULL COMMENT '????',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'pending' COMMENT '????',
  `remark` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT '??',
  `contact_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '?????',
  `contact_phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '????',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `price` decimal(10,2) DEFAULT '199.00',
  `location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT '瀹犵墿鍖婚櫌' COMMENT '棰勭害鍦扮偣',
  `verify_code` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '鏍搁攢鐮',
  `is_verified` int DEFAULT '0' COMMENT '鏄?惁宸叉牳閿?0-鏈?牳閿?1-宸叉牳閿',
  `verify_time` timestamp NULL DEFAULT NULL COMMENT '鏍搁攢鏃堕棿',
  `reject_reason` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '工作人员拒绝原因',
  `key_handover_method` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '钥匙给予方式',
  `key_return_method` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '钥匙归还方式',
  `cancellation_penalty_amount` decimal(10,2) DEFAULT NULL COMMENT '取消时违约金',
  `service_id` bigint DEFAULT NULL COMMENT '预约的服务ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='上门铲屎预约表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `door_cleaning_appointment`
--

INSERT INTO `door_cleaning_appointment` (`id`, `user_id`, `pet_id`, `member_id`, `service_type`, `store_id`, `appointment_date`, `time_slot`, `date`, `status`, `remark`, `contact_name`, `contact_phone`, `create_time`, `update_time`, `price`, `location`, `verify_code`, `is_verified`, `verify_time`, `reject_reason`, `key_handover_method`, `key_return_method`, `cancellation_penalty_amount`, `service_id`) VALUES
(34, 76, 17, 37, 'door-cleaning', 1, '2026-03-25 00:00:00', '11:00-12:00', '2026-03-25', 'no_show', '', '用户02', '15278562765', '2026-03-25 09:41:44', '2026-05-02 01:30:00', '39.00', '123', '0e9b911c691548aa8ca9ca94249c0642', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（违约金15.60元）', '密码锁', '丰巢存件', '15.60', NULL),
(35, 75, 17, 37, 'door-cleaning', 1, '2026-04-28 00:00:00', '14:00-16:00', '2026-04-28', 'no_show', '', '用户01', '15278562765', '2026-04-27 14:20:04', '2026-05-02 01:30:01', '39.00', '123', '385815', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（违约金15.60元）', '丰巢存件', '家中有人', '15.60', 30);

-- --------------------------------------------------------

--
-- 表的结构 `grooming_appointments`
--

CREATE TABLE `grooming_appointments` (
  `id` bigint NOT NULL,
  `user_id` bigint NOT NULL COMMENT 'User ID',
  `pet_id` bigint NOT NULL COMMENT 'Pet ID',
  `service_id` bigint DEFAULT NULL COMMENT 'Grooming service ID',
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'grooming' COMMENT 'Service type',
  `store_id` bigint DEFAULT NULL COMMENT '预约门店ID',
  `date` date NOT NULL COMMENT 'Appointment date',
  `time_slot` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Appointment time slot',
  `location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT 'Service address',
  `contact_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Contact name',
  `contact_phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Contact phone',
  `remark` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT 'Remark',
  `price` decimal(10,2) NOT NULL COMMENT 'Service price',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'pending' COMMENT 'Status: pending, confirmed, cancelled, completed',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'Create time',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Update time',
  `verify_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `is_verified` tinyint(1) DEFAULT '0',
  `verify_time` datetime DEFAULT NULL,
  `member_id` bigint DEFAULT NULL,
  `reject_reason` varchar(500) DEFAULT NULL COMMENT '工作人员拒绝原因',
  `cancellation_penalty_amount` decimal(10,2) DEFAULT NULL COMMENT '取消时违约金'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Pet grooming appointment orders' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `grooming_appointments`
--

INSERT INTO `grooming_appointments` (`id`, `user_id`, `pet_id`, `service_id`, `service_type`, `store_id`, `date`, `time_slot`, `location`, `contact_name`, `contact_phone`, `remark`, `price`, `status`, `create_time`, `update_time`, `verify_code`, `is_verified`, `verify_time`, `member_id`, `reject_reason`, `cancellation_penalty_amount`) VALUES
(19, 76, 17, 27, 'grooming', 2, '2026-03-25', '09:00-10:00', '广州市天河区珠江新城花城大道456号', '用户02', '15278562765', '', '168.00', 'no_show', '2026-03-25 01:43:57', '2026-05-01 17:30:01', '4d98fb1173d94833a4838814173996a3', 0, NULL, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款67.20元）', '67.20'),
(20, 76, 13, 28, 'grooming', 2, '2026-03-25', '15:00-16:00', '广州市天河区珠江新城花城大道456号', '用户02', '15278562769', '', '258.00', 'cancelled', '2026-03-25 02:59:05', '2026-03-25 04:34:26', '219b5cf4e5534946a5e3137719e042e1', 0, NULL, NULL, NULL, NULL),
(21, 76, 13, 28, 'grooming', 1, '2026-03-26', '10:00-11:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562798', '', '258.00', 'no_show', '2026-03-25 06:31:10', '2026-05-01 17:30:01', '64b2701300c2412db62789f0b6ddc7ba', 0, NULL, 39, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款103.20元）', '103.20'),
(22, 75, 13, 28, 'grooming', 1, '2026-04-21', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562765', '', '258.00', 'no_show', '2026-04-19 21:38:59', '2026-05-01 17:30:01', 'a440266820284a25a34d2eaa6bf43602', 0, NULL, 39, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款103.20元）', '103.20');

-- --------------------------------------------------------

--
-- 表的结构 `grooming_services`
--

CREATE TABLE `grooming_services` (
  `id` bigint NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `image_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `bg_color` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '#e3f2fd',
  `duration` int NOT NULL DEFAULT '60',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'active',
  `sort_order` int DEFAULT '0',
  `is_recommended` tinyint(1) DEFAULT '0',
  `tags` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) DEFAULT '0',
  `introduction` json DEFAULT NULL,
  `instructions` json DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `grooming_services`
--

INSERT INTO `grooming_services` (`id`, `name`, `description`, `category`, `price`, `image_url`, `bg_color`, `duration`, `status`, `sort_order`, `is_recommended`, `tags`, `created_at`, `updated_at`, `is_deleted`, `introduction`, `instructions`) VALUES
(27, '基础洗护套餐', '适用于常规清洁的洗护组合，包含深层清洁与基础修剪。', 'basic-care', '168.00', 'https://situationship.icu/upload/files/files-20260324002507-abedb086.jpg', '#f2fbff', 60, 'active', 0, 1, '[]', '2025-11-10 17:47:32', '2026-03-24 00:25:08', 0, '[\"适用于常规清洁的洗护组合\", \"包含深层清洁与基础修剪。\"]', '[\"123\"]'),
(28, 'SPA 按摩护理', '舒缓按摩搭配营养护肤，让宠物放松身心，提升毛发光泽。', 'spa', '258.00', 'https://situationship.icu/upload/files/files-20260324002514-dbeb2718.jpg', '#fff4ec', 75, 'active', 1, 1, '[\"SPA\",\"舒缓护理\"]', '2025-11-10 17:47:32', '2026-03-24 00:25:15', 0, '[\"舒缓按摩搭配营养护肤\", \"让宠物放松身心\", \"提升毛发光泽。\"]', '[]'),
(29, '造型美容套餐', '根据宠物特征定制专属造型，包含全套修剪与造型设计。', 'styling', '328.00', 'https://situationship.icu/upload/files/files-20260324002519-070ffed2.jpg', '#f8f5ff', 90, 'active', 2, 1, '[\"美容\",\"造型\"]', '2025-11-10 17:47:32', '2026-03-24 00:25:20', 0, '[\"根据宠物特征定制专属造型\", \"包含全套修剪与造型设计。\"]', '[]');

-- --------------------------------------------------------

--
-- 表的结构 `grooming_service_banners`
--

CREATE TABLE `grooming_service_banners` (
  `id` bigint NOT NULL,
  `title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `image_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `position` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `status` enum('active','inactive') CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'active',
  `sort_order` int NOT NULL DEFAULT '0',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `grooming_service_banners`
--

INSERT INTO `grooming_service_banners` (`id`, `title`, `description`, `image_url`, `position`, `status`, `sort_order`, `created_at`, `updated_at`, `is_deleted`) VALUES
(2, '宠物洗护展示图.png', '洗护服务页面顶部展示图', 'https://situationship.icu/upload/files/files-20260324002526-5fe150ac.jpg', 'grooming-page-top', 'active', 1, '2026-03-24 00:25:26', '2026-03-24 00:25:26', 0);

-- --------------------------------------------------------

--
-- 表的结构 `hospital_appointments`
--

CREATE TABLE `hospital_appointments` (
  `id` bigint NOT NULL,
  `user_id` bigint NOT NULL COMMENT 'User ID',
  `pet_id` bigint NOT NULL COMMENT 'Pet ID',
  `pet_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `service_id` bigint DEFAULT NULL,
  `member_id` bigint DEFAULT NULL,
  `member_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `member_phone` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'hospital' COMMENT 'Service type',
  `store_id` bigint DEFAULT NULL COMMENT '预约门店ID',
  `date` date NOT NULL COMMENT 'Appointment date',
  `time_slot` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Appointment time slot',
  `location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT 'Service address',
  `contact_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Contact name',
  `contact_phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Contact phone',
  `remark` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT 'Remark',
  `price` decimal(10,2) NOT NULL COMMENT 'Service price',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'pending' COMMENT 'Status: pending-confirmed, confirmed-confirmed, cancelled-cancelled, completed-completed',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'Create time',
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Update time',
  `verify_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `is_verified` tinyint(1) DEFAULT '0',
  `verify_time` datetime DEFAULT NULL,
  `reject_reason` varchar(500) DEFAULT NULL COMMENT '工作人员拒绝原因',
  `cancellation_penalty_amount` decimal(10,2) DEFAULT NULL COMMENT '取消时违约金'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `hospital_appointments`
--

INSERT INTO `hospital_appointments` (`id`, `user_id`, `pet_id`, `pet_name`, `service_id`, `member_id`, `member_name`, `member_phone`, `service_type`, `store_id`, `date`, `time_slot`, `location`, `contact_name`, `contact_phone`, `remark`, `price`, `status`, `create_time`, `update_time`, `verify_code`, `is_verified`, `verify_time`, `reject_reason`, `cancellation_penalty_amount`) VALUES
(13, 76, 17, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-03-25', '10:00-11:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562765', '', '199.00', 'no_show', '2026-03-25 01:42:56', '2026-05-01 17:30:01', '3f7efffc9b0a4d1ebf56068805f81843', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款79.60元）', '79.60'),
(14, 76, 13, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-03-27', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562769', '', '199.00', 'no_show', '2026-03-25 18:39:42', '2026-05-01 17:30:01', '4efc381539324e72867ba6bd43301a4c', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款79.60元）', '79.60'),
(15, 76, 14, NULL, 24, 36, NULL, NULL, 'hospital', 1, '2026-04-03', '15:00-16:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562768', '', '399.00', 'completed', '2026-04-01 14:10:20', '2026-04-01 15:01:44', 'aef2b02ee0f74a3b869910f72a71207a', 0, NULL, NULL, NULL),
(16, 76, 14, NULL, 24, 36, NULL, NULL, 'hospital', 1, '2026-04-02', '10:00-11:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562768', '', '399.00', 'no_show', '2026-04-01 14:10:56', '2026-05-01 17:30:01', '5b9c5d4a4b314452b9e3109b1b535642', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款159.60元）', '159.60'),
(17, 76, 13, NULL, 25, 36, NULL, NULL, 'hospital', 1, '2026-04-04', '15:00-16:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562765', '', '259.00', 'no_show', '2026-04-02 16:16:49', '2026-05-01 17:30:01', '5c8a9f26c7c8432e95996bc27733e655', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款103.60元）', '103.60'),
(18, 76, 14, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-04-14', '15:00-16:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562796', '', '199.00', 'completed', '2026-04-11 17:02:28', '2026-04-23 06:10:37', '6deb7558b87e4f1bb95f05c27aced513', 0, NULL, NULL, NULL),
(19, 76, 13, NULL, 23, 36, NULL, NULL, 'hospital', 1, '2026-04-14', '16:00-17:00', '广州市天河区天河路567号宠物之家', '用户02', '15278562769', '', '149.00', 'completed', '2026-04-12 16:57:27', '2026-04-23 06:10:39', '4cfe421a57b74ba281994d4f2100a53f', 0, NULL, NULL, NULL),
(20, 75, 13, NULL, 23, 36, NULL, NULL, 'hospital', 1, '2026-04-20', '14:00-15:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562765', '', '149.00', 'cancelled', '2026-04-19 10:10:10', '2026-04-19 10:11:59', '07503d7a35f249b7a49c120cc0bbf755', 0, NULL, '不行', NULL),
(21, 75, 17, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-04-20', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562769', '', '199.00', 'completed', '2026-04-19 13:45:08', '2026-04-19 22:10:44', 'c8d97a81187a4edbbde50cd8e28a47dc', 1, '2026-04-20 06:10:44', NULL, NULL),
(22, 75, 17, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-04-20', '10:00-11:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562769', '', '199.00', 'cancelled', '2026-04-19 14:55:13', '2026-04-19 16:34:41', '519cf0f5305c4682984b0690df0c6b05', 0, NULL, NULL, NULL),
(23, 75, 17, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-04-23', '15:00-16:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562765', '', '199.00', 'completed', '2026-04-22 07:43:11', '2026-04-23 06:10:41', '52fd4c23c7c041f9870d0e7ffcc1dd11', 0, NULL, NULL, NULL),
(24, 75, 17, NULL, 24, 36, NULL, NULL, 'hospital', 1, '2026-04-23', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562765', '', '399.00', 'completed', '2026-04-22 07:55:58', '2026-04-23 06:10:42', '5ca6b2e3ae934483991eccbb2ee3bda3', 0, NULL, NULL, NULL),
(25, 75, 17, NULL, 23, 36, NULL, NULL, 'hospital', 1, '2026-04-28', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562765', '', '149.00', 'no_show', '2026-04-27 06:21:11', '2026-05-01 17:30:01', '557077', 0, NULL, '系络自动处理：服务时间已过且未核销，已标记爽约（罚款59.60元）', '59.60'),
(26, 75, 17, NULL, 22, 36, NULL, NULL, 'hospital', 1, '2026-05-03', '08:00-09:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562765', '', '199.00', 'change_pending', '2026-05-01 18:46:09', '2026-05-02 16:16:44', '695967', 0, NULL, NULL, NULL),
(27, 75, 17, NULL, 23, 36, NULL, NULL, 'hospital', 1, '2026-05-04', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户01', '15278562768', '', '149.00', 'cancel_pending', '2026-05-02 16:04:37', '2026-05-02 16:18:18', '098605', 0, NULL, NULL, NULL),
(28, 75, 17, NULL, 23, 36, NULL, NULL, 'hospital', 1, '2026-05-05', '09:00-10:00', '广州市天河区天河路567号宠物之家', '用户01', '19012544114', '', '149.00', 'confirmed', '2026-05-02 16:17:40', '2026-05-02 16:19:25', '814871', 0, NULL, NULL, NULL),
(29, 75, 17, NULL, 23, 36, NULL, NULL, 'hospital', 1, '2026-05-05', '08:00-09:00', '广州市天河区天河路567号宠物之家', '用户01', '19012544113', '', '149.00', 'pending', '2026-05-02 16:19:20', '2026-05-02 16:19:20', '386836', 0, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- 表的结构 `hospital_services`
--

CREATE TABLE `hospital_services` (
  `id` bigint NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `product_introduction` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `usage_instructions` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `precautions` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `target_audience` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `service_duration` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `booking_requirements` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `service_features` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `price` decimal(10,2) NOT NULL,
  `image_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'active',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `introduction` json DEFAULT NULL,
  `instructions` json DEFAULT NULL,
  `duration` int DEFAULT NULL,
  `bg_color` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `tags` json DEFAULT NULL,
  `is_recommended` tinyint(1) NOT NULL DEFAULT '0',
  `sort_order` int NOT NULL DEFAULT '0',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='宠物医院服务' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `hospital_services`
--

INSERT INTO `hospital_services` (`id`, `name`, `description`, `product_introduction`, `usage_instructions`, `precautions`, `target_audience`, `service_duration`, `booking_requirements`, `service_features`, `price`, `image_url`, `category`, `status`, `create_time`, `update_time`, `introduction`, `instructions`, `duration`, `bg_color`, `tags`, `is_recommended`, `sort_order`, `created_at`, `updated_at`, `is_deleted`) VALUES
(22, '基础体检套餐', '年度常规健康评估，含问诊、基础生理指标检查与健康档案建立。', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '199.00', 'https://situationship.icu/upload/files/files-20260324002605-3a155877.jpg', '常规体检', 'active', '2025-11-09 15:36:04', '2026-03-23 16:26:05', '[\"专业兽医问诊评估\", \"体重与体况评估\", \"血常规与生化项目按需加项\"]', '[\"体检前需禁食 8 小时，禁水 2 小时\", \"如有慢性病史请提前告知\", \"携带疫苗本以便登记\"]', 45, '#e9f5ff', '[\"体检\", \"健康档案\"]', 1, 1, '2025-11-09 23:36:04', '2026-03-24 00:26:06', 0),
(23, '疫苗接种&驱虫组合', '根据宠物年龄与生活习惯定制免疫计划，并提供体重评估和驱虫建议。', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '149.00', 'https://situationship.icu/upload/files/files-20260324002612-995f7957.jpg', '疫苗与驱虫', 'active', '2025-11-09 15:36:04', '2026-03-23 16:26:12', '[\"专属免疫方案定制\", \"体重体况评估\", \"口服/外用驱虫计划\"]', '[\"接种前确认健康状态良好\", \"若近期用药请提前说明\", \"幼宠需监护人陪同\"]', 30, '#fff3e0', '[\"疫苗\", \"驱虫\", \"预防保健\"]', 1, 2, '2025-11-09 23:36:04', '2026-03-24 00:26:12', 0),
(24, '术前综合评估', '手术前的全面风险评估，含血液、影像与麻醉方案建议，保障术中安全。', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '399.00', 'https://situationship.icu/upload/files/files-20260324002646-cd60e33d.jpg', '手术评估', 'active', '2025-11-09 15:36:04', '2026-03-23 16:26:46', '[\"血常规与生化检查\", \"心电图与 X 光影像\", \"麻醉风险等级评估\"]', '[\"手术前 12 小时禁食禁水\", \"如有既往病史携带病例与化验单\", \"按约定时间到院办理住院手续\"]', 90, '#f3e8ff', '[\"手术\", \"麻醉\", \"术前评估\"]', 1, 3, '2025-11-09 23:36:04', '2026-03-24 00:26:47', 0),
(25, '慢病管理复诊', '针对糖尿病、肾病等慢性疾病提供随访与用药调整，含咨询与饮食建议。', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '259.00', 'https://situationship.icu/upload/files/files-20260324002627-cb12a958.jpg', '慢病管理', 'active', '2025-11-09 15:36:04', '2026-03-23 16:26:27', '[\"血糖/肾指标追踪\", \"用药疗程评估\", \"营养与运动建议\"]', '[\"复诊前记录一周用药与饮食\", \"携带自用药品标签便于核对\", \"如有异常症状请提前电话沟通\"]', 40, '#eafbf2', '[\"慢病管理\", \"复诊\"]', 0, 4, '2025-11-09 23:36:04', '2026-03-24 00:26:28', 0),
(26, '口腔洁治抛光', '高压雾化洁牙与抛光，改善口臭并降低口腔炎症风险，术后含银离子护理。', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '489.00', 'https://situationship.icu/upload/files/files-20260324002634-ea6a2be9.jpg', '口腔保健', 'active', '2025-11-09 15:36:04', '2026-03-23 16:26:34', '[\"超声波洁治\", \"专业抛光与抑菌冲洗\", \"术后口腔护理指导\"]', '[\"麻醉前 8 小时禁食禁水\", \"手术前需完成血液筛查\", \"术后 2 小时内禁食\"]', 70, '#fdebea', '[\"口腔\", \"洁牙\"]', 1, 5, '2025-11-09 23:36:04', '2026-03-24 00:26:35', 0),
(27, '术后康复理疗', '针对术后或外伤恢复期宠物提供低频理疗、关节拉伸与伤口护理，促进康复。', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '329.00', 'https://situationship.icu/upload/files/files-20260324002641-65f4791f.jpg', '康复理疗', 'active', '2025-11-09 15:36:04', '2026-03-23 16:26:41', '[\"低频电刺激理疗\", \"关节与肌群拉伸\", \"伤口护理与换药\"]', '[\"理疗前 2 小时进食可少量\", \"请提前提供手术/外伤记录\", \"配合安排家属在场辅助\"]', 50, '#f0f5e9', '[\"康复\", \"理疗\"]', 0, 6, '2025-11-09 23:36:04', '2026-03-24 00:26:42', 0);

-- --------------------------------------------------------

--
-- 表的结构 `litter_services`
--

CREATE TABLE `litter_services` (
  `id` bigint NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `introduction` json DEFAULT NULL COMMENT '商品介绍列表',
  `instructions` json DEFAULT NULL COMMENT '使用须知列表',
  `category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `price` decimal(10,2) NOT NULL,
  `duration` int DEFAULT NULL,
  `image_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `bg_color` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `tags` json DEFAULT NULL,
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'active',
  `is_recommended` tinyint(1) DEFAULT '0',
  `sort_order` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='上门铲屎服务' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `litter_services`
--

INSERT INTO `litter_services` (`id`, `name`, `description`, `introduction`, `instructions`, `category`, `price`, `duration`, `image_url`, `bg_color`, `tags`, `status`, `is_recommended`, `sort_order`, `created_at`, `updated_at`, `is_deleted`) VALUES
(30, '基础上门铲屎服务', '专业上门铲屎服务，包括清理猫砂盆、更换猫砂、清洁周围环境。适合日常维护，让您的爱宠拥有干净舒适的生活环境。', '[\"专业上门铲屎服务，包括清理猫砂盆、更换猫砂、清洁周围环境。适合日常维护，让您的爱宠拥有干净舒适的生活环境。\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'basic', '39.00', 30, 'https://situationship.icu/upload/files/files-20260324004421-3c156cdd.jpg', '#e3f2fd', '[]', 'active', 1, 1, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0),
(31, '深度清洁铲屎服务', '深度清洁铲屎服务，包括彻底清理猫砂盆、消毒杀菌、更换全新猫砂、清洁周围区域。适合长时间未清理或需要彻底清洁的情况。', '[\"适用宠物: 猫咪、狗狗\", \"适用宠物性别: 公母均可\", \"服务范围: 室内宠物生活区域深度清洁\", \"服务时长: 60分钟\", \"包含内容: 彻底清理猫砂盆、消毒杀菌、更换全新猫砂、清洁周围区域\", \"服务时间: 每日9:00-18:00\", \"需要提前2小时预约\", \"适合长时间未清理的情况\", \"服务完成后提供清洁报告\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'deep-cleaning', '69.00', 60, 'https://situationship.icu/upload/files/files-20260324004435-982e6e04.jpg', '#f3e5f5', '[\"上门服务\", \"深度清洁\", \"消毒杀菌\"]', 'active', 1, 2, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0),
(32, '定期维护铲屎服务', '每周定期上门铲屎服务，包括日常清理、猫砂更换、环境检查。适合工作繁忙的宠物主人，确保爱宠始终拥有干净的生活环境。', '[\"适用宠物: 猫咪、狗狗\", \"适用宠物性别: 公母均可\", \"服务范围: 室内宠物生活区域定期维护\", \"服务时长: 30分钟/次\", \"包含内容: 日常清理、猫砂更换、环境检查\", \"服务频率: 每周定期上门\", \"服务时间: 每日9:00-18:00\", \"适合工作繁忙的宠物主人\", \"服务完成后提供清洁报告\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'regular', '199.00', 30, 'https://situationship.icu/upload/files/files-20260324004442-c65e7653.jpg', '#e8f5e9', '[\"上门服务\", \"定期维护\", \"包月服务\"]', 'active', 1, 3, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0),
(33, '快速铲屎服务', '30分钟快速铲屎服务，适合紧急情况或临时需要。快速清理猫砂盆，更换猫砂，让您的爱宠立即拥有干净的环境。', '[\"适用宠物: 猫咪、狗狗\", \"适用宠物性别: 公母均可\", \"服务范围: 室内宠物生活区域快速清洁\", \"服务时长: 30分钟\", \"包含内容: 快速清理猫砂盆、更换猫砂\", \"服务时间: 每日9:00-18:00\", \"适合紧急情况或临时需要\", \"快速响应，立即服务\", \"服务完成后提供清洁报告\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'basic', '29.00', 30, 'https://situationship.icu/upload/files/files-20260324004449-019187b6.jpg', '#fff3e0', '[\"上门服务\", \"快速服务\"]', 'active', 0, 4, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0),
(34, '豪华铲屎套餐', '豪华铲屎套餐服务，包括深度清洁、消毒杀菌、更换高级猫砂、环境美化、宠物健康检查。全方位呵护您的爱宠。', '[\"适用宠物: 猫咪、狗狗\", \"适用宠物性别: 公母均可\", \"服务范围: 室内宠物生活区域豪华清洁\", \"服务时长: 90分钟\", \"包含内容: 深度清洁、消毒杀菌、更换高级猫砂、环境美化、宠物健康检查\", \"服务时间: 每日9:00-18:00\", \"全方位呵护您的爱宠\", \"使用高级猫砂和清洁用品\", \"服务完成后提供详细清洁报告和健康检查报告\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'deep-cleaning', '99.00', 90, 'https://situationship.icu/upload/files/files-20260324004457-7640c8be.jpg', '#fce4ec', '[\"上门服务\", \"豪华套餐\", \"健康检查\"]', 'active', 1, 5, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0),
(35, '多猫家庭铲屎服务', '专为多猫家庭设计的铲屎服务，包括多个猫砂盆的清理、大量猫砂更换、环境全面清洁。适合养有多只猫咪的家庭。', '[\"适用宠物: 多只猫咪\", \"适用宠物性别: 公母均可\", \"服务范围: 室内多猫生活区域全面清洁\", \"服务时长: 60分钟\", \"包含内容: 多个猫砂盆的清理、大量猫砂更换、环境全面清洁\", \"服务时间: 每日9:00-18:00\", \"专为多猫家庭设计\", \"适合养有多只猫咪的家庭\", \"服务完成后提供清洁报告\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'regular', '89.00', 60, 'https://situationship.icu/upload/files/files-20260324004505-55dedad8.jpg', '#e1f5fe', '[\"上门服务\", \"多猫家庭\", \"批量服务\"]', 'active', 0, 6, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0),
(36, '周末铲屎服务', '周末专属铲屎服务，让您在周末也能享受专业的铲屎服务。包括清理、更换猫砂、环境整理，让您和爱宠度过愉快的周末。', '[\"适用宠物: 猫咪、狗狗\", \"适用宠物性别: 公母均可\", \"服务范围: 室内宠物生活区域清洁\", \"服务时长: 30分钟\", \"包含内容: 清理、更换猫砂、环境整理\", \"服务时间: 周末9:00-18:00\", \"周末专属服务\", \"让您和爱宠度过愉快的周末\", \"服务完成后提供清洁报告\"]', '[\"购买后凭电子券码预约使用\", \"需提前2小时电话预约\", \"节假日价格可能浮动，详情请咨询客服\"]', 'basic', '45.00', 30, 'https://situationship.icu/upload/files/files-20260324004539-b6da9500.jpg', '#f1f8e9', '[\"上门服务\", \"周末服务\"]', 'active', 0, 7, '2025-11-06 16:00:03', '2025-11-06 16:00:03', 0);

-- --------------------------------------------------------

--
-- 表的结构 `litter_service_banners`
--

CREATE TABLE `litter_service_banners` (
  `id` bigint NOT NULL,
  `position` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `image_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'active',
  `sort_order` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='上门铲屎展示图' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `litter_service_banners`
--

INSERT INTO `litter_service_banners` (`id`, `position`, `image_url`, `title`, `description`, `status`, `sort_order`, `created_at`, `updated_at`, `is_deleted`) VALUES
(1, 'litter-page-top', 'https://situationship.icu/upload/files/files-20260328165952-1f4cb10a.jpg', '深度清洁.png', '展示图', 'active', 0, '2025-10-18 10:22:52', '2026-03-28 08:59:56', 0);

-- --------------------------------------------------------

--
-- 表的结构 `medical_service_banners`
--

CREATE TABLE `medical_service_banners` (
  `id` bigint NOT NULL,
  `title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `image_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `position` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `status` enum('active','inactive') CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'active',
  `sort_order` int NOT NULL DEFAULT '0',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `is_deleted` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='宠物医院展示图' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `medical_service_banners`
--

INSERT INTO `medical_service_banners` (`id`, `title`, `description`, `image_url`, `position`, `status`, `sort_order`, `created_at`, `updated_at`, `is_deleted`) VALUES
(2, '宠物医院展示图.png', '宠物医院服务页面顶部展示图', 'https://situationship.icu/upload/files/files-20260324002700-a68a8e6f.jpg', 'hospital-page-top', 'active', 1, '2026-03-24 00:27:01', '2026-03-24 00:27:01', 0);

-- --------------------------------------------------------

--
-- 表的结构 `message`
--

CREATE TABLE `message` (
  `id` bigint NOT NULL COMMENT '消息ID',
  `from_id` bigint NOT NULL COMMENT '发送者ID',
  `to_id` bigint NOT NULL COMMENT '接收者ID',
  `conversation_id` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '会话ID（格式：userId1_userId2，小的ID在前）',
  `status` int DEFAULT '0' COMMENT '状态：0-未读，1-已读',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '消息内容'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='私信表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `message`
--

INSERT INTO `message` (`id`, `from_id`, `to_id`, `conversation_id`, `status`, `create_time`, `content`) VALUES
(36, 75, -9999, 'platform_75', 1, '2026-03-24 00:40:27', '你好'),
(37, 75, -9999, 'platform_75', 1, '2026-03-24 00:41:29', '[图片]https://situationship.icu/upload/files/files-20260324084128-0c163cfd.jpg'),
(38, 75, 76, '75_76', 1, '2026-03-24 00:47:30', 'hello'),
(39, 75, -5, 'service_5_75', 1, '2026-03-24 00:56:06', '你好'),
(40, 76, -1, 'outlet_1_76', 1, '2026-03-25 04:02:16', '你好'),
(41, -1, 76, 'outlet_1_76', 1, '2026-03-25 04:02:27', '你好'),
(42, 76, -9999, 'platform_76', 1, '2026-03-28 14:52:24', '你好'),
(43, 76, 75, '75_76', 1, '2026-04-10 15:55:30', '你好'),
(44, 76, 75, '75_76', 1, '2026-04-12 18:34:30', '你好'),
(45, -1, 76, 'service_1_76', 1, '2026-04-14 09:54:58', '退款申请已通过\n订单号：ORD1776106127007\n退款金额：¥100.00\n退款说明：您的退款申请已通过审核，退款将在1-3个工作日内原路退回。'),
(46, 75, -5, 'service_5_75', 0, '2026-04-23 20:13:37', '你好'),
(47, 75, -2, 'outlet_2_75', 1, '2026-04-23 20:31:24', '你好'),
(48, 75, -1, 'outlet_1_75', 1, '2026-04-23 20:31:32', '你好'),
(49, 75, -9999, 'platform_75', 1, '2026-04-25 20:31:28', '你好'),
(50, 75, -9999, 'platform_75', 1, '2026-04-26 17:42:08', '你好'),
(51, 75, 79, '75_79', 0, '2026-04-26 17:42:29', '你好'),
(52, -1, 75, 'outlet_1_75', 1, '2026-04-26 18:00:54', '你好'),
(53, -9999, 75, 'platform_75', 1, '2026-04-26 18:09:31', '你好'),
(54, 75, -9999, 'platform_75', 1, '2026-04-26 18:19:27', '你好'),
(55, 75, -9999, 'platform_75', 1, '2026-04-26 18:33:00', '你好'),
(56, 75, -9999, 'platform_75', 1, '2026-04-26 18:33:56', '你好'),
(57, 75, -9999, 'platform_75', 1, '2026-04-27 06:19:03', '你好');

-- --------------------------------------------------------

--
-- 表的结构 `notice`
--

CREATE TABLE `notice` (
  `id` bigint NOT NULL COMMENT '公告ID',
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '公告标题',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '公告内容',
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'system' COMMENT '公告类型（system、marketing、update等）',
  `status` int DEFAULT '0' COMMENT '状态：0-草稿，1-已发布，2-已下线',
  `is_top` int DEFAULT '0' COMMENT '是否置顶：0-否，1-是',
  `effective_time` datetime DEFAULT NULL COMMENT '生效时间（为空则立即生效）',
  `expire_time` datetime DEFAULT NULL COMMENT '失效时间（为空则长期有效）',
  `sort_order` int DEFAULT '0' COMMENT '排序值（越大越靠前）',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='公告表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `notice`
--

INSERT INTO `notice` (`id`, `title`, `content`, `type`, `status`, `is_top`, `effective_time`, `expire_time`, `sort_order`, `create_time`, `update_time`) VALUES
(2, '系统更新', '系统更新', 'system', 1, 1, '2026-03-24 10:21:17', NULL, 0, '2026-03-24 10:21:30', '2026-03-24 10:21:30'),
(3, '测试1', '123', 'update', 1, 0, '2026-04-21 00:18:17', NULL, 0, '2026-04-21 00:18:20', '2026-04-21 00:18:20'),
(4, '测试2', '123', 'marketing', 1, 0, '2026-04-21 00:55:53', NULL, 3, '2026-04-21 00:55:56', '2026-04-21 00:55:56');

-- --------------------------------------------------------

--
-- 表的结构 `notification`
--

CREATE TABLE `notification` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` int DEFAULT '0',
  `read_time` datetime DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='系统通知表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `notification`
--

INSERT INTO `notification` (`id`, `user_id`, `title`, `content`, `type`, `status`, `read_time`, `create_time`, `update_time`) VALUES
(3, 70, '订单已完成', '您的订单 EX16 已完成，感谢您的购买。', 'order_status', 0, NULL, '2026-03-24 02:00:00', '2026-03-24 02:00:00'),
(4, 18, '订单已完成', '您的订单 ORD1768932703835 已完成，感谢您的购买。', 'order_status', 0, NULL, '2026-03-24 02:00:00', '2026-03-24 02:00:00'),
(5, 18, '订单已完成', '您的订单 ORD1768934902132 已完成，感谢您的购买。', 'order_status', 0, NULL, '2026-03-24 02:00:00', '2026-03-24 02:00:00'),
(6, 76, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-03-24 08:47:13', '2026-03-24 08:47:13'),
(7, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-03-24 08:49:22', '2026-03-24 08:49:22'),
(8, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-03-24 08:49:23', '2026-03-24 08:49:23'),
(9, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-03-24 08:49:24', '2026-03-24 08:49:24'),
(10, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-03-24 08:49:33', '2026-03-24 08:49:33'),
(11, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-03-24 08:49:42', '2026-03-24 08:49:42'),
(12, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-03-24 08:49:45', '2026-03-24 08:49:45'),
(13, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-03-24 08:49:55', '2026-03-24 08:49:55'),
(14, 75, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-03-24 08:51:36', '2026-03-24 08:51:36'),
(15, 75, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-03-24 09:29:19', '2026-03-24 09:29:19'),
(16, 76, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-03-24 09:29:20', '2026-03-24 09:29:20'),
(17, 76, '预约已确认', '您的上门铲屎预约已确认（预约单#34），服务时间：2026-03-25 11:00-12:00，服务地址：123', 'appointment_remind', 1, NULL, '2026-03-25 10:10:53', '2026-03-25 11:47:31'),
(18, 76, '预约已确认', '您的医院预约已确认（预约单#13），服务时间：2026-03-25 10:00-11:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-03-25 10:11:06', '2026-03-25 11:47:31'),
(19, 76, '预约已确认', '您的洗护预约已确认（预约单#21），服务时间：2026-03-26 10:00-11:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-03-25 14:31:21', '2026-03-25 14:31:30'),
(20, 76, '预约已确认', '您的医院预约已确认（预约单#14），服务时间：2026-03-26 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-03-26 02:44:04', '2026-03-28 17:39:16'),
(21, 76, '预约已变更', '您的医院预约已变更成功（预约单#14），新时间：2026-03-27 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-03-26 02:45:51', '2026-03-28 17:39:16'),
(22, 76, '订单已取消', '您的订单 ORD1774465476873 已取消。', 'order_status', 1, NULL, '2026-03-26 03:36:00', '2026-03-28 17:39:16'),
(23, 76, '预约已确认', '您的医院预约已确认（预约单#15），服务时间：2026-04-02 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-01 22:20:32', '2026-04-09 23:28:25'),
(24, 76, '预约已变更', '您的医院预约已变更成功（预约单#15），新时间：2026-04-03 15:00-16:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-01 22:43:51', '2026-04-09 23:28:25'),
(25, 76, '预约已确认', '您的医院预约已确认（预约单#16），服务时间：2026-04-02 10:00-11:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-01 22:44:01', '2026-04-09 23:28:25'),
(26, 76, '预约已确认', '您的医院预约已确认（预约单#17），服务时间：2026-04-04 15:00-16:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-03 01:00:35', '2026-04-09 23:28:25'),
(27, 75, '订单已发货', '您的订单 ORD1775151917049 已发货，请留意物流信息。', 'order_status', 1, NULL, '2026-04-03 01:47:39', '2026-04-13 02:34:42'),
(28, 75, '订单已发货', '您的订单 ORD1775152328279 已发货，请留意物流信息。', 'order_status', 1, NULL, '2026-04-03 01:52:36', '2026-04-13 02:34:42'),
(29, 77, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-09 23:14:30', '2026-04-09 23:14:30'),
(30, 77, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-09 23:15:18', '2026-04-09 23:15:18'),
(31, 75, '订单已完成', '您的订单 ORD1775151917049 已完成，感谢您的购买。', 'order_status', 1, NULL, '2026-04-10 02:00:00', '2026-04-13 02:34:42'),
(32, 75, '订单已完成', '您的订单 ORD1775152328279 已完成，感谢您的购买。', 'order_status', 1, NULL, '2026-04-10 02:00:00', '2026-04-13 02:34:42'),
(33, 77, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-04-12 17:13:48', '2026-04-12 17:13:48'),
(34, 76, '预约已确认', '您的医院预约已确认（预约单#18），服务时间：2026-04-14 15:00-16:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-13 00:58:24', '2026-04-13 00:58:35'),
(35, 76, '预约已确认', '您的医院预约已确认（预约单#19），服务时间：2026-04-14 16:00-17:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-13 00:58:25', '2026-04-13 00:58:35'),
(36, 76, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-13 02:36:17', '2026-04-13 02:36:17'),
(37, 76, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-13 02:36:23', '2026-04-13 02:36:23'),
(38, 77, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-13 02:42:30', '2026-04-13 02:42:30'),
(39, 76, '订单已发货', '您的订单 ORD1776106127007 已发货，请留意物流信息。', 'order_status', 1, NULL, '2026-04-14 17:14:47', '2026-04-15 02:35:00'),
(40, 76, '订单已完成', '您的订单 ORD1776106127007 已完成，感谢您的购买。', 'order_status', 1, NULL, '2026-04-14 17:23:01', '2026-04-15 02:35:00'),
(41, 76, '订单已完成', '您的订单 ORD1776156881362 已完成，感谢您的购买。', 'order_status', 0, NULL, '2026-04-15 02:39:42', '2026-04-15 02:39:42'),
(42, 77, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-04-20 04:53:20', '2026-04-20 04:53:20'),
(43, 75, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-04-20 05:27:12', '2026-04-20 05:27:12'),
(44, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-20 05:32:34', '2026-04-20 05:32:34'),
(45, 75, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-04-20 05:34:15', '2026-04-20 05:34:15'),
(46, 75, '预约已确认', '您的医院预约已确认（预约单#21），服务时间：2026-04-20 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-20 05:52:25', '2026-04-24 04:13:05'),
(47, 75, '预约已确认', '您的洗护预约已确认（预约单#22），服务时间：2026-04-21 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-20 06:08:58', '2026-04-24 04:13:05'),
(48, 79, '新粉丝', '有人关注了您', 'community_follow', 0, NULL, '2026-04-20 06:12:43', '2026-04-20 06:12:43'),
(49, 77, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-20 08:40:51', '2026-04-20 08:40:51'),
(50, 76, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-20 08:40:53', '2026-04-20 08:40:53'),
(51, 75, '预约已确认', '您的医院预约已确认（预约单#24），服务时间：2026-04-23 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-22 16:26:02', '2026-04-24 04:13:05'),
(52, 75, '预约已确认', '您的医院预约已确认（预约单#23），服务时间：2026-04-23 15:00-16:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-04-22 16:26:07', '2026-04-24 04:13:05'),
(53, 76, '变更申请被拒绝', '您的医院预约变更申请未通过（预约单#17），当前时间：2026-04-04 15:00-16:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 0, NULL, '2026-04-23 14:10:54', '2026-04-23 14:10:54'),
(54, 75, '订单已发货', '您的订单 EX42 已发货，请留意物流信息。', 'order_status', 1, NULL, '2026-04-24 01:58:50', '2026-04-24 04:13:05'),
(55, 75, '订单已完成', '您的订单 EX42 已完成，感谢您的购买。', 'order_status', 1, NULL, '2026-04-24 02:32:10', '2026-04-24 04:13:05'),
(56, 75, '订单已发货', '您的订单 EX49 已发货，请留意物流信息。', 'order_status', 1, NULL, '2026-04-26 04:10:35', '2026-04-30 06:47:19'),
(57, 75, '订单已发货', '您的订单 ORD1776624462665 已发货，请留意物流信息。', 'order_status', 1, NULL, '2026-04-26 04:15:48', '2026-04-30 06:47:19'),
(58, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 07:51:23', '2026-04-30 07:51:23'),
(59, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:51:33', '2026-04-30 07:51:33'),
(60, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:51:44', '2026-04-30 07:51:44'),
(61, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 07:51:49', '2026-04-30 07:51:49'),
(62, 79, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:52:04', '2026-04-30 07:52:04'),
(63, 79, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 07:52:09', '2026-04-30 07:52:09'),
(64, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 07:53:03', '2026-04-30 07:53:03'),
(65, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:53:07', '2026-04-30 07:53:07'),
(66, 75, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:53:19', '2026-04-30 07:53:19'),
(67, 75, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 07:53:23', '2026-04-30 07:53:23'),
(68, 79, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:58:36', '2026-04-30 07:58:36'),
(69, 79, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:58:44', '2026-04-30 07:58:44'),
(70, 79, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:58:50', '2026-04-30 07:58:50'),
(71, 79, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 07:58:56', '2026-04-30 07:58:56'),
(72, 79, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 08:03:47', '2026-04-30 08:03:47'),
(73, 79, '收到新评论', '有人评论了您的帖子', 'community_comment', 0, NULL, '2026-04-30 08:26:26', '2026-04-30 08:26:26'),
(74, 79, '收到新点赞', '有人赞了您的帖子', 'community_like', 0, NULL, '2026-04-30 08:26:31', '2026-04-30 08:26:31'),
(75, 75, '订单已取消', '您的订单 ORD1777661419831 已取消。', 'order_status', 1, NULL, '2026-05-02 02:50:31', '2026-05-02 02:51:06'),
(76, 75, '预约已确认', '您的医院预约已确认（预约单#26），服务时间：2026-05-03 08:00-09:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-05-03 00:04:54', '2026-05-03 00:47:20'),
(77, 75, '预约已确认', '您的医院预约已确认（预约单#27），服务时间：2026-05-04 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-05-03 00:17:59', '2026-05-03 00:47:20'),
(78, 75, '预约已确认', '您的医院预约已确认（预约单#28），服务时间：2026-05-05 09:00-10:00，服务地址：广州市天河区天河路567号宠物之家', 'appointment_remind', 1, NULL, '2026-05-03 00:19:25', '2026-05-03 00:47:20');

-- --------------------------------------------------------

--
-- 表的结构 `order_item`
--

CREATE TABLE `order_item` (
  `id` int NOT NULL,
  `order_id` int NOT NULL,
  `product_id` int NOT NULL,
  `product_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '鍟嗗搧',
  `product_image` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `spec_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `spec_price` decimal(10,2) DEFAULT NULL,
  `quantity` int NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商品订单表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `order_item`
--

INSERT INTO `order_item` (`id`, `order_id`, `product_id`, `product_name`, `product_image`, `spec_name`, `spec_price`, `quantity`, `price`, `create_time`, `update_time`) VALUES
(16, 24, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '', NULL, 5, '3.00', '2026-01-20 03:35:03', '2026-01-19 19:35:03'),
(17, 25, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '', NULL, 5, '3.00', '2026-01-20 03:39:07', '2026-01-19 19:39:07'),
(18, 26, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '', NULL, 3, '3.00', '2026-01-20 03:39:22', '2026-01-19 19:39:22'),
(19, 27, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '', NULL, 3, '3.00', '2026-01-20 03:40:24', '2026-01-19 19:40:24'),
(20, 28, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '', NULL, 3, '3.00', '2026-01-20 03:46:49', '2026-01-19 19:46:49'),
(21, 29, 2, '鸡肉猫粮', 'http://localhost:8080/upload/product/product-20251024170222-a989e5a7.jpg', '', NULL, 1, '120.00', '2026-01-20 03:57:45', '2026-01-19 19:57:45'),
(22, 30, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '500g', '3.00', 1, '3.00', '2026-01-20 16:56:12', '2026-01-20 08:56:12'),
(23, 31, 5, '22', 'http://localhost:8080/upload/product/product-20260110022000-a89a6c76.png', '积分兑换', NULL, 1, '0.00', '2026-01-20 17:53:58', '2026-01-20 09:53:58'),
(24, 32, 2, '鸡肉猫粮', 'http://localhost:8080/upload/product/product-20251024170222-a989e5a7.jpg', '', NULL, 1, '120.00', '2026-01-21 02:11:43', '2026-01-20 18:11:43'),
(25, 33, 2, '鸡肉猫粮', 'http://localhost:8080/upload/product/product-20251024170222-a989e5a7.jpg', '', NULL, 1, '120.00', '2026-01-21 02:28:45', '2026-01-20 18:28:45'),
(26, 34, 6, '猫草', 'http://localhost:8080/upload/product/product-20260119033412-2fe7433c.jpg', '500g', '3.00', 1, '3.00', '2026-01-21 02:32:47', '2026-01-20 18:32:47'),
(27, 35, 2, '鸡肉猫粮', 'http://localhost:8080/upload/product/product-20251024170222-a989e5a7.jpg', '', NULL, 1, '120.00', '2026-01-21 02:48:22', '2026-01-20 18:48:22'),
(28, 36, 9, '11', 'http://localhost:8080/upload/product/product-20260123224818-fb1ead10.jpg', '', NULL, 1, '1.00', '2026-01-23 23:55:46', '2026-01-23 15:55:46'),
(29, 37, 2, '鸡肉猫粮', 'http://172.27.186.18:8443/upload/product/product-20251024170222-a989e5a7.jpg', '', NULL, 1, '120.00', '2026-01-27 00:48:20', '2026-01-26 16:48:20'),
(30, 38, 34, '鸭肉干', 'https://situationship.icu/upload/product/product-20260324002136-4a7cd970.jpg', '', NULL, 1, '100.00', '2026-03-25 11:12:47', '2026-03-25 03:12:47'),
(31, 39, 34, '鸭肉干', 'https://situationship.icu/upload/product/product-20260324002136-4a7cd970.jpg', '', NULL, 1, '100.00', '2026-03-26 03:04:36', '2026-03-25 19:04:36'),
(32, 40, 16, 'Hills成猫粮', 'https://situationship.icu/upload/product/product-20260324000716-14462a9b.jpg', '', NULL, 1, '100.00', '2026-04-03 01:45:17', '2026-04-02 17:45:17'),
(33, 41, 16, 'Hills成猫粮', 'https://situationship.icu/upload/product/product-20260324000716-14462a9b.jpg', '', NULL, 1, '100.00', '2026-04-03 01:52:08', '2026-04-02 17:52:08'),
(34, 42, 34, '鸭肉干', 'https://situationship.icu/upload/product/product-20260324002136-4a7cd970.jpg', '', NULL, 1, '100.00', '2026-04-14 02:48:47', '2026-04-13 18:48:47'),
(35, 43, 34, '鸭肉干', 'https://situationship.icu/upload/product/product-20260324002136-4a7cd970.jpg', '', NULL, 1, '100.00', '2026-04-14 16:51:15', '2026-04-14 08:51:15'),
(36, 44, 30, '猫草', 'https://situationship.icu/upload/product/product-20260324001926-90a22571.jpg', '', NULL, 1, '100.00', '2026-04-14 16:54:41', '2026-04-14 08:54:41'),
(37, 45, 16, 'Hills成猫粮', 'https://situationship.icu/upload/product/product-20260324000716-14462a9b.jpg', '进口室内猫专研毛球系列,15.5磅', '700.00', 1, '700.00', '2026-04-20 02:47:42', '2026-04-19 18:47:42'),
(38, 46, 36, '喵仙草', 'https://situationship.icu/upload/product/product-20260402013111-0958cfb5.jpg', '积分兑换', NULL, 1, '0.00', '2026-04-20 05:21:50', '2026-04-19 21:21:50'),
(39, 47, 37, '纯鲜鸭肉干', 'https://situationship.icu/upload/product/product-20260424023003-38b54bd1.jpg', '积分兑换', NULL, 1, '0.00', '2026-04-24 03:13:11', '2026-04-23 19:13:11'),
(40, 48, 37, '纯鲜鸭肉干', 'https://situationship.icu/upload/product/product-20260424023003-38b54bd1.jpg', '积分兑换', NULL, 2, '1000.00', '2026-04-26 02:49:01', '2026-04-25 18:49:01'),
(41, 49, 33, '鸡肉干', 'https://situationship.icu/upload/product/product-20260324002049-6d77ee71.jpg', '', NULL, 1, '100.00', '2026-05-02 02:50:16', '2026-05-01 18:50:16'),
(42, 50, 33, '鸡肉干', 'https://situationship.icu/upload/product/product-20260324002049-6d77ee71.jpg', '', NULL, 1, '100.00', '2026-05-02 02:50:19', '2026-05-01 18:50:19');

-- --------------------------------------------------------

--
-- 表的结构 `order_logistics_track`
--

CREATE TABLE `order_logistics_track` (
  `id` bigint NOT NULL,
  `order_id` bigint NOT NULL COMMENT '订单ID',
  `tracking_time` datetime NOT NULL COMMENT '物流时间',
  `tracking_info` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '物流信息',
  `location` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '物流位置',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='订单物流跟踪记录表' ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- 表的结构 `payment`
--

CREATE TABLE `payment` (
  `id` int NOT NULL,
  `order_id` int NOT NULL,
  `payment_method` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `amount` decimal(10,2) NOT NULL,
  `status` int DEFAULT '0',
  `transaction_id` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `payment`
--

INSERT INTO `payment` (`id`, `order_id`, `payment_method`, `amount`, `status`, `transaction_id`, `create_time`, `update_time`) VALUES
(1, 1, 'WeChat Pay', '114.00', 1, 'wx202509300001', '2025-09-30 23:35:45', '2025-09-30 23:35:45');

-- --------------------------------------------------------

--
-- 表的结构 `pet`
--

CREATE TABLE `pet` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `species` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `breed` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `gender` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sterilization` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `dating` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `age` int DEFAULT NULL,
  `weight` decimal(5,2) DEFAULT NULL,
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'active',
  `birthday` date DEFAULT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `color` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `arrival_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='宠物表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `pet`
--

INSERT INTO `pet` (`id`, `user_id`, `name`, `species`, `breed`, `gender`, `sterilization`, `dating`, `age`, `weight`, `status`, `birthday`, `description`, `color`, `avatar`, `create_time`, `update_time`, `arrival_date`) VALUES
(5, 17, '小余', 'cat', '加菲猫', 'female', 'no', 'no', 0, '2.80', 'active', '2025-01-01', '爱吃啥,有啥特点~>', NULL, 'http://localhost:8080/upload/images/images-20251102155356-0db8438e.png', '2025-11-02 15:36:09', '2025-11-02 16:41:17', NULL),
(6, 18, '111', 'cat', '黑猫', 'male', 'yes', 'yes', 0, '27.50', 'active', '2026-01-01', '猪', NULL, 'https://localhost:8443/upload/images/images-20260130203243-53990470.png', '2026-01-06 17:16:39', '2026-01-30 20:33:26', '2026-01-30'),
(7, 70, '小鱼', 'cat', '狸花猫', 'female', 'no', 'no', 0, '26.00', 'active', '2026-01-01', '爱吃啥,有啥特点~>', NULL, 'http://localhost:8080/upload/images/images-20260109030726-8d19b7dd.png', '2026-01-09 03:07:02', '2026-01-09 03:07:43', NULL),
(8, 70, '22', 'cat', '金吉拉', 'female', NULL, NULL, 0, '7.00', 'active', '2026-01-01', '爱吃啥,有啥特点~>', NULL, 'http://tmp/0vsCoSG91PTa98b2f306622c0be979d82fb3e1bc7b29.png', '2026-01-09 03:13:15', '2026-01-09 03:13:15', NULL),
(13, 76, '1', 'cat', '黑猫', 'female', 'yes', 'no', 0, '5.50', 'active', '2026-01-01', '爱吃啥,有啥特点~>', NULL, 'https://situationship.icu/upload/files/files-20260324083022-119bc8ac.jpg', '2026-03-24 08:29:44', '2026-03-26 02:19:06', NULL),
(14, 76, '2', 'cat', '橘猫', 'male', 'unknown', 'no', 0, '4.00', 'active', '2026-01-01', '爱吃啥,有啥特点~>', NULL, 'http://tmp/oASfI9Y9nheE98b2f306622c0be979d82fb3e1bc7b29.png', '2026-03-24 08:34:05', '2026-03-24 08:34:05', NULL),
(17, 75, '1', 'cat', '英短蓝猫', 'female', 'yes', 'no', 0, '1.41', 'active', '2026-01-02', '爱吃啥,有啥特点~>', NULL, 'https://situationship.icu/upload/files/files-20260324083925-3ead04cb.jpg', '2026-03-24 08:39:26', '2026-04-30 07:07:56', NULL),
(19, 76, '123', 'dog', '拉布拉多', 'female', 'not-sterilized', 'no', 0, '2.90', 'active', '2026-01-01', '爱吃啥,有啥特点~>', NULL, 'http://tmp/3KeNaHA1eYAn0c56e6bf6d94f4dbcb380bbdc11a081f.png', '2026-04-11 18:55:29', '2026-04-11 18:55:29', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `pet_order`
--

CREATE TABLE `pet_order` (
  `id` bigint NOT NULL,
  `user_id` bigint NOT NULL,
  `order_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `total_amount` decimal(10,2) NOT NULL,
  `status` int DEFAULT '0',
  `payment_status` int DEFAULT '0',
  `delivery_status` int DEFAULT '0',
  `shipping_company` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '物流公司',
  `shipping_number` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '物流单号',
  `shipping_time` datetime DEFAULT NULL COMMENT '发货时间',
  `receiver_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收货人姓名',
  `receiver_phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收货人电话',
  `receiver_province` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收货省份',
  `receiver_city` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收货城市',
  `receiver_region` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收货区县',
  `receiver_detail_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收货详细地址',
  `warehouse_address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '发货仓地址',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品订单详情表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `pet_order`
--

INSERT INTO `pet_order` (`id`, `user_id`, `order_no`, `total_amount`, `status`, `payment_status`, `delivery_status`, `shipping_company`, `shipping_number`, `shipping_time`, `receiver_name`, `receiver_phone`, `receiver_province`, `receiver_city`, `receiver_region`, `receiver_detail_address`, `warehouse_address`, `create_time`, `update_time`) VALUES
(38, 76, 'ORD1774408367250', '100.00', 1, 0, 0, NULL, NULL, NULL, 'q', '15278562763', '广东省', '广州市', '花都区', '123', NULL, '2026-03-25 03:12:47', '2026-03-25 03:12:49'),
(39, 76, 'ORD1774465476873', '100.00', -1, 0, 0, NULL, NULL, NULL, 'q', '15278562763', '广东省', '广州市', '花都区', '123', NULL, '2026-03-25 19:04:36', '2026-03-25 19:36:00'),
(40, 75, 'ORD1775151917049', '100.00', -2, 0, 2, '顺丰快递', 'SF123456789', '2026-04-03 01:47:39', 'n', '13788223366', '北京市', '市辖区', '丰台区', '123', '深圳宝安区', '2026-04-02 17:45:17', '2026-04-23 18:53:39'),
(41, 75, 'ORD1775152328279', '100.00', 3, 0, 2, '顺丰快递', 'SF123456789', '2026-04-03 01:52:36', 'n', '13788223366', '广东省', '广州市', '越秀区', '123', '深圳宝安区', '2026-04-02 17:52:08', '2026-04-09 18:00:00'),
(42, 76, 'ORD1776106127007', '100.00', -2, 0, 2, '顺丰快递', 'SF123456789', '2026-04-14 17:15:17', 'q', '15278562763', '广东省', '广州市', '花都区', '123', '深圳宝安区', '2026-04-13 18:48:47', '2026-04-14 16:23:01'),
(43, 76, 'ORD1776156675886', '100.00', 1, 0, 0, NULL, NULL, NULL, 'q', '15278562763', '广东省', '广州市', '花都区', '123', NULL, '2026-04-14 08:51:15', '2026-04-14 08:51:18'),
(44, 76, 'ORD1776156881362', '100.00', 3, 0, 2, '顺丰快递', 'SF123456789', '2026-04-15 00:23:34', 'q', '15278562763', '广东省', '广州市', '花都区', '123', '深圳宝安区', '2026-04-14 08:54:41', '2026-04-14 18:39:41'),
(45, 75, 'ORD1776624462665', '700.00', 2, 0, 1, '顺丰快递', 'SF123456789', '2026-04-26 04:15:48', '1', '15278562769', '广东省', '广州市', '越秀区', '123', '深圳宝安区', '2026-04-19 18:47:42', '2026-04-26 17:50:53'),
(46, 75, 'EX42', '0.00', -2, 1, 2, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-19 21:21:51', '2026-04-23 19:12:33'),
(47, 75, 'EX48', '0.00', 1, 1, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-04-23 19:13:11', '2026-04-23 19:13:11'),
(48, 75, 'EX49', '2000.00', 2, 1, 1, '顺丰快递', 'SF123456789', '2026-04-27 01:50:21', '测试2', '15278562763', '广东省', '中山市', '民众街道', '123', '深圳宝安区', '2026-04-25 18:49:01', '2026-04-26 17:50:25'),
(49, 75, 'ORD1777661416039', '100.00', -1, 0, 0, NULL, NULL, NULL, '测试2', '15278562763', '广东省', '中山市', '民众街道', '123', NULL, '2026-05-01 18:50:16', '2026-05-01 19:20:16'),
(50, 75, 'ORD1777661419831', '100.00', -1, 0, 0, NULL, NULL, NULL, '测试2', '15278562763', '广东省', '中山市', '民众街道', '123', NULL, '2026-05-01 18:50:19', '2026-05-01 18:50:31');

-- --------------------------------------------------------

--
-- 表的结构 `points_record`
--

CREATE TABLE `points_record` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `points` int NOT NULL,
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='积分明细表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `points_record`
--

INSERT INTO `points_record` (`id`, `user_id`, `points`, `type`, `description`, `create_time`) VALUES
(1, 5, 10, 'earn', '每日签到奖励', '2025-10-03 15:04:56'),
(2, 70, 60, 'earn', '发布内容', '2026-01-09 16:42:10'),
(3, 70, 10, 'earn', '点赞评论', '2026-01-09 17:07:23'),
(4, 70, 10, 'earn', '每日签到: 累计签到4天', '2026-01-10 01:48:59'),
(5, 70, 1000, 'spend', '兑换商品: 22', '2026-01-10 02:52:46'),
(6, 70, 3000, 'spend', '兑换商品: 11', '2026-01-10 02:58:23'),
(7, 70, 10, 'earn', '每日签到: 累计签到1天', '2026-01-12 01:34:46'),
(8, 64, 10, 'earn', '每日签到: 累计签到1天', '2026-01-12 21:08:54'),
(9, 70, 10, 'earn', '每日签到: 累计签到2天', '2026-01-13 01:13:46'),
(10, 64, 10, 'earn', '每日签到: 累计签到1天', '2026-01-16 04:15:53'),
(11, 64, 10, 'earn', '每日签到: 累计签到2天', '2026-01-17 00:24:50'),
(12, 64, 10, 'earn', '每日签到: 累计签到1天', '2026-01-19 03:44:16'),
(13, 64, 10, 'earn', '每日签到: 累计签到2天', '2026-01-20 03:58:18'),
(14, 70, 1000, 'spend', '兑换商品: 22', '2026-01-20 03:59:14'),
(15, 70, 1000, 'spend', '兑换商品: 22', '2026-01-20 17:33:01'),
(16, 70, 1000, 'spend', '兑换商品: 22', '2026-01-20 17:53:59'),
(17, 70, 10, 'earn', '每日签到: 累计签到1天', '2026-01-23 23:54:51'),
(18, 72, 120, 'earn', '新手任务: 微信注册账号', '2026-01-28 05:34:21'),
(19, 64, 10, 'earn', '每日签到: 累计签到1天', '2026-01-28 06:01:50'),
(20, 70, 10, 'earn', '每日签到: 累计签到1天', '2026-01-28 06:08:04'),
(21, 64, 10, 'earn', '每日签到: 累计签到2天', '2026-01-29 04:56:06'),
(22, 64, 10, 'earn', '每日签到: 累计签到3天', '2026-01-30 20:53:14'),
(23, 70, 10, 'earn', '每日签到: 累计签到1天', '2026-01-30 21:39:39'),
(24, 70, 10, 'earn', '每日签到（连续1天）', '2026-02-02 01:22:51'),
(25, 70, 10, 'earn', '每日签到（连续2天）', '2026-02-03 02:46:27'),
(26, 73, 120, 'earn', '新用户注册（微信）', '2026-03-24 08:12:19'),
(27, 74, 10, 'earn', '每日签到（连续1天）', '2026-03-24 08:17:36'),
(28, 75, 120, 'earn', '新用户注册', '2026-03-24 08:27:33'),
(29, 76, 120, 'earn', '新用户注册（微信）', '2026-03-24 08:27:48'),
(30, 75, 10, 'earn', '每日签到（连续1天）', '2026-03-24 08:57:37'),
(31, 77, 120, 'earn', '新用户注册（微信）', '2026-03-24 09:27:06'),
(32, 76, 10, 'earn', '每日签到（连续1天）', '2026-04-02 01:23:34'),
(33, 76, 10, 'earn', '每日签到（连续1天）', '2026-04-11 18:57:09'),
(34, 76, 10, 'earn', '每日签到（连续2天）', '2026-04-12 03:48:57'),
(35, 76, 20, 'earn', '任务奖励：点赞内容', '2026-04-12 17:40:32'),
(36, 76, 10, 'earn', '每日签到（连续3天）', '2026-04-13 19:07:35'),
(37, 75, 10, 'earn', '每日签到（连续1天）', '2026-04-14 01:59:20'),
(38, 76, 10, 'earn', '每日签到（连续1天）', '2026-04-15 02:52:25'),
(39, 78, 120, 'earn', '新用户注册（微信）', '2026-04-18 17:06:19'),
(40, 79, 120, 'earn', '新用户注册', '2026-04-18 17:09:32'),
(41, 80, 120, 'earn', '新用户注册（微信）', '2026-04-19 18:08:56'),
(42, 75, 1000, 'spend', '兑换：喵仙草', '2026-04-20 05:21:50'),
(43, 75, 10, 'earn', '每日签到（连续1天）', '2026-04-20 06:12:53'),
(44, 75, 10, 'earn', '每日签到（连续2天）', '2026-04-21 20:10:41'),
(45, 80, 10, 'earn', '每日签到（连续1天）', '2026-04-21 20:10:59'),
(46, 79, 10, 'earn', '每日签到（连续1天）', '2026-04-21 20:11:22'),
(47, 75, 10, 'earn', '每日签到（连续1天）', '2026-04-24 02:15:52'),
(48, 75, 1000, 'spend', '兑换：纯鲜鸭肉干', '2026-04-24 03:13:11'),
(49, 75, 2000, 'spend', '兑换：纯鲜鸭肉干', '2026-04-26 02:49:01'),
(50, 81, 120, 'earn', '新用户注册（微信）', '2026-04-28 20:19:22'),
(51, 82, 120, 'earn', '新用户注册（微信）', '2026-04-28 21:08:09');

-- --------------------------------------------------------

--
-- 表的结构 `post`
--

CREATE TABLE `post` (
  `id` bigint NOT NULL,
  `user_id` bigint NOT NULL,
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `tags` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '标签列表，用逗号分隔',
  `images` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `videos` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '视频列表(JSON格式，包含视频URL和封面)',
  `likes_count` int DEFAULT '0',
  `comments_count` int DEFAULT '0',
  `status` int DEFAULT '1',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `is_top` tinyint(1) DEFAULT '0' COMMENT '是否置顶',
  `is_hot` tinyint(1) DEFAULT '0' COMMENT '是否热门',
  `exposure_score` double DEFAULT '0' COMMENT '曝光分数，用于热度算法',
  `views_count` int DEFAULT '0' COMMENT '浏览数',
  `shares_count` int DEFAULT '0' COMMENT '分享数',
  `image_count` int DEFAULT '0' COMMENT '图片数量',
  `cover_image` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '封面图片'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='帖子表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `post`
--

INSERT INTO `post` (`id`, `user_id`, `title`, `content`, `category`, `tags`, `images`, `videos`, `likes_count`, `comments_count`, `status`, `create_time`, `update_time`, `is_top`, `is_hot`, `exposure_score`, `views_count`, `shares_count`, `image_count`, `cover_image`) VALUES
(64, 75, '这种猫就好养就乖', '', '推荐', '猫咪,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421003506-9e726232.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421003506-ae817e47.jpeg\",\"duration\":11}]', 1000, 103, 1, '2026-04-20 16:35:07', '2026-04-20 16:50:17', 0, 1, 229.3547619047618, 1000, 100, 0, 'https://situationship.icu/upload/files/files-20260421003506-ae817e47.jpeg'),
(65, 75, '猫咪冷知识', '', '推荐', '养宠知识,猫咪', '[\"https://situationship.icu/upload/files/files-20260421164546-c8609f23.jpg\",\"https://situationship.icu/upload/files/files-20260421164547-f4e385a0.jpg\",\"https://situationship.icu/upload/files/files-20260421164547-1503f2d0.jpg\",\"https://situationship.icu/upload/files/files-20260421164548-bd910739.jpg\",\"https://situationship.icu/upload/files/files-20260421164548-5d7ce786.jpg\",\"https://situationship.icu/upload/files/files-20260421164548-6b5c3231.jpg\",\"https://situationship.icu/upload/files/files-20260421164548-c982d023.jpg\",\"https://situationship.icu/upload/files/files-20260421164548-a6c8ea11.jpg\",\"https://situationship.icu/upload/files/files-20260421164549-bda88da4.jpg\"]', NULL, 900, 94, 1, '2026-04-21 08:45:49', '2026-04-21 08:46:14', 0, 1, 66.17380952380952, 917, 90, 9, 'https://situationship.icu/upload/files/files-20260421164546-c8609f23.jpg'),
(66, 75, '狗狗的秘密，你知道几个?', '', '推荐', '狗狗', '[\"https://situationship.icu/upload/files/files-20260421170410-8b653f70.jpg\",\"https://situationship.icu/upload/files/files-20260421170410-db99e8ca.jpg\",\"https://situationship.icu/upload/files/files-20260421170411-fce2e19c.jpg\",\"https://situationship.icu/upload/files/files-20260421170411-12ba487a.jpg\",\"https://situationship.icu/upload/files/files-20260421170411-ea325787.jpg\",\"https://situationship.icu/upload/files/files-20260421170411-780f0556.jpg\",\"https://situationship.icu/upload/files/files-20260421170412-cba7bf92.jpg\"]', NULL, 800, 80, 0, '2026-04-21 09:04:12', '2026-04-21 09:05:14', 0, 0, 0.30000000000000004, 800, 80, 7, 'https://situationship.icu/upload/files/files-20260421170410-8b653f70.jpg'),
(67, 75, '狗狗的秘密，你知道几个?', '', '推荐', '狗狗', '[\"https://situationship.icu/upload/files/files-20260421170620-82581c0c.jpg\",\"https://situationship.icu/upload/files/files-20260421170620-07a93eb5.jpg\",\"https://situationship.icu/upload/files/files-20260421170620-f60019e5.jpg\",\"https://situationship.icu/upload/files/files-20260421170620-6f788855.jpg\",\"https://situationship.icu/upload/files/files-20260421170621-bb59f198.jpg\",\"https://situationship.icu/upload/files/files-20260421170621-f9830340.jpg\",\"https://situationship.icu/upload/files/files-20260421170621-ad2ea3f1.jpg\"]', NULL, 700, 70, 1, '2026-04-21 09:06:22', '2026-04-21 09:06:27', 0, 1, 40.74999999999999, 700, 70, 7, 'https://situationship.icu/upload/files/files-20260421170620-82581c0c.jpg'),
(68, 75, '幼犬到家须知', '', '推荐', '狗狗,养宠知识', '[\"https://situationship.icu/upload/files/files-20260421171800-9598a2ab.jpg\",\"https://situationship.icu/upload/files/files-20260421171800-c78d93a8.jpg\",\"https://situationship.icu/upload/files/files-20260421171800-61610da5.jpg\",\"https://situationship.icu/upload/files/files-20260421171800-e0d3586b.jpg\",\"https://situationship.icu/upload/files/files-20260421171800-6a51cd81.jpg\",\"https://situationship.icu/upload/files/files-20260421171801-fa051829.jpg\"]', NULL, 600, 60, 1, '2026-04-21 09:18:01', '2026-04-21 09:18:13', 0, 1, 40.74999999999999, 600, 60, 6, 'https://situationship.icu/upload/files/files-20260421171800-9598a2ab.jpg'),
(69, 75, '长大真好啊，可以拥有自己的小狗🐶', '', '推荐', '狗狗,记录,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421172238-5763b1c6.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421172238-fc674ef0.jpeg\",\"duration\":21}]', 500, 50, 1, '2026-04-21 09:22:39', '2026-04-21 09:24:24', 0, 1, 46.94999999999999, 500, 50, 0, 'https://situationship.icu/upload/files/files-20260421172238-fc674ef0.jpeg'),
(70, 79, '新手养狗需知🐶幼犬到家这些事不要做❗️', '接幼犬到家这些事不要做❗️', '推荐', '养宠知识,狗狗', '[\"https://situationship.icu/upload/files/files-20260421201912-0453cb81.jpg\",\"https://situationship.icu/upload/files/files-20260421201913-7484b978.jpg\",\"https://situationship.icu/upload/files/files-20260421201913-8ab01a6f.jpg\",\"https://situationship.icu/upload/files/files-20260421201913-c64f37f7.jpg\",\"https://situationship.icu/upload/files/files-20260421201913-aa4af7b3.jpg\"]', NULL, 400, 40, 1, '2026-04-21 12:19:14', '2026-04-21 13:33:46', 0, 1, 46.17857142857142, 400, 40, 5, 'https://situationship.icu/upload/files/files-20260421201912-0453cb81.jpg'),
(71, 79, '恭喜你！狗狗这几种表现是偷偷认主了！', '恭喜你！狗狗这几种表现是偷偷认主了！', '推荐', '狗狗,养宠知识', '[\"https://situationship.icu/upload/files/files-20260421202442-f6dc7893.jpg\",\"https://situationship.icu/upload/files/files-20260421202443-d01b252c.jpg\",\"https://situationship.icu/upload/files/files-20260421202443-99be66bc.jpg\",\"https://situationship.icu/upload/files/files-20260421202443-e5fdc32f.jpg\",\"https://situationship.icu/upload/files/files-20260421202443-fa622535.jpg\",\"https://situationship.icu/upload/files/files-20260421202443-07a87917.jpg\",\"https://situationship.icu/upload/files/files-20260421202444-469ac70c.jpg\",\"https://situationship.icu/upload/files/files-20260421202444-39f26364.jpg\",\"https://situationship.icu/upload/files/files-20260421202444-d510bcb4.jpg\"]', NULL, 300, 30, 1, '2026-04-21 12:24:44', '2026-04-21 13:33:44', 0, 1, 38.17857142857143, 300, 30, 9, 'https://situationship.icu/upload/files/files-20260421202442-f6dc7893.jpg'),
(72, 79, '别让狗狗讨厌你', '', '推荐', '狗狗,养宠知识', '[\"https://situationship.icu/upload/files/files-20260421204121-aa2a6843.jpg\",\"https://situationship.icu/upload/files/files-20260421204121-336ca2ca.jpg\",\"https://situationship.icu/upload/files/files-20260421204121-29dbd7df.jpg\",\"https://situationship.icu/upload/files/files-20260421204121-bf1dfcdb.jpg\",\"https://situationship.icu/upload/files/files-20260421204121-160ff02a.jpg\"]', NULL, 200, 20, 1, '2026-04-21 12:41:22', '2026-04-21 13:33:42', 0, 1, 38.17857142857143, 200, 20, 5, 'https://situationship.icu/upload/files/files-20260421204121-aa2a6843.jpg'),
(73, 79, '宠物搞笑瞬间', '', '推荐', '搞笑,视频,记录', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421213616-de4fc8c1.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421213616-63182093.jpeg\",\"duration\":11}]', 100, 10, 1, '2026-04-21 13:36:17', '2026-04-21 14:12:36', 0, 1, 46.3047619047619, 100, 10, 0, 'https://situationship.icu/upload/files/files-20260421213616-63182093.jpeg'),
(74, 79, '笑得我发抖…甩下来怎么还自带慢动作', '', '推荐', '猫咪,搞笑,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421215833-85310b1b.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421215833-d1798815.jpeg\",\"duration\":11}]', 90, 11, 1, '2026-04-21 13:58:34', '2026-04-21 14:12:34', 0, 1, 48.754761904761914, 101, 9, 0, 'https://situationship.icu/upload/files/files-20260421215833-d1798815.jpeg'),
(75, 79, '猫咪不会说的秘密', '', '推荐', '养宠知识,猫咪,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421220448-6d94657a.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421220448-4c0b0975.jpeg\",\"duration\":31}]', 80, 12, 1, '2026-04-21 14:04:49', '2026-04-21 14:12:32', 0, 1, 66.13095238095238, 96, 8, 0, 'https://situationship.icu/upload/files/files-20260421220448-4c0b0975.jpeg'),
(76, 79, '狗狗不能常吃的食物有哪一些?', '', '推荐', '养宠知识,狗狗,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421221211-b944b2c3.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421221211-3c46bbec.jpeg\",\"duration\":18}]', 70, 7, 1, '2026-04-21 14:12:12', '2026-04-21 14:12:30', 0, 1, 46.78095238095237, 70, 7, 0, 'https://situationship.icu/upload/files/files-20260421221211-3c46bbec.jpeg'),
(77, 79, '起飞失败', '', '推荐', '搞笑,记录,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421224217-55dc6a23.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421224217-1a854335.jpeg\",\"duration\":7}]', 60, 6, 1, '2026-04-21 14:42:18', '2026-04-21 15:02:17', 0, 1, 38.13095238095238, 60, 6, 0, 'https://situationship.icu/upload/files/files-20260421224217-1a854335.jpeg'),
(78, 79, '动物的迷惑行为', '', '推荐', '搞笑,记录,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421225920-0dd95ddf.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421225920-206b07de.jpeg\",\"duration\":61}]', 1800, 5, 1, '2026-04-21 14:59:22', '2026-04-21 15:02:15', 0, 1, 46.18095238095238, 50, 5, 0, 'https://situationship.icu/upload/files/files-20260421225920-206b07de.jpeg'),
(79, 79, '瞌睡中……', '', '推荐', '视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421230517-7a092be8.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421230517-83e8f980.jpeg\",\"duration\":10}]', 40, 4, 1, '2026-04-21 15:05:18', '2026-04-21 15:05:55', 0, 1, 38.607142857142854, 40, 4, 0, 'https://situationship.icu/upload/files/files-20260421230517-83e8f980.jpeg'),
(80, 79, '下一届猫猫运动会跳水选手已就位', '', '推荐', '视频,猫咪', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421230917-f1347575.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421230917-9df01806.jpeg\",\"duration\":9}]', 30, 5, 1, '2026-04-21 15:09:19', '2026-04-21 15:22:01', 0, 1, 46.90714285714286, 33, 3, 0, 'https://situationship.icu/upload/files/files-20260421230917-9df01806.jpeg'),
(81, 79, '动物一败涂地', '', '推荐', '搞笑,视频,记录', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421231145-4baed681.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421231145-d81b2aee.jpeg\",\"duration\":38}]', 2000, 2, 1, '2026-04-21 15:11:46', '2026-04-21 15:22:00', 0, 1, 46.70714285714285, 20, 2, 0, 'https://situationship.icu/upload/files/files-20260421231145-d81b2aee.jpeg'),
(82, 79, '猫猫的行为艺术', '', '推荐', '记录,搞笑,猫咪,视频', '[]', '[{\"url\":\"https://video.situationship.icu/files/files-20260421232145-455eaecb.mp4\",\"thumb\":\"https://situationship.icu/upload/files/files-20260421232146-37af1f54.jpeg\",\"duration\":97}]', 1900, 3, 1, '2026-04-21 15:21:47', '2026-04-29 23:28:44', 0, 1, 80.50714285714284, 11, 1, 0, 'https://situationship.icu/upload/files/files-20260421232146-37af1f54.jpeg');

-- --------------------------------------------------------

--
-- 表的结构 `post_collect`
--

CREATE TABLE `post_collect` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `post_id` bigint NOT NULL COMMENT '帖子ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='帖子收藏表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `post_collect`
--

INSERT INTO `post_collect` (`id`, `post_id`, `user_id`, `create_time`) VALUES
(2, 35, 70, '2026-01-07 03:34:59'),
(5, 22, 70, '2026-01-12 03:50:46'),
(8, 40, 70, '2026-01-12 16:45:11'),
(9, 35, 18, '2026-01-12 21:30:11'),
(10, 34, 18, '2026-01-19 03:43:34'),
(21, 42, 72, '2026-01-30 01:51:18'),
(24, 23, 70, '2026-02-03 03:54:19'),
(27, 62, 76, '2026-04-13 19:01:24'),
(28, 62, 75, '2026-04-20 04:54:10'),
(29, 54, 75, '2026-04-20 04:54:16'),
(30, 59, 75, '2026-04-20 04:54:21'),
(31, 64, 75, '2026-04-24 02:14:47'),
(32, 65, 80, '2026-04-30 07:51:25'),
(33, 65, 79, '2026-04-30 07:53:12'),
(34, 64, 79, '2026-04-30 07:53:23'),
(35, 74, 79, '2026-04-30 07:54:39'),
(36, 80, 79, '2026-04-30 07:54:47'),
(37, 82, 79, '2026-04-30 07:55:03');

-- --------------------------------------------------------

--
-- 表的结构 `post_like`
--

CREATE TABLE `post_like` (
  `id` int NOT NULL,
  `post_id` int NOT NULL,
  `user_id` int NOT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='帖子点赞表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `post_like`
--

INSERT INTO `post_like` (`id`, `post_id`, `user_id`, `create_time`) VALUES
(1, 4, 1, '2025-10-27 22:30:27'),
(2, 4, 18, '2025-10-28 13:23:20'),
(3, 1, 18, '2025-10-28 13:23:22'),
(4, 3, 18, '2025-10-28 13:23:23'),
(5, 9, 18, '2025-10-28 16:56:38'),
(10, 15, 18, '2025-11-01 21:17:49'),
(11, 18, 17, '2025-11-02 22:09:27'),
(21, 18, 62, '2025-11-24 10:46:37'),
(22, 22, 62, '2025-11-25 17:20:31'),
(28, 21, 18, '2025-11-27 23:31:54'),
(30, 19, 18, '2025-11-27 23:32:02'),
(45, 21, 70, '2026-01-07 02:33:07'),
(46, 20, 70, '2026-01-07 02:33:11'),
(54, 36, 70, '2026-01-11 03:46:23'),
(55, 35, 70, '2026-01-11 04:06:54'),
(58, 39, 70, '2026-01-12 03:40:17'),
(59, 38, 70, '2026-01-12 03:40:19'),
(60, 37, 70, '2026-01-12 03:40:19'),
(62, 40, 70, '2026-01-12 16:40:59'),
(63, 20, 18, '2026-01-12 21:07:09'),
(64, 23, 18, '2026-01-12 21:07:11'),
(65, 35, 18, '2026-01-12 21:10:58'),
(66, 39, 18, '2026-01-12 21:11:05'),
(67, 40, 18, '2026-01-12 21:11:06'),
(68, 38, 18, '2026-01-12 21:11:07'),
(69, 37, 18, '2026-01-12 21:11:08'),
(70, 36, 18, '2026-01-12 21:11:10'),
(73, 34, 70, '2026-01-13 02:55:16'),
(74, 34, 18, '2026-01-19 03:43:26'),
(75, 43, 70, '2026-01-28 06:46:43'),
(77, 22, 18, '2026-01-29 05:10:19'),
(79, 45, 70, '2026-01-29 07:52:52'),
(80, 41, 70, '2026-01-29 07:52:53'),
(81, 44, 70, '2026-01-29 07:52:55'),
(88, 23, 70, '2026-01-29 08:04:15'),
(100, 22, 72, '2026-01-30 01:46:32'),
(101, 42, 72, '2026-01-30 01:51:12'),
(102, 54, 76, '2026-03-24 08:49:22'),
(103, 53, 76, '2026-03-24 08:49:23'),
(104, 52, 76, '2026-03-24 08:49:24'),
(106, 60, 76, '2026-04-09 23:14:30'),
(107, 58, 76, '2026-04-12 03:57:30'),
(109, 62, 75, '2026-04-13 02:36:17'),
(111, 62, 76, '2026-04-13 19:01:22'),
(112, 53, 75, '2026-04-20 04:54:31'),
(113, 52, 75, '2026-04-20 04:54:33'),
(114, 53, 80, '2026-04-20 05:32:34'),
(115, 59, 75, '2026-04-20 08:40:51'),
(116, 57, 75, '2026-04-20 08:40:53'),
(117, 65, 75, '2026-04-30 07:40:01'),
(118, 64, 75, '2026-04-30 07:40:02'),
(119, 67, 75, '2026-04-30 07:40:03'),
(120, 68, 75, '2026-04-30 07:40:04'),
(121, 65, 80, '2026-04-30 07:51:23'),
(122, 64, 80, '2026-04-30 07:51:49'),
(123, 75, 80, '2026-04-30 07:52:09'),
(124, 65, 79, '2026-04-30 07:53:03'),
(125, 64, 79, '2026-04-30 07:53:23'),
(126, 75, 79, '2026-04-30 07:53:40'),
(127, 74, 79, '2026-04-30 07:54:31'),
(128, 80, 79, '2026-04-30 07:54:47'),
(129, 82, 79, '2026-04-30 07:55:03'),
(130, 74, 80, '2026-04-30 08:03:47'),
(131, 75, 75, '2026-04-30 08:26:31');

-- --------------------------------------------------------

--
-- 表的结构 `post_tag`
--

CREATE TABLE `post_tag` (
  `post_id` bigint NOT NULL COMMENT '帖子ID',
  `tag_id` bigint NOT NULL COMMENT '标签ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='帖子标签关联表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `post_tag`
--

INSERT INTO `post_tag` (`post_id`, `tag_id`) VALUES
(64, 4),
(64, 5),
(65, 5),
(65, 7),
(66, 6),
(67, 6),
(68, 6),
(68, 7),
(69, 4),
(69, 6),
(69, 9),
(70, 6),
(70, 7),
(71, 6),
(71, 7),
(72, 6),
(72, 7),
(73, 4),
(73, 8),
(73, 9),
(74, 4),
(74, 5),
(74, 8),
(75, 4),
(75, 5),
(75, 7),
(76, 4),
(76, 6),
(76, 7),
(77, 4),
(77, 8),
(77, 9),
(78, 4),
(78, 8),
(78, 9),
(79, 4),
(80, 4),
(80, 5),
(81, 4),
(81, 8),
(81, 9),
(82, 4),
(82, 5),
(82, 8),
(82, 9);

-- --------------------------------------------------------

--
-- 表的结构 `product`
--

CREATE TABLE `product` (
  `id` bigint NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `price` decimal(10,2) NOT NULL,
  `stock` int DEFAULT '0',
  `category` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `brand` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `store_id` bigint DEFAULT NULL COMMENT '店铺ID',
  `image` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'onsale',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `detail_images` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `features` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `params` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `services` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '服务承诺（JSON格式，存储服务列表）',
  `specs` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '购买类型/规格（JSON格式，存储规格列表）',
  `is_hot` tinyint(1) DEFAULT '0' COMMENT '是否热门推荐'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `product`
--

INSERT INTO `product` (`id`, `name`, `description`, `price`, `stock`, `category`, `brand`, `store_id`, `image`, `status`, `create_time`, `update_time`, `detail_images`, `features`, `params`, `services`, `specs`, `is_hot`) VALUES
(10, 'Acana海洋鱼猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260323233307-6ea3ee0c.jpg', '1', '2026-03-23 15:34:28', '2026-03-23 15:34:28', '[\"product/product-20260323233337-94e8348b.jpg\",\"product/product-20260323233340-6d4fd01b.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(11, 'Acana鸭肉梨狗粮', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260323233450-7aa32c84.jpg', '1', '2026-03-23 15:35:08', '2026-03-23 15:35:08', '[\"product/product-20260323233505-fd762981.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(13, 'Canidae三文鱼猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260324000421-18850284.jpg', '1', '2026-03-23 16:04:37', '2026-03-23 16:04:37', '[\"product/product-20260324000435-f89a7ef6.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(14, 'Canidae鸡肉猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260324000458-0920d914.jpg', '1', '2026-03-23 16:06:06', '2026-03-23 16:06:06', '[\"product/product-20260324000604-902cd605.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(15, 'Fromm三文鱼鸭肉', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260324000618-0c9fd3ae.jpg', '1', '2026-03-23 16:06:49', '2026-03-23 16:06:49', '[\"product/product-20260324000648-fbb83b41.jpg\"]', NULL, NULL, '[\"免费包邮\",\"48小时内发货\",\"退货包运费\",\"七天无理由退货\"]', NULL, 0),
(16, 'Hills成猫粮', '暂无描述', '100.00', 97, '猫粮', NULL, 5, 'product/product-20260324000716-14462a9b.jpg', '1', '2026-03-23 16:07:32', '2026-04-19 18:47:45', '[\"/upload/product/product-20260324000731-e6e2fe7a.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"免费包邮\",\"48小时内发货\"]', '[{\"name\":\"款式\",\"values\":[\"进口室内猫专研毛球系列\"]},{\"name\":\"型号\",\"values\":[{\"name\":\"15.5磅\",\"price\":700},{\"name\":\"7磅\",\"price\":322}]}]', 1),
(17, 'NOW成猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260324000857-fc66671c.jpg', '1', '2026-03-23 16:09:13', '2026-03-23 16:09:13', '[\"product/product-20260324000912-4775bce6.jpg\"]', NULL, NULL, '[\"48小时内发货\",\"免费包邮\",\"退货包运费\",\"七天无理由退货\"]', NULL, 0),
(18, 'Orijen六鱼狗粮', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260324000925-ba9a936c.jpg', '1', '2026-03-23 16:09:48', '2026-03-23 16:09:48', '[\"product/product-20260324000946-fd6d129e.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(19, 'Orijen鸡肉猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260324001011-3518a2f5.jpg', '1', '2026-03-23 16:10:27', '2026-03-23 16:23:26', '[\"product/product-20260324001024-cab6f9ab.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 1),
(20, '普瑞纳幼犬粮', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260324001039-7ee9f888.jpg', '1', '2026-03-23 16:10:55', '2026-03-23 16:10:55', '[\"product/product-20260324001053-3ed2c2d6.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(21, '普瑞纳幼猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260324001115-576fa301.jpg', '1', '2026-03-23 16:11:31', '2026-03-23 16:11:31', '[\"product/product-20260324001128-3fbff214.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(22, '比瑞吉天然粮', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260324001142-47efab00.jpg', '1', '2026-03-23 16:11:59', '2026-03-23 16:23:29', '[\"product/product-20260324001157-af9f3e5e.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 1),
(23, '皇家大型犬粮', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260324001216-c227719d.jpg', '1', '2026-03-23 16:12:36', '2026-03-23 16:12:36', '[\"product/product-20260324001232-ac4231cf.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(24, '蓝氏鸡肉狗粮 ', NULL, '100.00', 100, '狗粮', NULL, 5, 'product/product-20260324001307-9edc050a.jpg', '1', '2026-03-23 16:13:20', '2026-03-23 16:13:20', '[\"product/product-20260324001319-ed4df189.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(25, '蓝氏鸡肉猫粮', NULL, '100.00', 100, '猫粮', NULL, 5, 'product/product-20260324001331-0eb10534.jpg', '1', '2026-03-23 16:13:45', '2026-03-23 16:13:45', '[\"product/product-20260324001343-76422d50.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"48小时内发货\",\"免费包邮\",\"退货包运费\"]', NULL, 0),
(27, '三文鱼条', NULL, '100.00', 100, '零食', NULL, 5, 'product/product-20260324001728-7c6b3858.jpg', '1', '2026-03-23 16:17:50', '2026-03-23 16:17:50', '[\"product/product-20260324001748-119ed9f0.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(28, '洁齿骨 ', NULL, '100.00', 100, '零食', NULL, 5, 'product/product-20260324001800-195ec503.jpg', '1', '2026-03-23 16:18:41', '2026-03-23 16:23:25', '[\"product/product-20260324001839-f34b4495.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"48小时内发货\",\"免费包邮\",\"退货包运费\"]', NULL, 1),
(29, '牛肉粒 ', NULL, '100.00', 100, '零食', NULL, 5, 'product/product-20260324001852-fc91edb4.jpg', '1', '2026-03-23 16:19:13', '2026-03-23 16:19:13', '[\"product/product-20260324001911-266d40ed.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(30, '猫草', NULL, '100.00', 99, '零食', NULL, 5, 'product/product-20260324001926-90a22571.jpg', '1', '2026-03-23 16:19:46', '2026-04-14 08:54:43', '[\"product/product-20260324001944-43c19ae6.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 1),
(31, '蔬菜饼干', NULL, '100.00', 100, '零食', NULL, 5, 'product/product-20260324002002-d821176f.jpg', '1', '2026-03-23 16:20:16', '2026-03-23 16:20:16', '[\"product/product-20260324002013-f44eec19.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"免费包邮\",\"48小时内发货\",\"退货包运费\"]', NULL, 0),
(32, '鳕鱼条 ', NULL, '100.00', 100, '零食', NULL, 5, 'product/product-20260324002028-4a146646.jpg', '1', '2026-03-23 16:20:40', '2026-03-23 16:20:40', '[\"product/product-20260324002038-1fbb08f6.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 0),
(33, '鸡肉干', NULL, '100.00', 101, '零食', NULL, 5, 'product/product-20260324002049-6d77ee71.jpg', '1', '2026-03-23 16:21:17', '2026-05-01 18:50:31', '[\"product/product-20260324002100-f1c8fc6f.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"免费包邮\",\"48小时内发货\"]', NULL, 1),
(34, '鸭肉干', NULL, '100.00', 97, '零食', NULL, 5, 'product/product-20260324002136-4a7cd970.jpg', '1', '2026-03-23 16:21:48', '2026-04-14 08:51:18', '[\"product/product-20260324002146-9d4943c2.jpg\"]', NULL, NULL, '[\"七天无理由退货\",\"退货包运费\",\"48小时内发货\",\"免费包邮\"]', NULL, 1),
(36, '喵仙草', '无', '1000.00', 99, '积分商城', NULL, NULL, 'https://situationship.icu/upload/product/product-20260402013111-0958cfb5.jpg', '1', '2026-04-01 17:31:54', '2026-04-01 17:31:54', NULL, NULL, NULL, NULL, NULL, 0),
(37, '纯鲜鸭肉干', '好吃', '1000.00', 97, '积分商城', NULL, NULL, 'https://situationship.icu/upload/product/product-20260424023003-38b54bd1.jpg', '1', '2026-04-23 18:30:50', '2026-04-23 18:30:50', NULL, NULL, NULL, NULL, NULL, 0);

-- --------------------------------------------------------

--
-- 表的结构 `product_favorite`
--

CREATE TABLE `product_favorite` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商品收藏表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `product_favorite`
--

INSERT INTO `product_favorite` (`id`, `user_id`, `product_id`, `create_time`, `update_time`) VALUES
(37, 5, 1, '2025-10-03 03:12:10', '2025-10-03 03:12:10'),
(38, 5, 2, '2025-10-03 03:12:12', '2025-10-03 03:12:12'),
(39, 18, 2, '2026-01-17 17:50:35', '2026-01-17 17:50:34'),
(40, 70, 9, '2026-02-03 02:35:09', '2026-02-03 02:35:08'),
(41, 76, 34, '2026-03-24 08:57:13', '2026-03-24 08:57:13'),
(42, 75, 19, '2026-04-24 02:15:23', '2026-04-24 02:15:22');

-- --------------------------------------------------------

--
-- 表的结构 `product_review`
--

CREATE TABLE `product_review` (
  `id` int NOT NULL,
  `product_id` int NOT NULL,
  `user_id` int NOT NULL,
  `rating` int NOT NULL,
  `comment` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `images` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `videos` varchar(2000) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '评价视频URL，逗号分隔',
  `status` int DEFAULT '1',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='商品评价表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `product_review`
--

INSERT INTO `product_review` (`id`, `product_id`, `user_id`, `rating`, `comment`, `images`, `videos`, `status`, `create_time`, `update_time`) VALUES
(1, 1, 1, 5, 'Good quality product, pet loves it!', '[\"/upload/review/review1.jpg\", \"/upload/review/review2.jpg\"]', NULL, 1, '2025-10-24 17:19:27', '2025-10-24 17:19:27'),
(2, 1, 2, 4, 'Great value for money, recommend!', '[]', NULL, 1, '2025-10-24 17:19:27', '2025-10-24 17:19:27'),
(3, 1, 3, 5, 'Fast delivery, exactly as described!', '[\"/upload/review/review3.jpg\"]', NULL, 1, '2025-10-24 17:19:27', '2025-10-24 17:19:27'),
(4, 2, 18, 5, '很好', 'http://tmp/HqCGUXaMrMIAde2fea74dc0441c47a7a9047cbc8e884.jpg', NULL, 1, '2026-01-17 16:23:08', '2026-01-17 16:23:08'),
(5, 2, 18, 2, '质量不好', 'http://tmp/41pTrayf9NnYde2fea74dc0441c47a7a9047cbc8e884.jpg', NULL, 1, '2026-01-18 18:07:39', '2026-01-18 18:07:39'),
(6, 2, 18, 5, '很好吃', '', NULL, 1, '2026-01-19 01:54:55', '2026-01-19 01:54:55'),
(7, 2, 18, 5, '好吃', '', NULL, 1, '2026-01-19 01:55:52', '2026-01-19 01:55:52'),
(8, 2, 18, 4, '好吃', '', NULL, 1, '2026-01-19 01:58:28', '2026-01-19 01:58:28'),
(9, 2, 18, 5, '好1', '', NULL, 1, '2026-01-19 02:05:18', '2026-01-19 02:05:18'),
(10, 2, 18, 5, '111', NULL, NULL, 1, '2026-01-19 02:07:34', '2026-01-19 02:07:34'),
(11, 2, 18, 5, '1123', 'http://localhost:8080/upload/images/images-20260119021241-0ebf3afa.jpg', NULL, 1, '2026-01-19 02:12:41', '2026-01-19 02:12:41'),
(12, 2, 18, 5, '好', 'http://localhost:8080/upload/images/images-20260119021802-6f7e78de.jpg,http://localhost:8080/upload/images/images-20260119021802-b1d68241.jpg,http://localhost:8080/upload/images/images-20260119021803-fa5cfe82.jpg,http://localhost:8080/upload/images/images-20260119021803-ff144f94.jpg', NULL, 1, '2026-01-19 02:18:04', '2026-01-19 02:18:04'),
(13, 6, 18, 5, '很好吃', 'http://localhost:8080/upload/images/images-20260119033618-21159e39.jpg', NULL, 1, '2026-01-19 03:36:19', '2026-01-19 03:36:19'),
(14, 16, 75, 5, '好东西，', 'https://situationship.icu/upload/files/files-20260413205720-55708ac7.jpg', NULL, 1, '2026-04-13 20:57:22', '2026-04-13 20:57:22'),
(15, 34, 76, 5, '好', NULL, NULL, 1, '2026-04-14 17:54:21', '2026-04-14 17:54:21');

-- --------------------------------------------------------

--
-- 表的结构 `recommendation_interaction_weight`
--

CREATE TABLE `recommendation_interaction_weight` (
  `id` bigint NOT NULL COMMENT '主键',
  `interaction_type` varchar(20) NOT NULL COMMENT '行为类型: like/comment/collect/view',
  `weight` decimal(10,2) NOT NULL COMMENT '行为权重分值',
  `status` tinyint NOT NULL DEFAULT '1' COMMENT '状态: 1启用 0禁用',
  `description` varchar(255) DEFAULT NULL COMMENT '说明',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='推荐算法互动行为权重配置';

--
-- 转存表中的数据 `recommendation_interaction_weight`
--

INSERT INTO `recommendation_interaction_weight` (`id`, `interaction_type`, `weight`, `status`, `description`, `create_time`, `update_time`) VALUES
(1, 'like', '3.00', 1, '点赞行为权重', '2026-04-09 23:09:25', '2026-04-09 23:09:25'),
(2, 'comment', '2.00', 1, '评论行为权重', '2026-04-09 23:09:25', '2026-04-09 23:09:25'),
(3, 'collect', '4.00', 1, '收藏行为权重', '2026-04-09 23:09:25', '2026-04-09 23:09:25'),
(4, 'view', '1.00', 1, '浏览行为权重', '2026-04-09 23:09:25', '2026-04-09 23:09:25');

-- --------------------------------------------------------

--
-- 表的结构 `refund_request`
--

CREATE TABLE `refund_request` (
  `id` bigint NOT NULL COMMENT '退款申请ID',
  `order_id` bigint NOT NULL COMMENT '订单ID',
  `order_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '订单号',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '我要退货退款' COMMENT '申请类型：我要退货退款、我要换货',
  `reason` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '申请原因',
  `refund_amount` decimal(10,2) NOT NULL COMMENT '退款金额',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'pending' COMMENT '退款状态：pending-待处理, approved-已批准, rejected-已拒绝',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='退款申请表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `refund_request`
--

INSERT INTO `refund_request` (`id`, `order_id`, `order_no`, `user_id`, `type`, `reason`, `refund_amount`, `status`, `create_time`, `update_time`) VALUES
(1, 33, 'ORD1768933725046', 18, '我要退货退款', '做工粗糙/有瑕疵', '120.00', 'approved', '2026-01-21 04:25:57', '2026-01-21 04:26:24'),
(2, 37, 'ORD1769446100468', 18, '我要退货退款', '做工粗糙/有瑕疵', '120.00', 'pending', '2026-02-03 05:27:15', '2026-02-03 05:27:15'),
(3, 42, 'ORD1776106127007', 76, '我要退货退款', '材质与商品描述不符', '100.00', 'approved', '2026-04-14 17:54:36', '2026-04-14 17:54:58'),
(4, 41, 'ORD1775152328279', 75, '我要退货退款', '不想要了', '100.00', 'rejected', '2026-04-21 15:30:48', '2026-04-21 15:48:12');

-- --------------------------------------------------------

--
-- 表的结构 `review_like`
--

CREATE TABLE `review_like` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `review_id` bigint NOT NULL COMMENT '评论ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='评论点赞表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `review_like`
--

INSERT INTO `review_like` (`id`, `review_id`, `user_id`, `create_time`) VALUES
(1, 12, 18, '2026-01-19 02:54:03'),
(2, 14, 75, '2026-04-13 20:58:35');

-- --------------------------------------------------------

--
-- 表的结构 `review_reply`
--

CREATE TABLE `review_reply` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `review_id` bigint NOT NULL COMMENT '评论ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '回复内容',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='评论回复表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `review_reply`
--

INSERT INTO `review_reply` (`id`, `review_id`, `user_id`, `content`, `create_time`, `update_time`) VALUES
(1, 12, 18, '汪汪汪', '2026-01-19 02:56:43', '2026-01-19 02:56:43'),
(2, 13, 18, '11', '2026-01-24 01:28:46', '2026-01-24 01:28:46'),
(3, 14, 75, '👌🏻', '2026-04-13 20:58:41', '2026-04-13 20:58:41');

-- --------------------------------------------------------

--
-- 表的结构 `service_appointment_rating`
--

CREATE TABLE `service_appointment_rating` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `appointment_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '预约类型：door-cleaning/grooming/hospital',
  `appointment_id` bigint NOT NULL COMMENT '预约ID',
  `member_id` bigint NOT NULL COMMENT '服务人员ID(service_member.id)',
  `user_id` bigint NOT NULL COMMENT '评价用户ID',
  `rating` tinyint NOT NULL COMMENT '评分 1-5',
  `comment` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '评价内容',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='服务预约评价表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `service_appointment_rating`
--

INSERT INTO `service_appointment_rating` (`id`, `appointment_type`, `appointment_id`, `member_id`, `user_id`, `rating`, `comment`, `create_time`) VALUES
(1, 'grooming', 6, 17, 70, 4, '服务very goog', '2026-01-31 22:16:02'),
(2, 'grooming', 10, 17, 70, 4, NULL, '2026-02-01 01:58:00'),
(3, 'grooming', 11, 29, 70, 4, '很好', '2026-02-02 00:59:01'),
(4, 'grooming', 13, 29, 70, 4, '好', '2026-02-03 03:17:35'),
(5, 'hospital', 21, 36, 75, 5, '好', '2026-04-20 06:11:09');

-- --------------------------------------------------------

--
-- 表的结构 `service_config`
--

CREATE TABLE `service_config` (
  `id` bigint NOT NULL COMMENT '服务配置ID',
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '服务类型标识（如：door-cleaning, grooming等）',
  `service_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '服务名称',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT '服务描述',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '服务价格',
  `icon` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '服务图标路径',
  `image` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '服务图片路径',
  `time_slots` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT '可预约时间段（JSON格式）',
  `service_area` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '服务区域',
  `max_bookings_per_day` int DEFAULT '10' COMMENT '每日最大预约数',
  `status` int DEFAULT '1' COMMENT '状态（1-启用，0-禁用）',
  `sort_order` int DEFAULT '0' COMMENT '排序顺序',
  `features` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT '服务特点（JSON格式）',
  `notice` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT '温馨提示（JSON格式）',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='服务配置表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `service_config`
--

INSERT INTO `service_config` (`id`, `service_type`, `service_name`, `description`, `price`, `icon`, `image`, `time_slots`, `service_area`, `max_bookings_per_day`, `status`, `sort_order`, `features`, `notice`, `create_time`, `update_time`) VALUES
(1, 'door-cleaning', '上门铲屎服务', '专业贴心，让您的宠物生活更舒适', '99.00', '/static/images/door-cleaning.svg', NULL, '[\"08:00-10:00\", \"10:00-12:00\", \"12:00-14:00\", \"14:00-16:00\", \"16:00-18:00\", \"18:00-20:00\"]', NULL, 10, 1, 1, '[\"上门服务|专业人员上门为您的宠物清理猫砂狗便\", \"灵活时间|可预约多个时间段，满足不同需求\", \"清洁彻底|不仅清理排泄物，还会进行环境消毒\", \"安全保障|经过专业培训，持证上岗，服务有保障\"]', '[\"请提前预约，至少提前1天\", \"服务时间为早8:00-晚8:00\", \"首次服务需要留下门禁密码或钥匙\", \"如有监控建议开启，确保双方安全\", \"遇到特殊情况可联系客服改期\"]', '2025-10-16 16:23:54', '2025-10-16 16:23:54');

-- --------------------------------------------------------

--
-- 表的结构 `service_member`
--

CREATE TABLE `service_member` (
  `id` bigint NOT NULL COMMENT '服务人员ID',
  `user_id` bigint DEFAULT NULL COMMENT '关联用户ID（可为空，表示服务人员尚未注册系统账户）',
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '服务类型（如：door-cleaning, grooming等）',
  `store_id` bigint DEFAULT NULL COMMENT '所属门店ID，NULL表示平台级可参与任意门店',
  `member_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '服务人员姓名',
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '头像URL',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '联系电话',
  `status` int DEFAULT '1' COMMENT '状态：1-启用，0-禁用',
  `max_tasks_per_day` int DEFAULT '10' COMMENT '每日最大任务数',
  `rating` decimal(3,2) DEFAULT '5.00' COMMENT '评分（0-5分）',
  `total_tasks` int DEFAULT '0' COMMENT '累计完成任务数',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='服务人员表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `service_member`
--

INSERT INTO `service_member` (`id`, `user_id`, `service_type`, `store_id`, `member_name`, `avatar`, `phone`, `status`, `max_tasks_per_day`, `rating`, `total_tasks`, `create_time`, `update_time`) VALUES
(31, 55, '商城', NULL, '宠物家商城管理', 'https://situationship.icu/upload/files/files-20260324010236-c111d64d.png', '15278562765', 1, 1, '5.00', 0, '2026-03-24 01:02:47', '2026-03-24 01:02:47'),
(32, 54, '医师', 1, '张伟医师', 'https://situationship.icu/upload/files/files-20260324010302-c3a8e5d7.jpg', '15278562765', 1, 10, '5.00', 0, '2026-03-24 01:03:12', '2026-03-24 01:03:12'),
(34, 52, 'hospital', 2, '珠江服务人员2', 'https://situationship.icu/upload/files/files-20260324010612-e050c539.jpg', '15278562765', 1, 10, '5.00', 0, '2026-03-24 01:06:20', '2026-03-24 01:06:20'),
(35, 51, 'door-cleaning', 2, '珠江服务人员1', 'https://situationship.icu/upload/files/files-20260324010631-0ab330db.jpg', '15278562765', 1, 10, '5.00', 0, '2026-03-24 01:06:37', '2026-03-24 01:06:37'),
(36, 48, 'hospital', 1, '天河服务人员2', 'https://situationship.icu/upload/files/files-20260324010832-2cce4680.jpg', '15278562768', 1, 10, '5.00', 0, '2026-03-24 01:08:47', '2026-03-24 01:08:47'),
(37, 47, 'door-cleaning', 1, '天河服务人员1', 'https://situationship.icu/upload/files/files-20260324010902-81992898.jpg', '15278562762', 1, 10, '5.00', 0, '2026-03-24 01:09:07', '2026-03-24 01:09:07'),
(39, 56, 'grooming', 1, '天河服务人员3', 'https://situationship.icu/upload/files/files-20260325123940-1f4e959f.jpg', '15278562739', 1, 10, '5.00', 0, '2026-03-25 12:39:55', '2026-03-25 12:39:55'),
(40, 57, 'grooming', 2, '珠江服务人员3', 'https://situationship.icu/upload/files/files-20260325124004-cf194702.jpg', '15278562719', 1, 10, '5.00', 0, '2026-03-25 12:40:13', '2026-03-25 12:40:13'),
(41, 60, '医师', 1, '张伟', 'https://situationship.icu/upload/files/files-20260423004029-9873256d.png', '15278562769', 1, 10, '5.00', 0, '2026-04-23 00:40:30', '2026-04-23 00:40:30'),
(42, 59, 'store_admin', 1, '李四', 'https://situationship.icu/upload/files/files-20260422230545-5369e9eb.png', '15278562769', 1, 10, '5.00', 0, '2026-04-23 21:17:18', '2026-04-23 21:17:18'),
(43, 58, 'store_admin', 2, '张三', 'https://situationship.icu/upload/files/files-20260422230600-b8e0b301.png', '15278562763', 1, 10, '5.00', 0, '2026-04-23 21:21:35', '2026-04-23 21:21:35');

-- --------------------------------------------------------

--
-- 表的结构 `service_schedule`
--

CREATE TABLE `service_schedule` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `member_id` bigint NOT NULL COMMENT '服务人员ID',
  `store_id` bigint DEFAULT NULL COMMENT '所属门店ID，排班所属门店（与 member 的 store_id 独立）',
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'door-cleaning',
  `date` date NOT NULL COMMENT '日期，例如 2025-11-03',
  `time_slot` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '时间段，例如 "09:00-10:00"',
  `max_capacity` int DEFAULT '1',
  `reserved_count` int DEFAULT '0',
  `is_available` tinyint DEFAULT '1',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT '可预约' COMMENT '状态：可预约、已预约',
  `task_id` bigint DEFAULT NULL COMMENT '若被占用，关联appointment.id',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='服务人员可预约时间表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `service_schedule`
--

INSERT INTO `service_schedule` (`id`, `member_id`, `store_id`, `service_type`, `date`, `time_slot`, `max_capacity`, `reserved_count`, `is_available`, `status`, `task_id`, `create_time`, `update_time`) VALUES
(1, 37, NULL, 'door-cleaning', '2026-04-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(2, 37, NULL, 'door-cleaning', '2026-04-25', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(3, 37, NULL, 'door-cleaning', '2026-04-25', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(4, 37, NULL, 'door-cleaning', '2026-04-25', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(5, 37, NULL, 'door-cleaning', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(6, 37, NULL, 'door-cleaning', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(7, 37, NULL, 'door-cleaning', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(8, 37, NULL, 'door-cleaning', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(9, 35, NULL, 'door-cleaning', '2026-04-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(10, 35, NULL, 'door-cleaning', '2026-04-25', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(11, 35, NULL, 'door-cleaning', '2026-04-25', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(12, 35, NULL, 'door-cleaning', '2026-04-25', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(13, 35, NULL, 'door-cleaning', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(14, 35, NULL, 'door-cleaning', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(15, 35, NULL, 'door-cleaning', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(16, 35, NULL, 'door-cleaning', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:26', '2026-04-24 00:05:26'),
(21, 42, 1, 'door-cleaning', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(22, 42, 1, 'door-cleaning', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(23, 42, 1, 'door-cleaning', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(24, 42, 1, 'door-cleaning', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(29, 43, NULL, 'door-cleaning', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(30, 43, NULL, 'door-cleaning', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(31, 43, NULL, 'door-cleaning', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(32, 43, NULL, 'door-cleaning', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(33, 39, NULL, 'grooming', '2026-04-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(34, 39, NULL, 'grooming', '2026-04-25', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(35, 39, NULL, 'grooming', '2026-04-25', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(36, 39, NULL, 'grooming', '2026-04-25', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(37, 39, NULL, 'grooming', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(38, 39, NULL, 'grooming', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(39, 39, NULL, 'grooming', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(40, 39, NULL, 'grooming', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(41, 40, NULL, 'grooming', '2026-04-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(42, 40, NULL, 'grooming', '2026-04-25', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(43, 40, NULL, 'grooming', '2026-04-25', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(44, 40, NULL, 'grooming', '2026-04-25', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(45, 40, NULL, 'grooming', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(46, 40, NULL, 'grooming', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(47, 40, NULL, 'grooming', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(48, 40, NULL, 'grooming', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(49, 36, NULL, 'hospital', '2026-04-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(50, 36, NULL, 'hospital', '2026-04-25', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(51, 36, NULL, 'hospital', '2026-04-25', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(52, 36, NULL, 'hospital', '2026-04-25', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(53, 36, NULL, 'hospital', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(54, 36, NULL, 'hospital', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(55, 36, NULL, 'hospital', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(56, 36, NULL, 'hospital', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(57, 34, NULL, 'hospital', '2026-04-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(58, 34, NULL, 'hospital', '2026-04-25', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:27', '2026-04-24 00:05:27'),
(59, 34, NULL, 'hospital', '2026-04-25', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:28', '2026-04-24 00:05:28'),
(60, 34, NULL, 'hospital', '2026-04-25', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:28', '2026-04-24 00:05:28'),
(61, 34, NULL, 'hospital', '2026-04-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:28', '2026-04-24 00:05:28'),
(62, 34, NULL, 'hospital', '2026-04-26', '10:00-11:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:28', '2026-04-24 00:05:28'),
(63, 34, NULL, 'hospital', '2026-04-26', '11:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:28', '2026-04-24 00:05:28'),
(64, 34, NULL, 'hospital', '2026-04-26', '14:00-15:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:05:28', '2026-04-24 00:05:28'),
(68, 42, 1, 'door-cleaning', '2026-04-26', '15:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:34:13', '2026-04-24 00:34:13'),
(69, 42, 1, 'door-cleaning', '2026-04-26', '16:00-17:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:34:13', '2026-04-24 00:34:13'),
(70, 42, 1, 'door-cleaning', '2026-04-26', '17:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-24 00:34:13', '2026-04-24 00:34:13'),
(73, 42, NULL, 'store_admin', '2026-04-25', '08:00-11:30', 1, 0, 1, '可预约', NULL, '2026-04-24 02:27:34', '2026-04-24 02:27:34'),
(74, 42, NULL, 'store_admin', '2026-04-25', '13:30-18:00', 1, 0, 1, '可预约', NULL, '2026-04-24 02:27:34', '2026-04-24 02:27:34'),
(76, 42, 1, 'door-cleaning', '2026-04-25', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 02:49:41', '2026-04-24 02:49:41'),
(77, 42, 1, 'door-cleaning', '2026-05-01', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(78, 42, 1, 'door-cleaning', '2026-05-02', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(79, 42, 1, 'door-cleaning', '2026-05-03', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(80, 42, 1, 'door-cleaning', '2026-05-04', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(81, 42, 1, 'door-cleaning', '2026-05-05', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(82, 42, 1, 'door-cleaning', '2026-05-06', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(83, 42, 1, 'door-cleaning', '2026-05-07', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(84, 42, 1, 'door-cleaning', '2026-05-08', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(85, 42, 1, 'door-cleaning', '2026-05-09', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(86, 42, 1, 'door-cleaning', '2026-05-10', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:07:28', '2026-04-24 03:07:28'),
(87, 43, 2, 'door-cleaning', '2026-05-01', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(88, 43, 2, 'door-cleaning', '2026-05-02', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(89, 43, 2, 'door-cleaning', '2026-05-03', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(90, 43, 2, 'door-cleaning', '2026-05-04', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(91, 43, 2, 'door-cleaning', '2026-05-05', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(92, 43, 2, 'door-cleaning', '2026-05-06', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(93, 43, 2, 'door-cleaning', '2026-05-07', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(94, 43, 2, 'door-cleaning', '2026-05-08', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(95, 43, 2, 'door-cleaning', '2026-05-09', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(96, 43, 2, 'door-cleaning', '2026-05-10', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:08:12', '2026-04-24 03:08:12'),
(97, 43, NULL, 'store_admin', '2026-04-25', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:09:07', '2026-04-24 03:09:07'),
(98, 43, NULL, 'store_admin', '2026-04-24', '全天', 1, 0, 1, '可预约', NULL, '2026-04-24 03:09:09', '2026-04-24 03:09:09'),
(99, 37, 1, 'door-cleaning', '2026-04-24', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 03:42:23', '2026-04-24 03:42:23'),
(100, 37, 1, 'door-cleaning', '2026-04-25', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-24 03:42:23', '2026-04-24 03:42:23'),
(101, 37, 1, 'door-cleaning', '2026-04-28', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(102, 37, 1, 'door-cleaning', '2026-04-28', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(103, 37, 1, 'door-cleaning', '2026-04-28', '14:00-16:00', 1, 1, 0, '不可预约', 35, '2026-04-27 11:39:23', '2026-04-27 14:20:04'),
(104, 37, 1, 'door-cleaning', '2026-04-28', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(105, 37, 1, 'door-cleaning', '2026-04-29', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(106, 37, 1, 'door-cleaning', '2026-04-29', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(107, 37, 1, 'door-cleaning', '2026-04-29', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(108, 37, 1, 'door-cleaning', '2026-04-29', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(109, 37, 1, 'door-cleaning', '2026-04-30', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(110, 37, 1, 'door-cleaning', '2026-04-30', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(111, 37, 1, 'door-cleaning', '2026-04-30', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(112, 37, 1, 'door-cleaning', '2026-04-30', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(113, 37, 1, 'door-cleaning', '2026-05-01', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(114, 37, 1, 'door-cleaning', '2026-05-01', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(115, 37, 1, 'door-cleaning', '2026-05-01', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(116, 37, 1, 'door-cleaning', '2026-05-01', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(117, 37, 1, 'door-cleaning', '2026-05-02', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(118, 37, 1, 'door-cleaning', '2026-05-02', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(119, 37, 1, 'door-cleaning', '2026-05-02', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(120, 37, 1, 'door-cleaning', '2026-05-02', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(121, 37, 1, 'door-cleaning', '2026-05-03', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(122, 37, 1, 'door-cleaning', '2026-05-03', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(123, 37, 1, 'door-cleaning', '2026-05-03', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(124, 37, 1, 'door-cleaning', '2026-05-03', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(125, 37, 1, 'door-cleaning', '2026-05-04', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(126, 37, 1, 'door-cleaning', '2026-05-04', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(127, 37, 1, 'door-cleaning', '2026-05-04', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(128, 37, 1, 'door-cleaning', '2026-05-04', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(129, 37, 1, 'door-cleaning', '2026-05-05', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:23', '2026-04-27 11:39:23'),
(130, 37, 1, 'door-cleaning', '2026-05-05', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(131, 37, 1, 'door-cleaning', '2026-05-05', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(132, 37, 1, 'door-cleaning', '2026-05-05', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(133, 37, 1, 'door-cleaning', '2026-05-06', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(134, 37, 1, 'door-cleaning', '2026-05-06', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(135, 37, 1, 'door-cleaning', '2026-05-06', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(136, 37, 1, 'door-cleaning', '2026-05-06', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(137, 37, 1, 'door-cleaning', '2026-05-07', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(138, 37, 1, 'door-cleaning', '2026-05-07', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(139, 37, 1, 'door-cleaning', '2026-05-07', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(140, 37, 1, 'door-cleaning', '2026-05-07', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(141, 37, 1, 'door-cleaning', '2026-05-08', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(142, 37, 1, 'door-cleaning', '2026-05-08', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(143, 37, 1, 'door-cleaning', '2026-05-08', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(144, 37, 1, 'door-cleaning', '2026-05-08', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(145, 37, 1, 'door-cleaning', '2026-05-09', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(146, 37, 1, 'door-cleaning', '2026-05-09', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(147, 37, 1, 'door-cleaning', '2026-05-09', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(148, 37, 1, 'door-cleaning', '2026-05-09', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(149, 37, 1, 'door-cleaning', '2026-05-10', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(150, 37, 1, 'door-cleaning', '2026-05-10', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(151, 37, 1, 'door-cleaning', '2026-05-10', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(152, 37, 1, 'door-cleaning', '2026-05-10', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(153, 37, 1, 'door-cleaning', '2026-05-11', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(154, 37, 1, 'door-cleaning', '2026-05-11', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(155, 37, 1, 'door-cleaning', '2026-05-11', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(156, 37, 1, 'door-cleaning', '2026-05-11', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(157, 37, 1, 'door-cleaning', '2026-05-12', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(158, 37, 1, 'door-cleaning', '2026-05-12', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(159, 37, 1, 'door-cleaning', '2026-05-12', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(160, 37, 1, 'door-cleaning', '2026-05-12', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(161, 37, 1, 'door-cleaning', '2026-05-13', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(162, 37, 1, 'door-cleaning', '2026-05-13', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(163, 37, 1, 'door-cleaning', '2026-05-13', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(164, 37, 1, 'door-cleaning', '2026-05-13', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(165, 37, 1, 'door-cleaning', '2026-05-14', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(166, 37, 1, 'door-cleaning', '2026-05-14', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(167, 37, 1, 'door-cleaning', '2026-05-14', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(168, 37, 1, 'door-cleaning', '2026-05-14', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(169, 37, 1, 'door-cleaning', '2026-05-15', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(170, 37, 1, 'door-cleaning', '2026-05-15', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(171, 37, 1, 'door-cleaning', '2026-05-15', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(172, 37, 1, 'door-cleaning', '2026-05-15', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(173, 37, 1, 'door-cleaning', '2026-05-16', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(174, 37, 1, 'door-cleaning', '2026-05-16', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(175, 37, 1, 'door-cleaning', '2026-05-16', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(176, 37, 1, 'door-cleaning', '2026-05-16', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(177, 37, 1, 'door-cleaning', '2026-05-17', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(178, 37, 1, 'door-cleaning', '2026-05-17', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(179, 37, 1, 'door-cleaning', '2026-05-17', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(180, 37, 1, 'door-cleaning', '2026-05-17', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(181, 37, 1, 'door-cleaning', '2026-05-18', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(182, 37, 1, 'door-cleaning', '2026-05-18', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(183, 37, 1, 'door-cleaning', '2026-05-18', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(184, 37, 1, 'door-cleaning', '2026-05-18', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(185, 37, 1, 'door-cleaning', '2026-05-19', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(186, 37, 1, 'door-cleaning', '2026-05-19', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(187, 37, 1, 'door-cleaning', '2026-05-19', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(188, 37, 1, 'door-cleaning', '2026-05-19', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(189, 37, 1, 'door-cleaning', '2026-05-20', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(190, 37, 1, 'door-cleaning', '2026-05-20', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(191, 37, 1, 'door-cleaning', '2026-05-20', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(192, 37, 1, 'door-cleaning', '2026-05-20', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(193, 37, 1, 'door-cleaning', '2026-05-21', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(194, 37, 1, 'door-cleaning', '2026-05-21', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(195, 37, 1, 'door-cleaning', '2026-05-21', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(196, 37, 1, 'door-cleaning', '2026-05-21', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(197, 37, 1, 'door-cleaning', '2026-05-22', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(198, 37, 1, 'door-cleaning', '2026-05-22', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(199, 37, 1, 'door-cleaning', '2026-05-22', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(200, 37, 1, 'door-cleaning', '2026-05-22', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(201, 37, 1, 'door-cleaning', '2026-05-23', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(202, 37, 1, 'door-cleaning', '2026-05-23', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(203, 37, 1, 'door-cleaning', '2026-05-23', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(204, 37, 1, 'door-cleaning', '2026-05-23', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(205, 37, 1, 'door-cleaning', '2026-05-24', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(206, 37, 1, 'door-cleaning', '2026-05-24', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(207, 37, 1, 'door-cleaning', '2026-05-24', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:24', '2026-04-27 11:39:24'),
(208, 37, 1, 'door-cleaning', '2026-05-24', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(209, 37, 1, 'door-cleaning', '2026-05-25', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(210, 37, 1, 'door-cleaning', '2026-05-25', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(211, 37, 1, 'door-cleaning', '2026-05-25', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(212, 37, 1, 'door-cleaning', '2026-05-25', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(213, 37, 1, 'door-cleaning', '2026-05-26', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(214, 37, 1, 'door-cleaning', '2026-05-26', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(215, 37, 1, 'door-cleaning', '2026-05-26', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(216, 37, 1, 'door-cleaning', '2026-05-26', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(217, 37, 1, 'door-cleaning', '2026-05-27', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(218, 37, 1, 'door-cleaning', '2026-05-27', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(219, 37, 1, 'door-cleaning', '2026-05-27', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(220, 37, 1, 'door-cleaning', '2026-05-27', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(221, 37, 1, 'door-cleaning', '2026-05-28', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(222, 37, 1, 'door-cleaning', '2026-05-28', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(223, 37, 1, 'door-cleaning', '2026-05-28', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(224, 37, 1, 'door-cleaning', '2026-05-28', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(225, 37, 1, 'door-cleaning', '2026-05-29', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(226, 37, 1, 'door-cleaning', '2026-05-29', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(227, 37, 1, 'door-cleaning', '2026-05-29', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(228, 37, 1, 'door-cleaning', '2026-05-29', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(229, 37, 1, 'door-cleaning', '2026-05-30', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(230, 37, 1, 'door-cleaning', '2026-05-30', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(231, 37, 1, 'door-cleaning', '2026-05-30', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(232, 37, 1, 'door-cleaning', '2026-05-30', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(233, 37, 1, 'door-cleaning', '2026-05-31', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(234, 37, 1, 'door-cleaning', '2026-05-31', '10:00-12:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(235, 37, 1, 'door-cleaning', '2026-05-31', '14:00-16:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(236, 37, 1, 'door-cleaning', '2026-05-31', '16:00-18:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:25', '2026-04-27 11:39:25'),
(237, 39, 1, 'grooming', '2026-04-28', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(238, 39, 1, 'grooming', '2026-04-29', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(239, 39, 1, 'grooming', '2026-04-30', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(240, 39, 1, 'grooming', '2026-05-01', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(241, 39, 1, 'grooming', '2026-05-02', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(242, 39, 1, 'grooming', '2026-05-03', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(243, 39, 1, 'grooming', '2026-05-04', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(244, 39, 1, 'grooming', '2026-05-05', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(245, 39, 1, 'grooming', '2026-05-06', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(246, 39, 1, 'grooming', '2026-05-07', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(247, 39, 1, 'grooming', '2026-05-08', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(248, 39, 1, 'grooming', '2026-05-09', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(249, 39, 1, 'grooming', '2026-05-10', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(250, 39, 1, 'grooming', '2026-05-11', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(251, 39, 1, 'grooming', '2026-05-12', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(252, 39, 1, 'grooming', '2026-05-13', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(253, 39, 1, 'grooming', '2026-05-14', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(254, 39, 1, 'grooming', '2026-05-15', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(255, 39, 1, 'grooming', '2026-05-16', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(256, 39, 1, 'grooming', '2026-05-17', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(257, 39, 1, 'grooming', '2026-05-18', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(258, 39, 1, 'grooming', '2026-05-19', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(259, 39, 1, 'grooming', '2026-05-20', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(260, 39, 1, 'grooming', '2026-05-21', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(261, 39, 1, 'grooming', '2026-05-22', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(262, 39, 1, 'grooming', '2026-05-23', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(263, 39, 1, 'grooming', '2026-05-24', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(264, 39, 1, 'grooming', '2026-05-25', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(265, 39, 1, 'grooming', '2026-05-26', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(266, 39, 1, 'grooming', '2026-05-27', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(267, 39, 1, 'grooming', '2026-05-28', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(268, 39, 1, 'grooming', '2026-05-29', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(269, 39, 1, 'grooming', '2026-05-30', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(270, 39, 1, 'grooming', '2026-05-31', '08:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:39:58', '2026-04-27 11:39:58'),
(271, 36, 1, 'hospital', '2026-04-28', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(272, 36, 1, 'hospital', '2026-04-28', '09:00-10:00', 1, 1, 0, '不可预约', 25, '2026-04-27 11:40:22', '2026-04-27 14:21:11'),
(273, 36, 1, 'hospital', '2026-04-29', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(274, 36, 1, 'hospital', '2026-04-29', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(275, 36, 1, 'hospital', '2026-04-30', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(276, 36, 1, 'hospital', '2026-04-30', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(277, 36, 1, 'hospital', '2026-05-01', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(278, 36, 1, 'hospital', '2026-05-01', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(279, 36, 1, 'hospital', '2026-05-02', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(280, 36, 1, 'hospital', '2026-05-02', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(281, 36, 1, 'hospital', '2026-05-03', '08:00-09:00', 1, 1, 0, '不可预约', 26, '2026-04-27 11:40:22', '2026-05-02 02:46:09'),
(282, 36, 1, 'hospital', '2026-05-03', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(283, 36, 1, 'hospital', '2026-05-04', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(284, 36, 1, 'hospital', '2026-05-04', '09:00-10:00', 1, 1, 0, '不可预约', 27, '2026-04-27 11:40:22', '2026-05-03 00:04:37'),
(285, 36, 1, 'hospital', '2026-05-05', '08:00-09:00', 1, 1, 0, '不可预约', 29, '2026-04-27 11:40:22', '2026-05-03 00:19:19'),
(286, 36, 1, 'hospital', '2026-05-05', '09:00-10:00', 1, 1, 0, '不可预约', 28, '2026-04-27 11:40:22', '2026-05-03 00:17:40'),
(287, 36, 1, 'hospital', '2026-05-06', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(288, 36, 1, 'hospital', '2026-05-06', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(289, 36, 1, 'hospital', '2026-05-07', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(290, 36, 1, 'hospital', '2026-05-07', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(291, 36, 1, 'hospital', '2026-05-08', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(292, 36, 1, 'hospital', '2026-05-08', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(293, 36, 1, 'hospital', '2026-05-09', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(294, 36, 1, 'hospital', '2026-05-09', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(295, 36, 1, 'hospital', '2026-05-10', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(296, 36, 1, 'hospital', '2026-05-10', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(297, 36, 1, 'hospital', '2026-05-11', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(298, 36, 1, 'hospital', '2026-05-11', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(299, 36, 1, 'hospital', '2026-05-12', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(300, 36, 1, 'hospital', '2026-05-12', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(301, 36, 1, 'hospital', '2026-05-13', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(302, 36, 1, 'hospital', '2026-05-13', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(303, 36, 1, 'hospital', '2026-05-14', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(304, 36, 1, 'hospital', '2026-05-14', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(305, 36, 1, 'hospital', '2026-05-15', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(306, 36, 1, 'hospital', '2026-05-15', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(307, 36, 1, 'hospital', '2026-05-16', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(308, 36, 1, 'hospital', '2026-05-16', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(309, 36, 1, 'hospital', '2026-05-17', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(310, 36, 1, 'hospital', '2026-05-17', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(311, 36, 1, 'hospital', '2026-05-18', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(312, 36, 1, 'hospital', '2026-05-18', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(313, 36, 1, 'hospital', '2026-05-19', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(314, 36, 1, 'hospital', '2026-05-19', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(315, 36, 1, 'hospital', '2026-05-20', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(316, 36, 1, 'hospital', '2026-05-20', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(317, 36, 1, 'hospital', '2026-05-21', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(318, 36, 1, 'hospital', '2026-05-21', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(319, 36, 1, 'hospital', '2026-05-22', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(320, 36, 1, 'hospital', '2026-05-22', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:22', '2026-04-27 11:40:22'),
(321, 36, 1, 'hospital', '2026-05-23', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(322, 36, 1, 'hospital', '2026-05-23', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(323, 36, 1, 'hospital', '2026-05-24', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(324, 36, 1, 'hospital', '2026-05-24', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(325, 36, 1, 'hospital', '2026-05-25', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(326, 36, 1, 'hospital', '2026-05-25', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(327, 36, 1, 'hospital', '2026-05-26', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(328, 36, 1, 'hospital', '2026-05-26', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(329, 36, 1, 'hospital', '2026-05-27', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(330, 36, 1, 'hospital', '2026-05-27', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(331, 36, 1, 'hospital', '2026-05-28', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(332, 36, 1, 'hospital', '2026-05-28', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(333, 36, 1, 'hospital', '2026-05-29', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(334, 36, 1, 'hospital', '2026-05-29', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(335, 36, 1, 'hospital', '2026-05-30', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(336, 36, 1, 'hospital', '2026-05-30', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(337, 36, 1, 'hospital', '2026-05-31', '08:00-09:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23'),
(338, 36, 1, 'hospital', '2026-05-31', '09:00-10:00', 1, 0, 1, '可预约', NULL, '2026-04-27 11:40:23', '2026-04-27 11:40:23');

-- --------------------------------------------------------

--
-- 表的结构 `service_stores`
--

CREATE TABLE `service_stores` (
  `id` bigint NOT NULL COMMENT '门店ID',
  `store_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '门店名称',
  `address` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '详细地址',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '联系电话',
  `business_hours` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '09:00-21:00' COMMENT '营业时间',
  `services` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '提供的服务类型（逗号分隔：boarding,grooming,hospital,litter）',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '门店描述',
  `max_capacity` int DEFAULT '20' COMMENT '最大容量（寄养宠物数量）',
  `current_bookings` int DEFAULT '0' COMMENT '当前预约数量',
  `image_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '门店图片URL',
  `latitude` decimal(10,6) DEFAULT NULL COMMENT '纬度',
  `longitude` decimal(10,6) DEFAULT NULL COMMENT '经度',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'active' COMMENT '状态：active-营业中, inactive-暂停营业, closed-已关闭',
  `sort_order` int DEFAULT '0' COMMENT '排序顺序',
  `is_default` tinyint(1) DEFAULT '0' COMMENT '是否默认门店',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  `is_deleted` tinyint(1) DEFAULT '0' COMMENT '是否删除'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='服务门店表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `service_stores`
--

INSERT INTO `service_stores` (`id`, `store_name`, `address`, `phone`, `business_hours`, `services`, `description`, `max_capacity`, `current_bookings`, `image_url`, `latitude`, `longitude`, `status`, `sort_order`, `is_default`, `created_at`, `updated_at`, `is_deleted`) VALUES
(1, '宠物之家 · 天河旗舰店', '广州市天河区天河路567号宠物之家', '020-12345678', '08:00-22:00', 'grooming,hospital,litter', '天河旗舰店，提供全方位宠物服务，设施齐全，环境优美', 30, 0, '/upload/files/files-20260323031443-d254926b.jpg', NULL, NULL, 'active', 1, 1, '2026-01-30 15:37:08', '2026-03-22 19:14:45', 0),
(2, '宠物之家 · 珠江新城店', '广州市天河区珠江新城花城大道456号', '020-87654321', '09:00-21:00', 'grooming,hospital,litter', '珠江新城核心商圈，交通便利，提供高端宠物服务', 20, 0, '/upload/files/files-20260324003612-e45f601e.jpg', NULL, NULL, 'active', 2, 0, '2026-01-30 15:37:08', '2026-03-23 16:36:15', 0),
(3, '宠物之家 · 越秀中心店', '广州市越秀区中山五路789号', '020-88888888', '09:00-20:00', 'grooming', '越秀老城区，周边社区密集，寄养洗护专业', 15, 0, NULL, NULL, NULL, 'inactive', 3, 0, '2026-01-30 15:37:08', '2026-03-23 16:35:31', 0),
(4, '宠物之家 · 海珠滨江店', '广州市海珠区滨江东路321号', '020-99999999', '10:00-21:00', 'grooming,litter', '海珠滨江新店，环境舒适，服务贴心', 18, 0, NULL, NULL, NULL, 'inactive', 4, 0, '2026-01-30 15:37:08', '2026-03-23 16:35:28', 0),
(5, '宠物之家 · 番禺万达店', '广州市番禺区番禺大道668号万达广场', '020-66666666', '10:00-22:00', 'grooming,hospital', '番禺万达商圈，停车方便，提供全套服务', 25, 0, NULL, NULL, NULL, 'inactive', 5, 0, '2026-01-30 15:37:08', '2026-03-23 16:35:25', 0),
(6, '宠物之家.天河旗舰店', '123号', '123456', '09:00-21:00', 'grooming,hospital,litter', NULL, 20, 0, NULL, NULL, NULL, 'active', 0, 0, '2026-01-30 15:40:51', '2026-01-30 16:05:52', 1),
(7, '宠物之家 · 白云旗舰店', '广州市白云区白云新城花城大道456号', '123546846', '09:00-21:00', 'grooming,hospital,litter', NULL, 10, 0, NULL, NULL, NULL, 'inactive', 0, 0, '2026-01-30 19:48:06', '2026-04-24 15:46:39', 0);

-- --------------------------------------------------------

--
-- 表的结构 `shopping_cart`
--

CREATE TABLE `shopping_cart` (
  `id` bigint NOT NULL,
  `user_id` bigint NOT NULL,
  `product_id` bigint NOT NULL,
  `quantity` int DEFAULT '1',
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `shopping_cart`
--

INSERT INTO `shopping_cart` (`id`, `user_id`, `product_id`, `quantity`, `create_time`, `update_time`) VALUES
(2, 18, 2, 1, '2026-01-17 09:03:45', '2026-01-19 18:04:54'),
(3, 18, 6, 1, '2026-01-19 17:43:00', '2026-01-30 12:27:55'),
(5, 70, 6, 1, '2026-02-02 21:37:23', '2026-02-02 21:37:23'),
(6, 70, 2, 4, '2026-02-02 21:40:45', '2026-02-02 22:58:57'),
(7, 76, 25, 1, '2026-04-11 10:29:07', '2026-04-11 19:39:23'),
(9, 75, 25, 5, '2026-04-23 18:18:45', '2026-04-23 18:22:30'),
(10, 75, 21, 1, '2026-04-23 18:18:46', '2026-04-23 18:18:46');

-- --------------------------------------------------------

--
-- 表的结构 `sign_in_records`
--

CREATE TABLE `sign_in_records` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `sign_date` date NOT NULL COMMENT '签到日期',
  `points` int NOT NULL DEFAULT '0' COMMENT '获得的积分',
  `consecutive_days` int NOT NULL DEFAULT '1' COMMENT '连续签到天数',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='签到记录表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `sign_in_records`
--

INSERT INTO `sign_in_records` (`id`, `user_id`, `sign_date`, `points`, `consecutive_days`, `create_time`) VALUES
(1, 17, '2025-11-17', 10, 1, '2025-11-17 18:28:26'),
(2, 17, '2025-11-18', 10, 2, '2025-11-18 11:37:08'),
(3, 18, '2026-01-06', 10, 1, '2026-01-06 17:13:59'),
(4, 70, '2026-01-07', 10, 1, '2026-01-07 02:09:05'),
(5, 70, '2026-01-08', 10, 2, '2026-01-08 21:37:16'),
(6, 70, '2026-01-09', 10, 3, '2026-01-09 03:05:39'),
(7, 70, '2026-01-10', 10, 4, '2026-01-10 01:48:59'),
(8, 70, '2026-01-12', 10, 1, '2026-01-12 01:34:46'),
(9, 64, '2026-01-12', 10, 1, '2026-01-12 21:08:54'),
(10, 70, '2026-01-13', 10, 2, '2026-01-13 01:13:46'),
(11, 64, '2026-01-16', 10, 1, '2026-01-16 04:15:53'),
(12, 64, '2026-01-17', 10, 2, '2026-01-17 00:24:50'),
(13, 64, '2026-01-19', 10, 1, '2026-01-19 03:44:16'),
(14, 64, '2026-01-20', 10, 2, '2026-01-20 03:58:18'),
(15, 70, '2026-01-23', 10, 1, '2026-01-23 23:54:51'),
(16, 64, '2026-01-28', 10, 1, '2026-01-28 06:01:50'),
(17, 70, '2026-01-28', 10, 1, '2026-01-28 06:08:04'),
(18, 64, '2026-01-29', 10, 2, '2026-01-29 04:56:06'),
(19, 64, '2026-01-30', 10, 3, '2026-01-30 20:53:14'),
(20, 70, '2026-01-30', 10, 1, '2026-01-30 21:39:39'),
(21, 70, '2026-02-02', 10, 1, '2026-02-02 01:22:51'),
(22, 70, '2026-02-03', 10, 2, '2026-02-03 02:46:27'),
(23, 74, '2026-03-24', 10, 1, '2026-03-24 08:17:36'),
(24, 75, '2026-03-24', 10, 1, '2026-03-24 08:57:37'),
(25, 76, '2026-04-02', 10, 1, '2026-04-02 01:23:34'),
(26, 76, '2026-04-11', 10, 1, '2026-04-11 18:57:09'),
(27, 76, '2026-04-12', 10, 2, '2026-04-12 03:48:57'),
(28, 76, '2026-04-13', 10, 3, '2026-04-13 19:07:34'),
(29, 75, '2026-04-14', 10, 1, '2026-04-14 01:59:20'),
(30, 76, '2026-04-15', 10, 1, '2026-04-15 02:52:25'),
(31, 75, '2026-04-20', 10, 1, '2026-04-20 06:12:53'),
(32, 75, '2026-04-21', 10, 2, '2026-04-21 20:10:41'),
(33, 80, '2026-04-21', 10, 1, '2026-04-21 20:10:59'),
(34, 79, '2026-04-21', 10, 1, '2026-04-21 20:11:22'),
(35, 75, '2026-04-24', 10, 1, '2026-04-24 02:15:52');

-- --------------------------------------------------------

--
-- 表的结构 `stores`
--

CREATE TABLE `stores` (
  `id` bigint NOT NULL COMMENT '商家ID',
  `owner_id` bigint DEFAULT NULL COMMENT '商家账号ID（关联user表）',
  `owner_username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '商家账号用户名（冗余字段，便于查询）',
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '商家名称',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci COMMENT '商家描述',
  `avatar` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '商家头像路径',
  `logo` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '商家logo路径',
  `status` int DEFAULT '1' COMMENT '状态：1-启用，0-禁用',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品商家表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `stores`
--

INSERT INTO `stores` (`id`, `owner_id`, `owner_username`, `name`, `description`, `avatar`, `logo`, `status`, `create_time`, `update_time`) VALUES
(5, NULL, NULL, '宠物家官方旗舰店', '', 'https://situationship.icu/upload/files/files-20260323233244-76b6cd34.jpg', 'https://situationship.icu/upload/files/files-20260323233244-76b6cd34.jpg', 1, '2026-03-23 23:32:46', '2026-03-23 23:32:46');

-- --------------------------------------------------------

--
-- 表的结构 `store_warehouse`
--

CREATE TABLE `store_warehouse` (
  `id` bigint NOT NULL,
  `store_id` bigint NOT NULL COMMENT '店铺ID',
  `address` varchar(512) COLLATE utf8mb4_general_ci NOT NULL COMMENT '发货仓完整地址',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='店铺发货仓地址';

--
-- 转存表中的数据 `store_warehouse`
--

INSERT INTO `store_warehouse` (`id`, `store_id`, `address`, `create_time`) VALUES
(29, 5, '深圳宝安区', '2026-04-03 01:47:31'),
(30, 5, '广州天河仓', '2026-04-26 03:01:40');

-- --------------------------------------------------------

--
-- 表的结构 `tag`
--

CREATE TABLE `tag` (
  `id` bigint NOT NULL,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '标签名称',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='标签表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `tag`
--

INSERT INTO `tag` (`id`, `name`, `create_time`) VALUES
(4, '视频', '2026-04-03 17:44:16'),
(5, '猫咪', '2026-04-03 17:44:27'),
(6, '狗狗', '2026-04-03 17:44:35'),
(7, '养宠知识', '2026-04-03 17:46:27'),
(8, '搞笑', '2026-04-13 01:30:06'),
(9, '记录', '2026-04-13 01:30:21');

-- --------------------------------------------------------

--
-- 表的结构 `task_records`
--

CREATE TABLE `task_records` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `task_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务类型（daily_signin, share_app等）',
  `task_date` date NOT NULL COMMENT '任务日期',
  `progress` int NOT NULL DEFAULT '0' COMMENT '任务进度',
  `target` int NOT NULL DEFAULT '1' COMMENT '目标值',
  `completed` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否已完成（0-未完成，1-已完成）',
  `claimed` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否已领取奖励（0-未领取，1-已领取）',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='任务记录表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `task_records`
--

INSERT INTO `task_records` (`id`, `user_id`, `task_type`, `task_date`, `progress`, `target`, `completed`, `claimed`, `create_time`, `update_time`) VALUES
(1, 17, 'daily_signin', '2025-11-17', 1, 1, 1, 1, '2025-11-17 18:28:27', '2025-11-17 18:28:28'),
(2, 17, 'daily_signin', '2025-11-18', 1, 1, 1, 1, '2025-11-18 11:37:08', '2025-11-18 11:44:21'),
(3, 18, 'daily_signin', '2026-01-06', 1, 1, 1, 0, '2026-01-06 17:13:59', '2026-01-06 17:13:59'),
(4, 70, 'daily_signin', '2026-01-07', 1, 1, 1, 1, '2026-01-07 02:09:05', '2026-01-07 02:17:38'),
(5, 70, 'like_content', '2026-01-07', 5, 2, 1, 1, '2026-01-07 02:32:37', '2026-01-07 03:35:00'),
(6, 70, 'like_comment', '2026-01-07', 4, 4, 1, 1, '2026-01-07 02:32:50', '2026-01-07 02:33:49'),
(7, 70, 'post_content', '2026-01-07', 2, 1, 1, 1, '2026-01-07 02:42:56', '2026-01-07 02:42:59'),
(8, 70, 'comment_content', '2026-01-07', 4, 2, 1, 1, '2026-01-07 02:44:03', '2026-01-07 02:44:16'),
(9, 70, 'collect_content', '2026-01-07', 2, 2, 1, 1, '2026-01-07 03:34:49', '2026-01-07 03:35:13'),
(10, 70, 'follow_user', '2026-01-07', 2, 2, 1, 1, '2026-01-07 03:35:14', '2026-01-07 03:35:14'),
(11, 70, 'comment_content', '2026-01-08', 2, 2, 1, 1, '2026-01-08 21:37:52', '2026-01-08 21:38:04'),
(12, 70, 'comment_content', '2026-01-09', 2, 2, 1, 1, '2026-01-09 16:31:53', '2026-01-09 16:32:03'),
(13, 70, 'post_content', '2026-01-09', 1, 1, 1, 1, '2026-01-09 16:42:07', '2026-01-09 16:42:10'),
(14, 70, 'like_comment', '2026-01-09', 5, 4, 1, 1, '2026-01-09 17:07:12', '2026-01-09 17:07:23'),
(15, 70, 'follow_user', '2026-01-09', 3, 2, 1, 0, '2026-01-09 20:58:56', '2026-01-09 21:05:46'),
(16, 68, 'follow_user', '2026-01-09', 6, 2, 1, 0, '2026-01-09 21:06:28', '2026-01-09 21:06:40'),
(17, 67, 'follow_user', '2026-01-09', 4, 2, 1, 0, '2026-01-09 21:08:41', '2026-01-09 21:23:30'),
(18, 18, 'like_content', '2026-01-09', 1, 2, 0, 0, '2026-01-09 21:32:26', '2026-01-09 21:32:26'),
(19, 70, 'collect_content', '2026-01-11', 1, 2, 0, 0, '2026-01-11 03:06:18', '2026-01-11 03:25:49'),
(20, 70, 'like_content', '2026-01-11', 3, 2, 1, 0, '2026-01-11 03:21:56', '2026-01-11 04:06:54'),
(21, 70, 'like_content', '2026-01-12', 5, 2, 1, 0, '2026-01-12 01:42:22', '2026-01-12 16:40:59'),
(22, 70, 'post_content', '2026-01-12', 4, 1, 1, 0, '2026-01-12 02:27:54', '2026-01-12 03:39:05'),
(23, 70, 'collect_content', '2026-01-12', 2, 2, 1, 0, '2026-01-12 03:50:46', '2026-01-12 16:45:11'),
(24, 70, 'comment_content', '2026-01-12', 5, 2, 1, 0, '2026-01-12 16:34:14', '2026-01-12 17:17:29'),
(25, 70, 'like_comment', '2026-01-12', 1, 4, 0, 0, '2026-01-12 16:46:50', '2026-01-12 16:46:50'),
(26, 18, 'like_content', '2026-01-12', 9, 2, 1, 0, '2026-01-12 21:07:09', '2026-01-12 21:43:57'),
(27, 18, 'comment_content', '2026-01-12', 9, 2, 1, 0, '2026-01-12 21:10:44', '2026-01-12 22:01:48'),
(28, 18, 'follow_user', '2026-01-12', 1, 2, 0, 0, '2026-01-12 21:29:23', '2026-01-12 21:29:23'),
(29, 18, 'like_comment', '2026-01-12', 1, 4, 0, 0, '2026-01-12 21:30:07', '2026-01-12 21:30:07'),
(30, 18, 'collect_content', '2026-01-12', 1, 2, 0, 0, '2026-01-12 21:30:11', '2026-01-12 21:30:11'),
(31, 70, 'like_content', '2026-01-13', 1, 2, 0, 0, '2026-01-13 02:54:39', '2026-01-13 02:55:16'),
(32, 18, 'collect_content', '2026-01-17', 1, 2, 0, 0, '2026-01-17 17:50:35', '2026-01-17 17:50:35'),
(33, 18, 'like_comment', '2026-01-19', 3, 4, 0, 0, '2026-01-19 03:43:22', '2026-01-19 03:43:24'),
(34, 18, 'like_content', '2026-01-19', 1, 2, 0, 0, '2026-01-19 03:43:26', '2026-01-19 03:43:26'),
(35, 18, 'collect_content', '2026-01-19', 1, 2, 0, 0, '2026-01-19 03:43:34', '2026-01-19 03:43:34'),
(36, 18, 'comment_content', '2026-01-23', 2, 2, 1, 0, '2026-01-23 23:54:09', '2026-01-23 23:54:09'),
(38, 18, 'like_comment', '2026-01-23', 1, 4, 0, 0, '2026-01-23 23:54:14', '2026-01-23 23:54:14'),
(39, 18, 'collect_content', '2026-01-24', 1, 2, 0, 0, '2026-01-24 01:29:17', '2026-01-24 01:29:17'),
(40, 18, 'like_comment', '2026-01-24', 1, 4, 0, 0, '2026-01-24 01:29:43', '2026-01-24 01:29:43'),
(41, 18, 'follow_user', '2026-01-24', 1, 2, 0, 0, '2026-01-24 01:41:33', '2026-01-24 01:45:36'),
(42, 18, 'post_content', '2026-01-25', 1, 1, 1, 0, '2026-01-25 20:20:31', '2026-01-25 20:20:31'),
(43, 18, 'collect_content', '2026-01-26', 1, 2, 0, 0, '2026-01-26 02:42:55', '2026-01-26 02:48:59'),
(44, 18, 'post_content', '2026-01-26', 3, 1, 1, 0, '2026-01-26 03:26:26', '2026-01-26 20:29:40'),
(45, 70, 'like_content', '2026-01-28', 1, 2, 0, 0, '2026-01-28 06:46:43', '2026-01-28 06:46:43'),
(46, 70, 'comment_content', '2026-01-28', 1, 2, 0, 0, '2026-01-28 07:05:58', '2026-01-28 07:05:58'),
(47, 18, 'like_comment', '2026-01-28', 36, 4, 1, 0, '2026-01-28 21:20:54', '2026-01-28 21:38:14'),
(48, 18, 'like_content', '2026-01-28', 1, 2, 0, 0, '2026-01-28 21:39:15', '2026-01-28 21:39:15'),
(49, 18, 'collect_content', '2026-01-28', 1, 2, 0, 0, '2026-01-28 21:43:15', '2026-01-28 21:48:44'),
(50, 72, 'follow_user', '2026-01-29', 1, 2, 0, 0, '2026-01-29 04:25:38', '2026-01-29 04:25:38'),
(51, 18, 'like_comment', '2026-01-29', 9, 4, 1, 0, '2026-01-29 04:30:46', '2026-01-29 10:46:00'),
(52, 18, 'like_content', '2026-01-29', 1, 2, 0, 0, '2026-01-29 05:10:19', '2026-01-29 05:10:19'),
(53, 70, 'post_content', '2026-01-29', 1, 1, 1, 0, '2026-01-29 06:31:55', '2026-01-29 06:31:55'),
(54, 70, 'like_comment', '2026-01-29', 4, 4, 1, 0, '2026-01-29 06:42:09', '2026-01-29 08:36:11'),
(55, 70, 'comment_content', '2026-01-29', 3, 2, 1, 0, '2026-01-29 06:49:50', '2026-01-29 07:05:24'),
(56, 70, 'like_content', '2026-01-29', 5, 2, 1, 0, '2026-01-29 07:41:49', '2026-01-29 08:10:15'),
(57, 18, 'collect_content', '2026-01-29', 1, 2, 0, 0, '2026-01-29 08:11:11', '2026-01-29 08:11:11'),
(58, 18, 'comment_content', '2026-01-29', 3, 2, 1, 0, '2026-01-29 09:11:04', '2026-01-29 10:40:40'),
(59, 72, 'like_comment', '2026-01-29', 3, 4, 0, 0, '2026-01-29 10:33:02', '2026-01-29 11:14:33'),
(60, 72, 'comment_content', '2026-01-29', 5, 2, 1, 0, '2026-01-29 11:18:26', '2026-01-29 21:04:09'),
(61, 72, 'like_content', '2026-01-29', 1, 2, 0, 0, '2026-01-29 22:27:35', '2026-01-29 22:27:40'),
(62, 72, 'like_content', '2026-01-30', 2, 2, 1, 0, '2026-01-30 01:37:55', '2026-01-30 01:51:12'),
(63, 72, 'collect_content', '2026-01-30', 2, 2, 1, 0, '2026-01-30 01:43:58', '2026-01-30 01:51:26'),
(64, 72, 'post_content', '2026-01-30', 1, 1, 1, 0, '2026-01-30 03:36:10', '2026-01-30 03:36:10'),
(65, 18, 'follow_user', '2026-01-30', 1, 2, 0, 0, '2026-01-30 03:37:27', '2026-01-30 03:37:27'),
(66, 18, 'collect_content', '2026-01-30', 1, 2, 0, 0, '2026-01-30 04:19:53', '2026-01-30 04:19:53'),
(67, 18, 'post_content', '2026-01-30', 1, 1, 1, 0, '2026-01-30 04:21:07', '2026-01-30 04:21:07'),
(68, 70, 'comment_content', '2026-02-02', 1, 2, 0, 0, '2026-02-02 01:16:00', '2026-02-02 01:16:00'),
(69, 70, 'post_content', '2026-02-02', 0, 1, 0, 0, '2026-02-02 17:01:40', '2026-02-02 17:19:02'),
(70, 70, 'comment_content', '2026-02-03', 2, 2, 1, 0, '2026-02-03 01:54:19', '2026-02-03 06:57:56'),
(71, 70, 'collect_content', '2026-02-03', 1, 2, 0, 0, '2026-02-03 02:28:41', '2026-02-03 03:54:19'),
(72, 70, 'post_content', '2026-03-23', 0, 1, 0, 0, '2026-03-23 03:45:31', '2026-03-23 03:45:31'),
(73, 75, 'post_content', '2026-03-24', 0, 1, 0, 0, '2026-03-24 08:43:51', '2026-03-24 08:45:13'),
(74, 75, 'follow_user', '2026-03-24', 1, 2, 0, 0, '2026-03-24 08:47:13', '2026-03-24 08:47:13'),
(75, 76, 'like_content', '2026-03-24', 3, 2, 1, 0, '2026-03-24 08:49:22', '2026-03-24 08:49:24'),
(76, 76, 'comment_content', '2026-03-24', 5, 2, 1, 0, '2026-03-24 08:49:33', '2026-03-24 08:51:12'),
(77, 76, 'like_comment', '2026-03-24', 2, 4, 0, 0, '2026-03-24 08:49:48', '2026-03-24 08:49:48'),
(78, 76, 'collect_content', '2026-03-24', 1, 2, 0, 0, '2026-03-24 08:49:56', '2026-03-24 08:57:13'),
(79, 76, 'follow_user', '2026-03-24', 1, 2, 0, 0, '2026-03-24 08:51:36', '2026-03-24 08:51:36'),
(80, 76, 'post_content', '2026-03-24', 0, 1, 0, 0, '2026-03-24 09:05:40', '2026-03-24 09:10:43'),
(81, 77, 'follow_user', '2026-03-24', 2, 2, 1, 0, '2026-03-24 09:29:19', '2026-03-24 09:29:20'),
(82, 77, 'post_content', '2026-03-24', 0, 1, 0, 0, '2026-03-24 09:30:41', '2026-03-24 09:31:38'),
(83, 76, 'post_content', '2026-03-28', 0, 1, 0, 0, '2026-03-28 23:48:22', '2026-03-28 23:48:22'),
(84, 76, 'comment_content', '2026-04-03', 1, 2, 0, 0, '2026-04-03 21:48:00', '2026-04-03 21:48:00'),
(85, 76, 'like_content', '2026-04-09', 2, 2, 1, 0, '2026-04-09 23:14:25', '2026-04-09 23:14:30'),
(86, 76, 'comment_content', '2026-04-09', 2, 2, 1, 0, '2026-04-09 23:15:08', '2026-04-09 23:15:18'),
(87, 76, 'like_content', '2026-04-12', 2, 2, 1, 1, '2026-04-12 03:57:30', '2026-04-12 17:40:31'),
(88, 76, 'collect_content', '2026-04-12', 1, 2, 0, 0, '2026-04-12 16:33:14', '2026-04-12 16:33:14'),
(89, 76, 'follow_user', '2026-04-12', 1, 2, 0, 0, '2026-04-12 17:13:48', '2026-04-12 17:13:48'),
(90, 76, 'post_content', '2026-04-12', 0, 1, 0, 0, '2026-04-12 17:41:19', '2026-04-12 17:41:19'),
(91, 75, 'like_content', '2026-04-13', 1, 2, 0, 0, '2026-04-13 02:36:17', '2026-04-13 02:36:17'),
(92, 75, 'comment_content', '2026-04-13', 2, 2, 1, 0, '2026-04-13 02:36:23', '2026-04-13 02:42:30'),
(93, 76, 'like_content', '2026-04-13', 1, 2, 0, 0, '2026-04-13 19:01:18', '2026-04-13 19:01:22'),
(94, 76, 'collect_content', '2026-04-13', 1, 2, 0, 0, '2026-04-13 19:01:24', '2026-04-13 19:05:46'),
(95, 75, 'like_comment', '2026-04-20', 4, 4, 1, 0, '2026-04-20 04:51:44', '2026-04-20 04:52:05'),
(96, 75, 'post_content', '2026-04-20', 1, 1, 1, 0, '2026-04-20 04:52:36', '2026-04-20 05:21:10'),
(97, 75, 'follow_user', '2026-04-20', 2, 2, 1, 0, '2026-04-20 04:53:20', '2026-04-20 06:12:43'),
(98, 75, 'collect_content', '2026-04-20', 3, 2, 1, 0, '2026-04-20 04:54:10', '2026-04-20 04:54:21'),
(99, 75, 'like_content', '2026-04-20', 4, 2, 1, 0, '2026-04-20 04:54:31', '2026-04-20 08:40:53'),
(100, 75, 'comment_content', '2026-04-20', 3, 2, 1, 0, '2026-04-20 04:54:42', '2026-04-20 04:54:59'),
(101, 80, 'follow_user', '2026-04-20', 1, 2, 0, 0, '2026-04-20 05:27:12', '2026-04-20 05:27:12'),
(102, 80, 'like_content', '2026-04-20', 1, 2, 0, 0, '2026-04-20 05:32:34', '2026-04-20 05:32:34'),
(103, 79, 'follow_user', '2026-04-20', 1, 2, 0, 0, '2026-04-20 05:34:15', '2026-04-20 05:34:15'),
(104, 75, 'post_content', '2026-04-21', 5, 1, 1, 0, '2026-04-21 00:35:07', '2026-04-21 17:24:24'),
(105, 79, 'post_content', '2026-04-21', 13, 1, 1, 0, '2026-04-21 20:19:14', '2026-04-21 23:22:01'),
(106, 75, 'collect_content', '2026-04-24', 1, 2, 0, 0, '2026-04-24 02:14:47', '2026-04-24 02:15:23'),
(107, 75, 'like_content', '2026-04-30', 5, 2, 1, 0, '2026-04-30 07:40:01', '2026-04-30 08:26:31'),
(108, 80, 'like_content', '2026-04-30', 4, 2, 1, 0, '2026-04-30 07:51:23', '2026-04-30 08:03:47'),
(109, 80, 'collect_content', '2026-04-30', 1, 2, 0, 0, '2026-04-30 07:51:25', '2026-04-30 07:51:25'),
(110, 80, 'comment_content', '2026-04-30', 7, 2, 1, 0, '2026-04-30 07:51:33', '2026-04-30 07:58:56'),
(111, 79, 'like_content', '2026-04-30', 6, 2, 1, 0, '2026-04-30 07:53:03', '2026-04-30 07:55:03'),
(112, 79, 'comment_content', '2026-04-30', 6, 2, 1, 0, '2026-04-30 07:53:07', '2026-04-30 07:54:59'),
(113, 79, 'collect_content', '2026-04-30', 5, 2, 1, 0, '2026-04-30 07:53:12', '2026-04-30 07:55:03'),
(114, 75, 'comment_content', '2026-04-30', 4, 2, 1, 0, '2026-04-30 08:26:06', '2026-04-30 08:26:26');

-- --------------------------------------------------------

--
-- 表的结构 `time_slots`
--

CREATE TABLE `time_slots` (
  `id` bigint NOT NULL,
  `service_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `time_slot` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `max_bookings` int DEFAULT '10',
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `store_id` bigint DEFAULT NULL COMMENT '门店ID，NULL表示历史全局数据'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `time_slots`
--

INSERT INTO `time_slots` (`id`, `service_type`, `time_slot`, `max_bookings`, `is_active`, `created_at`, `updated_at`, `store_id`) VALUES
(1, 'litter', '09:00-10:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(2, 'litter', '10:00-11:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(3, 'litter', '11:00-12:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(4, 'litter', '14:00-15:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(5, 'litter', '15:00-16:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(6, 'litter', '16:00-17:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(7, 'litter', '17:00-18:00', 10, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(8, 'boarding', '09:00-10:00', 5, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(9, 'boarding', '10:00-11:00', 5, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(10, 'boarding', '14:00-15:00', 5, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(11, 'boarding', '15:00-16:00', 5, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(12, 'medical', '09:00-10:00', 8, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(13, 'medical', '10:00-11:00', 8, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(14, 'medical', '14:00-15:00', 8, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(15, 'medical', '15:00-16:00', 8, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(16, 'medical', '16:00-17:00', 8, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(17, 'grooming', '09:00-10:00', 6, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(18, 'grooming', '10:00-11:00', 6, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(19, 'grooming', '14:00-15:00', 6, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(20, 'grooming', '15:00-16:00', 6, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(21, 'adoption', '09:00-12:00', 20, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(22, 'adoption', '14:00-17:00', 20, 1, '2025-10-18 16:41:12', '2025-10-18 16:41:12', NULL),
(23, 'door-cleaning', '09:00-10:00', 1, 1, '2025-11-07 08:39:37', '2025-11-08 13:26:38', NULL),
(24, 'door-cleaning', '10:00-11:00', 1, 1, '2025-11-07 13:49:14', '2025-11-08 13:26:42', NULL),
(25, 'door-cleaning', '11:00-12:00', 1, 1, '2025-11-07 13:49:45', '2025-11-08 13:26:45', NULL),
(26, 'door-cleaning', '14:00-15:00', 1, 1, '2025-11-07 13:50:14', '2025-11-08 13:26:49', NULL),
(27, 'door-cleaning', '15:00-16:00', 1, 1, '2025-11-07 13:50:35', '2025-11-08 13:26:53', NULL),
(28, 'door-cleaning', '16:00-17:00', 1, 1, '2025-11-07 13:50:51', '2025-11-08 13:26:56', NULL),
(29, 'door-cleaning', '17:00-18:00', 1, 1, '2025-11-07 13:51:06', '2025-11-08 13:27:02', NULL),
(30, 'hospital', '08:00-09:00', 6, 1, '2025-11-09 16:01:21', '2025-11-09 16:01:21', NULL),
(31, 'hospital', '09:00-10:00', 6, 1, '2025-11-09 16:01:21', '2025-11-09 16:01:21', NULL),
(32, 'hospital', '10:00-11:00', 6, 1, '2025-11-09 16:01:21', '2025-11-09 16:01:21', NULL),
(33, 'hospital', '14:00-15:00', 6, 1, '2025-11-09 16:01:21', '2025-11-09 16:01:21', NULL),
(34, 'hospital', '15:00-16:00', 6, 1, '2025-11-09 16:01:21', '2025-11-09 16:01:21', NULL),
(35, 'hospital', '16:00-17:00', 6, 1, '2025-11-09 16:01:21', '2025-11-09 16:01:21', NULL),
(41, 'store_admin', '08:00-12:00', 6, 1, '2026-04-23 17:08:02', '2026-04-23 17:08:02', 1),
(42, 'store_admin', '08:00-11:30', 1, 1, '2026-04-23 18:08:04', '2026-04-23 18:08:04', NULL),
(43, 'store_admin', '13:30-18:00', 1, 1, '2026-04-23 18:08:49', '2026-04-23 18:08:49', NULL),
(44, 'door-cleaning', '08:00-10:00', 1, 1, '2026-04-23 19:41:33', '2026-04-23 19:41:33', 1),
(45, 'door-cleaning', '10:00-12:00', 1, 1, '2026-04-26 16:04:37', '2026-04-26 16:04:37', 1),
(46, 'door-cleaning', '14:00-16:00', 1, 1, '2026-04-26 16:06:36', '2026-04-26 16:06:36', 1),
(47, 'door-cleaning', '16:00-18:00', 1, 1, '2026-04-26 16:06:53', '2026-04-26 16:06:53', 1),
(81, 'hospital', '08:00-09:00', 1, 1, '2026-04-26 18:01:14', '2026-04-26 18:01:14', 1),
(82, 'hospital', '09:00-10:00', 1, 1, '2026-04-26 18:05:12', '2026-04-26 18:05:12', 1),
(83, 'grooming', '08:00-10:00', 1, 1, '2026-04-27 03:38:03', '2026-04-27 03:38:03', 1);

-- --------------------------------------------------------

--
-- 表的结构 `topic_collect`
--

CREATE TABLE `topic_collect` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `topic_id` bigint NOT NULL COMMENT '专题ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='专题收藏表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `topic_collect`
--

INSERT INTO `topic_collect` (`id`, `topic_id`, `user_id`, `create_time`) VALUES
(2, 20, 70, '2026-02-03 02:36:01'),
(3, 20, 76, '2026-03-24 08:50:37'),
(4, 38, 76, '2026-04-13 19:05:46'),
(5, 21, 75, '2026-04-24 02:15:08');

-- --------------------------------------------------------

--
-- 表的结构 `topic_like`
--

CREATE TABLE `topic_like` (
  `id` bigint NOT NULL COMMENT '主键ID',
  `topic_id` bigint NOT NULL COMMENT '专题ID',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='专题点赞表' ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `topic_like`
--

INSERT INTO `topic_like` (`id`, `topic_id`, `user_id`, `create_time`) VALUES
(1, 20, 70, '2026-02-03 02:28:40'),
(2, 20, 76, '2026-03-24 08:50:40'),
(3, 38, 76, '2026-04-13 19:05:47');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int NOT NULL,
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `role` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'user' COMMENT '用户角色：user-普通用户, admin-管理员',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `background_image` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '用户背景图URL',
  `signature` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL COMMENT '个性签名',
  `openid` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '微信小程序openid',
  `unionid` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '微信unionid（用于多平台统一用户）',
  `nickname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `gender` int DEFAULT '0',
  `birthday` date DEFAULT NULL,
  `address` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `points` int NOT NULL DEFAULT '0' COMMENT '用户积分',
  `status` int DEFAULT '1',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `member_level` int DEFAULT '1' COMMENT '会员等级：1-普通会员,2-青铜会员,3-白银会员,4-黄金会员,5-钻石会员',
  `charm` int DEFAULT '0' COMMENT '魅力值：所有历史积分的累计总和',
  `total_spent` decimal(10,2) DEFAULT '0.00' COMMENT '累计消费金额',
  `interest_tags` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '用户兴趣标签，逗号分隔，与帖子tags匹配',
  `username_updated_at` datetime DEFAULT NULL COMMENT '账号上次修改时间（每1年可修改1次）'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `password`, `email`, `role`, `phone`, `avatar`, `background_image`, `signature`, `openid`, `unionid`, `nickname`, `gender`, `birthday`, `address`, `points`, `status`, `create_time`, `update_time`, `member_level`, `charm`, `total_spent`, `interest_tags`, `username_updated_at`) VALUES
(75, NULL, 'e10adc3949ba59abbe56e057f20f883e', NULL, 'user', '15278562765', 'https://situationship.icu/upload/files/files-20260428163928-6b3dcff4.jpg', 'https://situationship.icu/upload/files/files-20260324083856-8fb49eb9.jpg', NULL, NULL, NULL, '用户01', 0, NULL, NULL, 6029, 1, '2026-03-24 08:27:32', '2026-04-28 16:39:29', 0, 170, '0.00', NULL, NULL),
(77, 'wx_or25g3VzHJjFhZFC', 'e9b53c01ba50e3b7bd06324230dcd912', 'wx_or25g3VzHJjFhZFC5dhmzjreMVho@pethome.com', 'user', NULL, 'https://situationship.icu/upload/files/files-20260324092831-a28ebebf.jpg', 'https://situationship.icu/upload/files/files-20260324092857-1dcb6546.jpg', '', 'or25g3VzHJjFhZFC5dhmzjreMVho', NULL, '用户03', 0, NULL, NULL, 120, 1, '2026-03-24 09:27:06', '2026-03-24 09:28:57', 0, 120, '0.00', NULL, NULL),
(79, NULL, 'e10adc3949ba59abbe56e057f20f883e', NULL, 'user', '19012544114', 'https://situationship.icu/upload/files/files-20260421174530-36bb3f54.jpg', 'https://situationship.icu/upload/files/files-20260421173348-dc1f0adf.jpg', 'cpdd', NULL, NULL, '用户04', 0, NULL, NULL, 130, 1, '2026-04-18 17:09:32', '2026-04-21 17:49:23', 0, 130, '0.00', NULL, NULL),
(80, 'wx_or25g3alLwO1B_R-', '', 'wx_or25g3alLwO1B_R-FwqNjBG_8Cus@pethome.com', 'user', NULL, '/static/images/login-dog.png', 'https://situationship.icu/upload/files/files-20260421173008-900127ee.jpg', '', 'or25g3alLwO1B_R-FwqNjBG_8Cus', NULL, '用户02', 0, NULL, NULL, 130, 1, '2026-04-19 18:08:55', '2026-04-21 17:32:12', 0, 130, '0.00', NULL, NULL),
(81, 'wx_or25g3epl80LtG-h', '', 'wx_or25g3epl80LtG-hQVQuXph31ASY@pethome.com', 'user', NULL, '/static/images/garfield-default-avatar.png', NULL, NULL, 'or25g3epl80LtG-hQVQuXph31ASY', NULL, '微信用户or25g3ep', 0, NULL, NULL, 120, 1, '2026-04-28 20:19:22', '2026-04-28 20:19:22', 0, 120, '0.00', NULL, NULL),
(82, 'wx_or25g3cidQuiqGOr', '', 'wx_or25g3cidQuiqGOriF7vAweXK0Ck@pethome.com', 'user', NULL, '/static/images/garfield-default-avatar.png', NULL, NULL, 'or25g3cidQuiqGOriF7vAweXK0Ck', NULL, '微信用户or25g3ci', 0, NULL, NULL, 120, 1, '2026-04-28 21:08:09', '2026-04-28 21:08:09', 0, 120, '0.00', NULL, NULL);

-- --------------------------------------------------------

--
-- 表的结构 `user_follow`
--

CREATE TABLE `user_follow` (
  `id` int NOT NULL,
  `follower_id` int NOT NULL,
  `following_id` int NOT NULL,
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `user_follow`
--

INSERT INTO `user_follow` (`id`, `follower_id`, `following_id`, `create_time`) VALUES
(16, 62, 17, '2025-11-24 10:27:56'),
(18, 62, 18, '2025-11-24 19:14:49'),
(20, 70, 18, '2026-01-07 02:32:43'),
(21, 70, 62, '2026-01-07 02:34:26'),
(22, 70, 68, '2026-01-09 20:58:56'),
(23, 70, 63, '2026-01-09 21:00:53'),
(24, 70, 67, '2026-01-09 21:05:46'),
(25, 68, 64, '2026-01-09 21:06:28'),
(26, 68, 70, '2026-01-09 21:06:30'),
(27, 68, 18, '2026-01-09 21:06:36'),
(28, 68, 62, '2026-01-09 21:06:38'),
(29, 68, 67, '2026-01-09 21:06:39'),
(30, 68, 63, '2026-01-09 21:06:40'),
(32, 67, 18, '2026-01-09 21:08:41'),
(36, 67, 62, '2026-01-09 21:09:03'),
(38, 67, 70, '2026-01-09 21:16:11'),
(40, 18, 70, '2026-01-12 21:29:23'),
(44, 18, 62, '2026-01-24 01:45:36'),
(45, 72, 18, '2026-01-29 04:25:38'),
(46, 18, 72, '2026-01-30 03:37:27'),
(47, 75, 76, '2026-03-24 08:47:13'),
(48, 76, 75, '2026-03-24 08:51:36'),
(49, 77, 75, '2026-03-24 09:29:19'),
(50, 77, 76, '2026-03-24 09:29:20'),
(51, 76, 77, '2026-04-12 17:13:48'),
(52, 75, 77, '2026-04-20 04:53:20'),
(53, 80, 75, '2026-04-20 05:27:12'),
(54, 79, 75, '2026-04-20 05:34:15'),
(55, 75, 79, '2026-04-20 06:12:43');

-- --------------------------------------------------------

--
-- 表的结构 `user_hidden_conversation`
--

CREATE TABLE `user_hidden_conversation` (
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `conversation_id` varchar(128) NOT NULL COMMENT '会话ID，与 message.conversation_id 或小程序端 doctor_{id} 一致',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户侧隐藏的会话';

--
-- 转存表中的数据 `user_hidden_conversation`
--

INSERT INTO `user_hidden_conversation` (`user_id`, `conversation_id`, `create_time`) VALUES
(75, '75_76', '2026-04-20 05:33:31'),
(76, 'service_1_76', '2026-04-15 02:51:18');

-- --------------------------------------------------------

--
-- 表的结构 `user_notice_read`
--

CREATE TABLE `user_notice_read` (
  `id` bigint NOT NULL,
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `notice_id` bigint NOT NULL COMMENT '公告ID（notice.id）',
  `read_at` datetime NOT NULL COMMENT '已读时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户公告已读记录';

--
-- 转存表中的数据 `user_notice_read`
--

INSERT INTO `user_notice_read` (`id`, `user_id`, `notice_id`, `read_at`) VALUES
(1, 73, 1, '2026-03-19 23:08:18'),
(2, 73, 2, '2026-03-19 23:08:18'),
(3, 76, 2, '2026-03-28 17:39:22'),
(4, 75, 2, '2026-04-13 20:58:53'),
(5, 80, 2, '2026-04-20 05:32:20'),
(6, 75, 4, '2026-05-02 02:53:46'),
(7, 75, 3, '2026-05-02 02:54:42');

-- --------------------------------------------------------

--
-- 表的结构 `user_post_interaction`
--

CREATE TABLE `user_post_interaction` (
  `id` bigint NOT NULL COMMENT '主键',
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `post_id` bigint NOT NULL COMMENT '帖子ID',
  `interaction_type` varchar(20) NOT NULL COMMENT '行为类型: like/comment/collect/view',
  `score` decimal(10,2) NOT NULL DEFAULT '1.00' COMMENT '行为分值',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '行为发生时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户-帖子互动行为表';

--
-- 转存表中的数据 `user_post_interaction`
--

INSERT INTO `user_post_interaction` (`id`, `user_id`, `post_id`, `interaction_type`, `score`, `create_time`) VALUES
(1, 1, 4, 'like', '3.00', '2025-10-27 22:30:27'),
(2, 18, 4, 'like', '3.00', '2025-10-28 13:23:20'),
(3, 18, 1, 'like', '3.00', '2025-10-28 13:23:22'),
(4, 18, 3, 'like', '3.00', '2025-10-28 13:23:23'),
(5, 18, 9, 'like', '3.00', '2025-10-28 16:56:38'),
(6, 18, 15, 'like', '3.00', '2025-11-01 21:17:49'),
(7, 17, 18, 'like', '3.00', '2025-11-02 22:09:27'),
(8, 62, 18, 'like', '3.00', '2025-11-24 10:46:37'),
(9, 62, 22, 'like', '3.00', '2025-11-25 17:20:31'),
(10, 18, 21, 'like', '3.00', '2025-11-27 23:31:54'),
(11, 18, 19, 'like', '3.00', '2025-11-27 23:32:02'),
(12, 70, 21, 'like', '3.00', '2026-01-07 02:33:07'),
(13, 70, 20, 'like', '3.00', '2026-01-07 02:33:11'),
(14, 70, 36, 'like', '3.00', '2026-01-11 03:46:23'),
(15, 70, 35, 'like', '3.00', '2026-01-11 04:06:54'),
(16, 70, 39, 'like', '3.00', '2026-01-12 03:40:17'),
(17, 70, 38, 'like', '3.00', '2026-01-12 03:40:19'),
(18, 70, 37, 'like', '3.00', '2026-01-12 03:40:19'),
(19, 70, 40, 'like', '3.00', '2026-01-12 16:40:59'),
(20, 18, 20, 'like', '3.00', '2026-01-12 21:07:09'),
(21, 18, 23, 'like', '3.00', '2026-01-12 21:07:11'),
(22, 18, 35, 'like', '3.00', '2026-01-12 21:10:58'),
(23, 18, 39, 'like', '3.00', '2026-01-12 21:11:05'),
(24, 18, 40, 'like', '3.00', '2026-01-12 21:11:06'),
(25, 18, 38, 'like', '3.00', '2026-01-12 21:11:07'),
(26, 18, 37, 'like', '3.00', '2026-01-12 21:11:08'),
(27, 18, 36, 'like', '3.00', '2026-01-12 21:11:10'),
(28, 70, 34, 'like', '3.00', '2026-01-13 02:55:16'),
(29, 18, 34, 'like', '3.00', '2026-01-19 03:43:26'),
(30, 70, 43, 'like', '3.00', '2026-01-28 06:46:43'),
(31, 18, 22, 'like', '3.00', '2026-01-29 05:10:19'),
(32, 70, 45, 'like', '3.00', '2026-01-29 07:52:52'),
(33, 70, 41, 'like', '3.00', '2026-01-29 07:52:53'),
(34, 70, 44, 'like', '3.00', '2026-01-29 07:52:55'),
(35, 70, 23, 'like', '3.00', '2026-01-29 08:04:15'),
(36, 72, 22, 'like', '3.00', '2026-01-30 01:46:32'),
(37, 72, 42, 'like', '3.00', '2026-01-30 01:51:12'),
(38, 76, 54, 'like', '3.00', '2026-03-24 08:49:22'),
(39, 76, 53, 'like', '3.00', '2026-03-24 08:49:23'),
(40, 76, 52, 'like', '3.00', '2026-03-24 08:49:24'),
(64, 70, 35, 'collect', '4.00', '2026-01-07 03:34:59'),
(65, 70, 22, 'collect', '4.00', '2026-01-12 03:50:46'),
(66, 70, 40, 'collect', '4.00', '2026-01-12 16:45:11'),
(67, 18, 35, 'collect', '4.00', '2026-01-12 21:30:11'),
(68, 18, 34, 'collect', '4.00', '2026-01-19 03:43:34'),
(69, 72, 42, 'collect', '4.00', '2026-01-30 01:51:18'),
(70, 70, 23, 'collect', '4.00', '2026-02-03 03:54:19'),
(71, 76, 52, 'collect', '4.00', '2026-03-24 08:49:56'),
(79, 76, 52, 'comment', '2.00', '2026-03-24 08:49:55'),
(80, 76, 53, 'comment', '2.00', '2026-03-24 08:49:42'),
(81, 76, 53, 'comment', '2.00', '2026-03-24 08:49:45'),
(82, 76, 54, 'comment', '2.00', '2026-03-24 08:49:33'),
(83, 79, 66, 'like', '3.00', '2026-04-28 10:00:00'),
(84, 79, 66, 'collect', '4.00', '2026-04-28 10:01:00'),
(85, 79, 69, 'like', '3.00', '2026-04-29 14:00:00'),
(86, 79, 71, 'comment', '2.00', '2026-04-29 16:00:00'),
(87, 75, 64, 'like', '3.00', '2026-04-29 09:00:00'),
(88, 75, 65, 'collect', '4.00', '2026-04-29 09:05:00'),
(89, 75, 66, 'like', '3.00', '2026-04-29 09:10:00'),
(90, 75, 74, 'like', '3.00', '2026-04-29 09:15:00'),
(91, 75, 80, 'collect', '4.00', '2026-04-29 09:20:00'),
(92, 75, 82, 'like', '3.00', '2026-04-29 09:25:00'),
(93, 75, 69, 'like', '3.00', '2026-04-29 09:30:00'),
(94, 75, 77, 'collect', '4.00', '2026-04-29 10:00:00'),
(95, 75, 77, 'like', '3.00', '2026-04-29 10:01:00'),
(96, 75, 78, 'comment', '2.00', '2026-04-29 11:00:00'),
(97, 80, 64, 'like', '3.00', '2026-04-29 10:00:00'),
(98, 80, 65, 'collect', '4.00', '2026-04-29 10:05:00'),
(99, 80, 66, 'like', '3.00', '2026-04-29 10:10:00'),
(100, 80, 74, 'like', '3.00', '2026-04-29 10:15:00'),
(101, 80, 75, 'like', '3.00', '2026-04-29 10:20:00'),
(102, 80, 80, 'collect', '4.00', '2026-04-29 10:25:00'),
(103, 80, 82, 'like', '3.00', '2026-04-29 10:30:00'),
(104, 80, 77, 'like', '3.00', '2026-04-29 11:00:00'),
(105, 80, 78, 'like', '3.00', '2026-04-29 11:05:00'),
(106, 70, 55, 'like', '3.00', '2026-04-29 08:00:00'),
(107, 70, 55, 'collect', '4.00', '2026-04-29 08:01:00'),
(108, 70, 56, 'like', '3.00', '2026-04-29 08:10:00'),
(109, 70, 61, 'like', '3.00', '2026-04-29 08:20:00'),
(110, 70, 61, 'collect', '4.00', '2026-04-29 08:21:00'),
(111, 18, 55, 'like', '3.00', '2026-04-29 09:00:00'),
(112, 18, 56, 'collect', '4.00', '2026-04-29 09:05:00'),
(113, 18, 61, 'like', '3.00', '2026-04-29 09:10:00'),
(114, 79, 66, 'like', '3.00', '2026-04-28 10:00:00'),
(115, 79, 66, 'collect', '4.00', '2026-04-28 10:01:00'),
(116, 79, 69, 'like', '3.00', '2026-04-29 14:00:00'),
(117, 79, 71, 'comment', '2.00', '2026-04-29 16:00:00'),
(118, 75, 64, 'like', '3.00', '2026-04-29 09:00:00'),
(119, 75, 65, 'collect', '4.00', '2026-04-29 09:05:00'),
(120, 75, 66, 'like', '3.00', '2026-04-29 09:10:00'),
(121, 75, 74, 'like', '3.00', '2026-04-29 09:15:00'),
(122, 75, 80, 'collect', '4.00', '2026-04-29 09:20:00'),
(123, 75, 82, 'like', '3.00', '2026-04-29 09:25:00'),
(124, 75, 69, 'like', '3.00', '2026-04-29 09:30:00'),
(125, 75, 77, 'collect', '4.00', '2026-04-29 10:00:00'),
(126, 75, 77, 'like', '3.00', '2026-04-29 10:01:00'),
(127, 75, 78, 'comment', '2.00', '2026-04-29 11:00:00'),
(128, 80, 64, 'like', '3.00', '2026-04-29 10:00:00'),
(129, 80, 65, 'collect', '4.00', '2026-04-29 10:05:00'),
(130, 80, 66, 'like', '3.00', '2026-04-29 10:10:00'),
(131, 80, 74, 'like', '3.00', '2026-04-29 10:15:00'),
(132, 80, 75, 'like', '3.00', '2026-04-29 10:20:00'),
(133, 80, 80, 'collect', '4.00', '2026-04-29 10:25:00'),
(134, 80, 82, 'like', '3.00', '2026-04-29 10:30:00'),
(135, 80, 77, 'like', '3.00', '2026-04-29 11:00:00'),
(136, 80, 78, 'like', '3.00', '2026-04-29 11:05:00'),
(137, 70, 55, 'like', '3.00', '2026-04-29 08:00:00'),
(138, 70, 55, 'collect', '4.00', '2026-04-29 08:01:00'),
(139, 70, 56, 'like', '3.00', '2026-04-29 08:10:00'),
(140, 70, 61, 'like', '3.00', '2026-04-29 08:20:00'),
(141, 70, 61, 'collect', '4.00', '2026-04-29 08:21:00'),
(142, 18, 55, 'like', '3.00', '2026-04-29 09:00:00'),
(143, 18, 56, 'collect', '4.00', '2026-04-29 09:05:00'),
(144, 18, 61, 'like', '3.00', '2026-04-29 09:10:00'),
(145, 79, 66, 'like', '3.00', '2026-04-28 10:00:00'),
(146, 79, 66, 'collect', '4.00', '2026-04-28 10:01:00'),
(147, 79, 69, 'like', '3.00', '2026-04-29 14:00:00'),
(148, 79, 71, 'comment', '2.00', '2026-04-29 16:00:00'),
(149, 75, 64, 'like', '3.00', '2026-04-29 09:00:00'),
(150, 75, 65, 'collect', '4.00', '2026-04-29 09:05:00'),
(151, 75, 66, 'like', '3.00', '2026-04-29 09:10:00'),
(152, 75, 74, 'like', '3.00', '2026-04-29 09:15:00'),
(153, 75, 80, 'collect', '4.00', '2026-04-29 09:20:00'),
(154, 75, 82, 'like', '3.00', '2026-04-29 09:25:00'),
(155, 75, 69, 'like', '3.00', '2026-04-29 09:30:00'),
(156, 75, 77, 'collect', '4.00', '2026-04-29 10:00:00'),
(157, 75, 77, 'like', '3.00', '2026-04-29 10:01:00'),
(158, 75, 78, 'comment', '2.00', '2026-04-29 11:00:00'),
(159, 80, 64, 'like', '3.00', '2026-04-29 10:00:00'),
(160, 80, 65, 'collect', '4.00', '2026-04-29 10:05:00'),
(161, 80, 66, 'like', '3.00', '2026-04-29 10:10:00'),
(162, 80, 74, 'like', '3.00', '2026-04-29 10:15:00'),
(163, 80, 75, 'like', '3.00', '2026-04-29 10:20:00'),
(164, 80, 80, 'collect', '4.00', '2026-04-29 10:25:00'),
(165, 80, 82, 'like', '3.00', '2026-04-29 10:30:00'),
(166, 80, 77, 'like', '3.00', '2026-04-29 11:00:00'),
(167, 80, 78, 'like', '3.00', '2026-04-29 11:05:00'),
(168, 70, 55, 'like', '3.00', '2026-04-29 08:00:00'),
(169, 70, 55, 'collect', '4.00', '2026-04-29 08:01:00'),
(170, 70, 56, 'like', '3.00', '2026-04-29 08:10:00'),
(171, 70, 61, 'like', '3.00', '2026-04-29 08:20:00'),
(172, 70, 61, 'collect', '4.00', '2026-04-29 08:21:00'),
(173, 18, 55, 'like', '3.00', '2026-04-29 09:00:00'),
(174, 18, 56, 'collect', '4.00', '2026-04-29 09:05:00'),
(175, 18, 61, 'like', '3.00', '2026-04-29 09:10:00');

--
-- 转储表的索引
--

--
-- 表的索引 `addresses`
--
ALTER TABLE `addresses`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_is_default` (`is_default`) USING BTREE;

--
-- 表的索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `username` (`username`) USING BTREE,
  ADD KEY `idx_username` (`username`) USING BTREE,
  ADD KEY `idx_role` (`role`) USING BTREE,
  ADD KEY `idx_department` (`department`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_store_id` (`store_id`) USING BTREE,
  ADD KEY `idx_doctor_id` (`doctor_id`) USING BTREE;

--
-- 表的索引 `admin_permissions`
--
ALTER TABLE `admin_permissions`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_admin_permission` (`admin_id`,`permission_code`) USING BTREE,
  ADD KEY `idx_admin_id` (`admin_id`) USING BTREE,
  ADD KEY `idx_permission_code` (`permission_code`) USING BTREE;

--
-- 表的索引 `appointment_cancellation_request`
--
ALTER TABLE `appointment_cancellation_request`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_appointment` (`appointment_type`,`appointment_id`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `idx_user` (`user_id`);

--
-- 表的索引 `appointment_change_request`
--
ALTER TABLE `appointment_change_request`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_appointment` (`appointment_type`,`appointment_id`),
  ADD KEY `idx_status` (`status`);

--
-- 表的索引 `appointment_reminder_sent`
--
ALTER TABLE `appointment_reminder_sent`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uk_appointment_remind` (`appointment_type`,`appointment_id`,`remind_type`);

--
-- 表的索引 `banner`
--
ALTER TABLE `banner`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `china_region`
--
ALTER TABLE `china_region`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `code` (`code`) USING BTREE,
  ADD KEY `idx_code` (`code`) USING BTREE,
  ADD KEY `idx_parent_code` (`parent_code`) USING BTREE,
  ADD KEY `idx_level` (`level`) USING BTREE;

--
-- 表的索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_post_id` (`post_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_topic_id` (`topic_id`) USING BTREE;

--
-- 表的索引 `comment_like`
--
ALTER TABLE `comment_like`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_comment_user` (`comment_id`,`user_id`) USING BTREE,
  ADD KEY `idx_user` (`user_id`) USING BTREE,
  ADD KEY `idx_comment` (`comment_id`) USING BTREE;

--
-- 表的索引 `complaints`
--
ALTER TABLE `complaints`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_create_time` (`create_time`) USING BTREE;

--
-- 表的索引 `daily_topic`
--
ALTER TABLE `daily_topic`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_publish_date` (`publish_date`) USING BTREE,
  ADD KEY `idx_theme` (`theme`) USING BTREE;

--
-- 表的索引 `daily_topic_post`
--
ALTER TABLE `daily_topic_post`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_topic_post` (`topic_id`,`post_id`) USING BTREE,
  ADD KEY `idx_topic_id` (`topic_id`) USING BTREE,
  ADD KEY `idx_post_id` (`post_id`) USING BTREE;

--
-- 表的索引 `daily_topic_theme`
--
ALTER TABLE `daily_topic_theme`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uk_code` (`code`);

--
-- 表的索引 `department`
--
ALTER TABLE `department`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `service_type` (`service_type`) USING BTREE,
  ADD UNIQUE KEY `uk_service_type` (`service_type`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_department_store_id` (`store_id`) USING BTREE;

--
-- 表的索引 `door_cleaning_appointment`
--
ALTER TABLE `door_cleaning_appointment`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_pet_id` (`pet_id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_appointment_verify_code` (`verify_code`) USING BTREE,
  ADD KEY `idx_member_id_appt` (`member_id`) USING BTREE,
  ADD KEY `idx_appointment_date_appt` (`appointment_date`) USING BTREE;

--
-- 表的索引 `grooming_appointments`
--
ALTER TABLE `grooming_appointments`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_pet_id` (`pet_id`) USING BTREE,
  ADD KEY `idx_service_id` (`service_id`) USING BTREE,
  ADD KEY `idx_date` (`date`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE;

--
-- 表的索引 `grooming_services`
--
ALTER TABLE `grooming_services`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_category` (`category`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_sort_order` (`sort_order`) USING BTREE,
  ADD KEY `idx_is_recommended` (`is_recommended`) USING BTREE,
  ADD KEY `idx_created_at` (`created_at`) USING BTREE;

--
-- 表的索引 `grooming_service_banners`
--
ALTER TABLE `grooming_service_banners`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `hospital_appointments`
--
ALTER TABLE `hospital_appointments`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_pet_id` (`pet_id`) USING BTREE,
  ADD KEY `idx_date` (`date`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE;

--
-- 表的索引 `hospital_services`
--
ALTER TABLE `hospital_services`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `litter_services`
--
ALTER TABLE `litter_services`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `litter_service_banners`
--
ALTER TABLE `litter_service_banners`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `medical_service_banners`
--
ALTER TABLE `medical_service_banners`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_conversation_id` (`conversation_id`) USING BTREE,
  ADD KEY `idx_from_id` (`from_id`) USING BTREE,
  ADD KEY `idx_to_id` (`to_id`) USING BTREE,
  ADD KEY `idx_create_time` (`create_time`) USING BTREE;

--
-- 表的索引 `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_type` (`type`) USING BTREE,
  ADD KEY `idx_effective_time` (`effective_time`) USING BTREE,
  ADD KEY `idx_expire_time` (`expire_time`) USING BTREE,
  ADD KEY `idx_is_top_sort` (`is_top`,`sort_order`) USING BTREE;

--
-- 表的索引 `notification`
--
ALTER TABLE `notification`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE;

--
-- 表的索引 `order_item`
--
ALTER TABLE `order_item`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_order_id` (`order_id`) USING BTREE,
  ADD KEY `idx_product_id` (`product_id`) USING BTREE;

--
-- 表的索引 `order_logistics_track`
--
ALTER TABLE `order_logistics_track`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_order_id` (`order_id`) USING BTREE,
  ADD KEY `idx_tracking_time` (`tracking_time`) USING BTREE;

--
-- 表的索引 `payment`
--
ALTER TABLE `payment`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_order_id` (`order_id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE;

--
-- 表的索引 `pet`
--
ALTER TABLE `pet`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `pet_order`
--
ALTER TABLE `pet_order`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `order_no` (`order_no`) USING BTREE;

--
-- 表的索引 `points_record`
--
ALTER TABLE `points_record`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_type` (`type`) USING BTREE;

--
-- 表的索引 `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `post_collect`
--
ALTER TABLE `post_collect`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_post_user` (`post_id`,`user_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_post_id` (`post_id`) USING BTREE,
  ADD KEY `idx_create_time` (`create_time`) USING BTREE;

--
-- 表的索引 `post_like`
--
ALTER TABLE `post_like`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_post_user` (`post_id`,`user_id`) USING BTREE,
  ADD KEY `idx_post_id` (`post_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `post_tag`
--
ALTER TABLE `post_tag`
  ADD PRIMARY KEY (`post_id`,`tag_id`) USING BTREE,
  ADD KEY `idx_post_id` (`post_id`) USING BTREE,
  ADD KEY `idx_tag_id` (`tag_id`) USING BTREE;

--
-- 表的索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `product_favorite`
--
ALTER TABLE `product_favorite`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_user_product` (`user_id`,`product_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_product_id` (`product_id`) USING BTREE;

--
-- 表的索引 `product_review`
--
ALTER TABLE `product_review`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_product_id` (`product_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `recommendation_interaction_weight`
--
ALTER TABLE `recommendation_interaction_weight`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uk_interaction_type` (`interaction_type`),
  ADD KEY `idx_status` (`status`);

--
-- 表的索引 `refund_request`
--
ALTER TABLE `refund_request`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_order_id` (`order_id`) USING BTREE,
  ADD KEY `idx_order_no` (`order_no`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE;

--
-- 表的索引 `review_like`
--
ALTER TABLE `review_like`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_review_user` (`review_id`,`user_id`) USING BTREE,
  ADD KEY `idx_review_id` (`review_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `review_reply`
--
ALTER TABLE `review_reply`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_review_id` (`review_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_create_time` (`create_time`) USING BTREE;

--
-- 表的索引 `service_appointment_rating`
--
ALTER TABLE `service_appointment_rating`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_appointment_user` (`appointment_type`,`appointment_id`,`user_id`) USING BTREE COMMENT '同一预约同一用户只能评价一次',
  ADD KEY `idx_member_id` (`member_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `service_config`
--
ALTER TABLE `service_config`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_service_type` (`service_type`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_sort_order` (`sort_order`) USING BTREE;

--
-- 表的索引 `service_member`
--
ALTER TABLE `service_member`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uniq_member` (`service_type`,`store_id`,`member_name`),
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_service_type` (`service_type`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_store_id` (`store_id`) USING BTREE;

--
-- 表的索引 `service_schedule`
--
ALTER TABLE `service_schedule`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_member_date_slot` (`member_id`,`date`,`time_slot`) USING BTREE,
  ADD KEY `idx_member_id` (`member_id`) USING BTREE,
  ADD KEY `idx_date` (`date`) USING BTREE,
  ADD KEY `idx_status` (`status`) USING BTREE,
  ADD KEY `idx_task_id` (`task_id`) USING BTREE,
  ADD KEY `idx_service_member` (`service_type`,`member_id`) USING BTREE,
  ADD KEY `idx_service_date` (`service_type`,`date`) USING BTREE,
  ADD KEY `idx_member_date` (`member_id`,`date`) USING BTREE,
  ADD KEY `idx_date_slot` (`date`,`time_slot`) USING BTREE,
  ADD KEY `idx_store_id` (`store_id`);

--
-- 表的索引 `service_stores`
--
ALTER TABLE `service_stores`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `shopping_cart`
--
ALTER TABLE `shopping_cart`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `user_id` (`user_id`,`product_id`) USING BTREE;

--
-- 表的索引 `sign_in_records`
--
ALTER TABLE `sign_in_records`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_user_date` (`user_id`,`sign_date`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_sign_date` (`sign_date`) USING BTREE;

--
-- 表的索引 `stores`
--
ALTER TABLE `stores`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx_owner_id` (`owner_id`) USING BTREE;

--
-- 表的索引 `store_warehouse`
--
ALTER TABLE `store_warehouse`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_store_id` (`store_id`);

--
-- 表的索引 `tag`
--
ALTER TABLE `tag`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `name` (`name`) USING BTREE,
  ADD KEY `idx_name` (`name`) USING BTREE;

--
-- 表的索引 `task_records`
--
ALTER TABLE `task_records`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_user_task_date` (`user_id`,`task_type`,`task_date`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_task_type` (`task_type`) USING BTREE,
  ADD KEY `idx_task_date` (`task_date`) USING BTREE;

--
-- 表的索引 `time_slots`
--
ALTER TABLE `time_slots`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_time_slots_store_service_slot` (`store_id`,`service_type`,`time_slot`),
  ADD KEY `idx_service_type` (`service_type`) USING BTREE,
  ADD KEY `idx_time_slots_store_service_active` (`store_id`,`service_type`,`is_active`),
  ADD KEY `idx_store_id` (`store_id`);

--
-- 表的索引 `topic_collect`
--
ALTER TABLE `topic_collect`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_topic_user` (`topic_id`,`user_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_topic_id` (`topic_id`) USING BTREE,
  ADD KEY `idx_create_time` (`create_time`) USING BTREE;

--
-- 表的索引 `topic_like`
--
ALTER TABLE `topic_like`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_topic_user` (`topic_id`,`user_id`) USING BTREE,
  ADD KEY `idx_user_id` (`user_id`) USING BTREE,
  ADD KEY `idx_topic_id` (`topic_id`) USING BTREE,
  ADD KEY `idx_create_time` (`create_time`) USING BTREE;

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_username` (`username`) USING BTREE,
  ADD UNIQUE KEY `uk_email` (`email`) USING BTREE,
  ADD UNIQUE KEY `uk_openid` (`openid`) USING BTREE COMMENT 'openid唯一索引',
  ADD KEY `idx_status` (`status`) USING BTREE;

--
-- 表的索引 `user_follow`
--
ALTER TABLE `user_follow`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `uk_follow` (`follower_id`,`following_id`) USING BTREE,
  ADD KEY `idx_follower_id` (`follower_id`) USING BTREE,
  ADD KEY `idx_following_id` (`following_id`) USING BTREE;

--
-- 表的索引 `user_hidden_conversation`
--
ALTER TABLE `user_hidden_conversation`
  ADD PRIMARY KEY (`user_id`,`conversation_id`),
  ADD KEY `idx_user` (`user_id`);

--
-- 表的索引 `user_notice_read`
--
ALTER TABLE `user_notice_read`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uk_user_notice` (`user_id`,`notice_id`),
  ADD KEY `idx_notice_id` (`notice_id`),
  ADD KEY `idx_user_id` (`user_id`);

--
-- 表的索引 `user_post_interaction`
--
ALTER TABLE `user_post_interaction`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_create_time` (`user_id`,`create_time`),
  ADD KEY `idx_post_create_time` (`post_id`,`create_time`),
  ADD KEY `idx_user_post` (`user_id`,`post_id`),
  ADD KEY `idx_interaction_type` (`interaction_type`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `addresses`
--
ALTER TABLE `addresses`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '地址ID', AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `admin`
--
ALTER TABLE `admin`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '管理员ID', AUTO_INCREMENT=61;

--
-- 使用表AUTO_INCREMENT `admin_permissions`
--
ALTER TABLE `admin_permissions`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=188;

--
-- 使用表AUTO_INCREMENT `appointment_cancellation_request`
--
ALTER TABLE `appointment_cancellation_request`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `appointment_change_request`
--
ALTER TABLE `appointment_change_request`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `appointment_reminder_sent`
--
ALTER TABLE `appointment_reminder_sent`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `banner`
--
ALTER TABLE `banner`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- 使用表AUTO_INCREMENT `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `china_region`
--
ALTER TABLE `china_region`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3430;

--
-- 使用表AUTO_INCREMENT `comment`
--
ALTER TABLE `comment`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=134;

--
-- 使用表AUTO_INCREMENT `comment_like`
--
ALTER TABLE `comment_like`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;

--
-- 使用表AUTO_INCREMENT `complaints`
--
ALTER TABLE `complaints`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `daily_topic`
--
ALTER TABLE `daily_topic`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '专题ID', AUTO_INCREMENT=39;

--
-- 使用表AUTO_INCREMENT `daily_topic_post`
--
ALTER TABLE `daily_topic_post`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '关联ID', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `daily_topic_theme`
--
ALTER TABLE `daily_topic_theme`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `department`
--
ALTER TABLE `department`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '部门ID', AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `door_cleaning_appointment`
--
ALTER TABLE `door_cleaning_appointment`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- 使用表AUTO_INCREMENT `grooming_appointments`
--
ALTER TABLE `grooming_appointments`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- 使用表AUTO_INCREMENT `grooming_services`
--
ALTER TABLE `grooming_services`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- 使用表AUTO_INCREMENT `grooming_service_banners`
--
ALTER TABLE `grooming_service_banners`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `hospital_appointments`
--
ALTER TABLE `hospital_appointments`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- 使用表AUTO_INCREMENT `hospital_services`
--
ALTER TABLE `hospital_services`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- 使用表AUTO_INCREMENT `litter_services`
--
ALTER TABLE `litter_services`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- 使用表AUTO_INCREMENT `litter_service_banners`
--
ALTER TABLE `litter_service_banners`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `medical_service_banners`
--
ALTER TABLE `medical_service_banners`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `message`
--
ALTER TABLE `message`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '消息ID', AUTO_INCREMENT=58;

--
-- 使用表AUTO_INCREMENT `notice`
--
ALTER TABLE `notice`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '公告ID', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `notification`
--
ALTER TABLE `notification`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;

--
-- 使用表AUTO_INCREMENT `order_item`
--
ALTER TABLE `order_item`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- 使用表AUTO_INCREMENT `order_logistics_track`
--
ALTER TABLE `order_logistics_track`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `payment`
--
ALTER TABLE `payment`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `pet`
--
ALTER TABLE `pet`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- 使用表AUTO_INCREMENT `pet_order`
--
ALTER TABLE `pet_order`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- 使用表AUTO_INCREMENT `points_record`
--
ALTER TABLE `points_record`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- 使用表AUTO_INCREMENT `post`
--
ALTER TABLE `post`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;

--
-- 使用表AUTO_INCREMENT `post_collect`
--
ALTER TABLE `post_collect`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=38;

--
-- 使用表AUTO_INCREMENT `post_like`
--
ALTER TABLE `post_like`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=132;

--
-- 使用表AUTO_INCREMENT `product`
--
ALTER TABLE `product`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- 使用表AUTO_INCREMENT `product_favorite`
--
ALTER TABLE `product_favorite`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- 使用表AUTO_INCREMENT `product_review`
--
ALTER TABLE `product_review`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- 使用表AUTO_INCREMENT `recommendation_interaction_weight`
--
ALTER TABLE `recommendation_interaction_weight`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `refund_request`
--
ALTER TABLE `refund_request`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '退款申请ID', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `review_like`
--
ALTER TABLE `review_like`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=3;

--
-- 使用表AUTO_INCREMENT `review_reply`
--
ALTER TABLE `review_reply`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `service_appointment_rating`
--
ALTER TABLE `service_appointment_rating`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `service_config`
--
ALTER TABLE `service_config`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '服务配置ID', AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `service_member`
--
ALTER TABLE `service_member`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '服务人员ID', AUTO_INCREMENT=44;

--
-- 使用表AUTO_INCREMENT `service_schedule`
--
ALTER TABLE `service_schedule`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=339;

--
-- 使用表AUTO_INCREMENT `service_stores`
--
ALTER TABLE `service_stores`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '门店ID', AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `shopping_cart`
--
ALTER TABLE `shopping_cart`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `sign_in_records`
--
ALTER TABLE `sign_in_records`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=36;

--
-- 使用表AUTO_INCREMENT `stores`
--
ALTER TABLE `stores`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '商家ID', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `store_warehouse`
--
ALTER TABLE `store_warehouse`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- 使用表AUTO_INCREMENT `tag`
--
ALTER TABLE `tag`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `task_records`
--
ALTER TABLE `task_records`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=115;

--
-- 使用表AUTO_INCREMENT `time_slots`
--
ALTER TABLE `time_slots`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- 使用表AUTO_INCREMENT `topic_collect`
--
ALTER TABLE `topic_collect`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `topic_like`
--
ALTER TABLE `topic_like`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键ID', AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;

--
-- 使用表AUTO_INCREMENT `user_follow`
--
ALTER TABLE `user_follow`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- 使用表AUTO_INCREMENT `user_notice_read`
--
ALTER TABLE `user_notice_read`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- 使用表AUTO_INCREMENT `user_post_interaction`
--
ALTER TABLE `user_post_interaction`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=176;

--
-- 限制导出的表
--

--
-- 限制表 `post_tag`
--
ALTER TABLE `post_tag`
  ADD CONSTRAINT `post_tag_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `post` (`id`) ON DELETE CASCADE ON UPDATE RESTRICT,
  ADD CONSTRAINT `post_tag_ibfk_2` FOREIGN KEY (`tag_id`) REFERENCES `tag` (`id`) ON DELETE CASCADE ON UPDATE RESTRICT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
